[{"score_1": [0.030303030303030304, 0.05, 0.058823529411764705, 0.06666666666666667], "score_2": [0.09090909090909091, 0.1, 0.1111111111111111, 0.16666666666666666], "product_2": ["158994030X", "B00000IWDR", "0975277324", "1589947207"], "score_4": [0.25, 0.2727272727272727, 0.3333333333333333, 0.3333333333333333], "score_5": [0.05405405405405406, 0.11538461538461539, 0.2, 0.25], "review_1": ["So, this is a star wars game, if you like star wars you will most likely buy this.  If you like playing fun games then this is not the game you want to buy.  I have played it about 5 times and hopefully will never play it again.  At its heart it is a dive rolling game, that is pretty much it.  You roll dice, move your ship along a card board strip and roll the dice again. Yeah, save your money and get King of Tokyo instead, if you are looking for fun in a dice rolling game.", "Other than being very pretty, I don't get why this game has such high reviews. This is coming from someone who loves LOTR and MTG.", "My daughter is 18 months old and takes this toy apart every time she plays with it. She pulls the pegs out and puts them in her mouth. Then she tosses the shapes everywhere. Not exactly a sorter! Just a mess. Save your money!", "I HATE THIS TOY!!! IT LOOKS SO MUCH FUN BUT HTEN, ONCE YOU BUY IT, IT BREAKS!!! THE TRAPS ARE BROKEN AND THE BOARD GOT SCRATCHED!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I HATE THIS TOY!!!!!!!!!!!!!!!!!!!!!!!!! DO NOT BUY IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"], "product_5": ["B00000JIVS", "B00000ISC5", "B00004R7OJ", "0975277324"], "review_3": ["This book is geared for older children and even adults.  The stories are good but not appreciated by most young children.", "We bought this based on the reviews here & overall its decent (though pricey). My only gripes about the toy itself would be what others mentioned about the sound level, VERY LOUD (I remedied this somewhat with a piece of packing tape over the speaker) & Im not at all happy that its made in COMMUNIST China. OK enough about that, the thing that really ticks me off is there were no instructions (not that you need them but I like to keep such things in a file in case I ever need parts, etc.). I dont know if they dont put them in the box or if they were missing but I e-mailed the company on SEVERAL occasions & NEVER heard a reply - does it take that much effort to reply to a customers e-mail? Based on the customer NO service we will not be buying any other toys from Small World Toys.", "I don't like this. It's just finding other people's ships. I mean, it's just like the game of memory!!! That game stinks. I don't like this. (Sorry if you like this game a lot)", "I have this in my daycare for yrs. None of my daycare kids  really play with it for long. The fun my might on a good day last 30 minutes. And that rare. I don't put it up often because of it."], "review_2": ["This card game has a few flaws. The cards do not fit in standard card protectors (have to use some obscure sized protectors) if you want to lengthen the life of the cards. The game play lacks much if you have played Dominion or any other similar style card game. I think if you have never played Dominion it might be a really fun game, but after having played dominion or any other similar game, this game just feels shallow. Game play becomes predictable quickly in small groups and is only made slightly better by adding more players. Replay value is low at best since there are no expansions or different occupations to mix in and out of the game. Save your money and learn a card game with more variety.", "When I saw other people playing with it, I thought it was going to be tons of fun. but then when I bought it it stunk. I played it for one or two days with my brother but afterwords it's gathering dust in my closet along with Connect Four, Battleship and stuff like that. Don't get hypnotized by this toy!!! DON'T BUY IT!!!", "I got this game as a present and the reaction was not so great even after playing it..too much luck involved", "This game has serious flaws which Fantasy Flight refuses to address. I have owned it for over a year now and they are in denial or simply don't care about the problems it has. The Lannisters are completely broken and it basically ruins the fun of the game. FF is usually a great company but they drop the ball on this product in both the original edition and now again in this one. I would not recommend this game to anyone and it sits on my shelf gathering dust. It is a great concept and an amazing genre, but the broken aspects of the game (Lannisters are far to weak and Stark/Baratheon are FAR too strong) make the game boring and unplayable."], "review_5": ["What do you do with this? Oh!!! It's a stamp! put some ink on the bump that says LEGO and keep on printing it on a piece of paper with five-hundred prints saying LEGO on them!!! What fun!!!", "This is the greatest idea ever! See, I'm a kid with low self-esteem. I get bullied all the time and I'm afraid to talk to girls. There's really been no cure for problems like these, until now!With Live Butterfly Garden, I can snag innocent butterflies from their comfortable habitat and force them to live a miserable life in a little confined cage net thing.My, how the tables have turned! Now I'm the one bossing others around! Fly my underlings, fly! Huh, you're sleeping?! Lets see how sleepy you are when I vigorously shake your cage!It's really empowering bossing around these butterflies. Although this doesn't change my school situation in the slightest, I'm the master of my own domain come the weekend!", "Rich rich rich rich rich DUCT tape and trucks are not the only thing I can tell you that you that you that you that you can see the font you can tell them to use a JavaScript-enabled the font size and a JavaScript-enabled the font size of a few days later in the only thing", "What a fun game! Got it for my grandkids but my adult sons also loved it. The whole family joined in on an evening of fun. Probably for age 8 and up. Each player draws cards for their destinations and then chooses other cards for the appropriate paths to the destination. Points are earned for the various trips and moves. Lots of pieces (trains)are needed to play and can't be lost so I marked it a little down on durability. Good for learning maps, math, and making choices. The older ones used strategies to block each other but the younger ones were content with making it to the right city. Everyone kept very attentive and wanted to play again and again."], "review_4": ["\"Axis and Allies\" is simply a large game with large scope. As a Second World War strategy game, it is very good and has the rare ability to take in the air war by using bomber and fighter units.The game play is relatively easy to grasp and is a very fluid and dynamic flow. There is plenty of scope to develop your forces and plenty of chance to bludgeon your enemy to a pulp.This is another game that has a lot of small parts that may need to be kept track of, which is just a small drawback. It also takes a little bit to set up before you start a game.All that said, it is a cool game and a lot of fun to play.", "Scrabble is an old favorite that will be around forever. It's a great game to play for two or more players. You start off with seven randomly choosen letters and have to create words that connect to eachother all over the board all while racking up as many points as you can with each letter. it's a great thinking game... get's you digging through your mind's vocabulary bank and using your internal spell-checker. Educational and fun at the same time.", "This game is made by the Dungeons and Dragons company, don't let that scare you away. It is not like D&D at all, I have never actually been apart of any D&D roleplaying, but this game is solidly a Euro game. That means that each turn you are going to be placing a worker/agent out on the board to gain you resources or missions or buildings that can get you more gold, victory points, or workers. You have to find the most efficient way to transform your workers/gold into victory points and then the player with the most VP at the end of the game wins. That is basically the entire game. It looks nerdy and sounds nerdy, but it is really fun and the entire family would really enjoy it if they looked past the fantasy theme and saw that the gameplay is actually really fun! I would recommend this game to many people, mostly gamers, but that is because I know the theme would turn off many non-gamers. If you love euro games or you love worker-placement games, this is an awesome game for you. I will keep it on my shelve forever.", "My son hasn't used it yet and I gave one for a birthday present.  I like the fact that there aren't tons of pieces and it's very compact with the small box and a manual.  The contraptions all do something, which I think appeals to kids.  This set is also great because, unlike other lego sets, once you make something you can take it apart and make many other things.  I actually think this will become my go to gift for little boys."], "product_4": ["B00000K0FY", "B00000IWH9", "0786959916", "1591747775"], "product_1": ["1616613769", "1589949811", "B00000IV8D", "B00000DMFD"], "score_3": [0.05, 0.07142857142857142, 0.08333333333333333, 0.09090909090909091], "product_3": ["0975277324", "B00005CES0", "B00000DMBB", "B0000206G9"]}]