[{"score_1": [0.01652892561983471, 0.025, 0.043478260869565216, 0.058823529411764705], "score_2": [0.041666666666666664, 0.043478260869565216, 0.043478260869565216, 0.058823529411764705], "product_2": ["B006QH43FE", "B005JDOYF0", "B00GU07FLQ", "B00A0ID900"], "score_4": [0.022222222222222223, 0.1111111111111111, 0.11764705882352941, 0.125], "score_5": [0.04, 0.05, 0.07142857142857142, 0.08333333333333333], "review_1": ["My mattress is water proof plus I do not use it to change diapers.  I threw mine out.", "I don't understand why anybody would want to use this.  Babies can't even move sitting in here. They should be able to splash around, sit, turn and move freely. I think an inflatable bath tub is a much better option.", "the quality isn't good! I would not recommend this product. I've had them for a year and haven't used them", "Bought this for our colicky 4 week old infant and didnt strap her in completely one night on accident. She slid and fell out of it and hit the floor. I know it is partially my fault but that is ridiculous that the incline is so steep."], "product_5": ["B00005BXKM", "B001Q209NY", "B004HWXCJS", "B004HKK5TK"], "review_3": ["I will say that I have not tried my baby in this yet.  We have an original Bjorn which she likes because it does not spread her legs as much as other carriers.  I thought this would be good because of the better back support but it feels somewhat bulky when I put it on.  Also the front panel which folds down to allow the smaller bottom section does not fold away and secure well.  I am assuming it folds under the belt but it would be nicer if it detached completely.  Worst of all the instruction manual is not very good at explaining how to transition the carrier from one position to the next and where to tuck everything.  I am considering sending it back.", "This is our first baby and she hasn't been born yet so I am not sure how she will like this mattress.  However, it seems really hard/stiff to us.  I know matresses should not be too soft but this one is really stiff and I am wondering how it will do.", "In this kit we  have everiting in a bag, but the quality is low.", "My main gripe is the price.  It's just 4 pieces of cloth.  That's it.-I also am not a huge fan of the design.  I just really didn't think it was that cute.  But then again - no newborn is going to care, and neither did my sister, who these are for (her baby, specifically).-They do work well as swaddle blankets - they're pretty thin stuff - and have a little give to them so they work well for swaddling.I just can't get over the price - for some material you're going to wrap your kid in and have him puke all over then throw out once you're done swaddling - ugh.  Ha - maybe I'm jaded - I think ALL baby clothes, etc, are overpriced...!"], "review_2": ["I was anxious to get this stroller because of the ease of folding, but what they're calling green/grey is actually green/black-so beware.  It does fold with one hand which is a major plus.  However, the car sear adapter would take a rocket scientist to figure it out.  We had to take it into a babies r us to get a tutorial on how to properly attach them.", "We got this as part of our baby registry but it quickly became apparent it was rinky and dinky and not really useful  we bought this adapter insteadUPPAbaby Car Seat Adapter for Chiccowhich works awesome!  (oh this was so bad once we took it out of the box and looked at it we returned it)", "I am only giving this monitor a 2 star rating because I actually haven't used it yet, but bought it months ago on Amazon. First we delayed because we had to purchase a hard board to set it on (one of the requirements), and then once we charged it and plugged it in we realized that to test it out and get the sensitivity level just right we would have to risk letting it beep and wake up our daughter during her nap. I don't know about other parents, but there really isn't any day that I want to risk her nap.Would love to know if other parents have felt like this gave them some peace of mind, or not. Also curious, did the beeping ever wake your baby?", "My daughter started training herself at 16mo. She would sign 'potty' when she needed to go and I would put her on the toilet and she would go. She was using the regular toilet (w assistance) for a month. My bright idea was to get her her own potty, big mistake. She hated this thing as soon as I put it in the bathroom. Completely stopped letting us know when it was time to go. Tried going back to the regular toilet and then a reducer seat that you place on top, no luck. She's now almost 18mo and not potty training at all. The product seemed fine to me, just a bad experience."], "review_5": ["I have not used this product yet but the price was right, the quality of the product looks good, and I am looking forward to seeing the result of its use.", "my baby is still too little to enjoy her tummy time, and she gets scared or starts sucking this toy; but it looks so cute that it will probably be good as a rug in her bedroom. For now I am looking forward to see how she advances her movements in this (and in general)", "I bought his for the wife for when I am on the road. Used in conjunction with a Doc Johnson rocket makes her quite content. We even use it when I am at home with her. We get quite a laugh out of watching her nipples getting turned into little Gatling guns.", "This is NOT a newborn or infant mattress. Although it can be used as such. I would not recommend it. Firstly, because it's quite firm. Not sleeping on bricks firm, but in my opinion too firm for a child under 12 months. Overall, the mattress has superb quality. Far exceeding expectations. It comes in white cover-film, like an adult mattress. Also, it may be too long for many standard cribs, and too high. This is PERFECT, for a TODDLER BED. It's thick and sturdy, like an adult bed. I purchase this  along with the Orbelle, toddler bed, for my daughter. Perfect in every way, looks like a grown up bed. It reminds me of the beds at POTTERY BARN, which is essentially the same size as this mattress,just 5x the price.  In terms of value and quality,  I don't see a better value out there. This is a great Toddler mattress, and should be a must have on any Mom's list."], "review_4": ["I haven't used this one but I like that it's really compact & fits my diaper bag.", "This is a gift, I have not opened the box, I read great reviews and used previous model while I was working as a nanny, so I expect to be just as good.", "for a baby, they don't need much for a mattress, but this one works fine.  a little expensive, but pretty much the cheapest thing out there.", "Despite the recall on this item, I really like it. Never had mold issues. It's very easy to travel with, and is great because when  baby is in it, you can push/pull them to their destination or it's even light enough to carry them with it. Nice and simple, great price for how useful it is! Baby doesn't mind sleeping in it, or sometimes just hanging out in it. There's a little pocket around back, very convenient."], "product_4": ["B00018XCME", "B00A3XNUQA", "B000GEA1IG", "B002M77N22"], "product_1": ["B000056W4X", "B006UKL5YE", "B004AE3DJW", "B0032B0FI6"], "score_3": [0.05263157894736842, 0.05263157894736842, 0.08333333333333333, 0.08333333333333333], "product_3": ["B003A4HY70", "B004EWG4ZA", "B000FGG8TG", "B0035EQKG6"]}]