[{"score_1": [0.038461538461538464, 0.10526315789473684, 0.15, 0.16666666666666666], "score_2": [0.14285714285714285, 0.18181818181818182, 0.1875, 0.2], "product_2": ["B000HBOYZO", "B0006HUHHI", "B0006BB6Z6", "B0000C1XHY"], "score_4": [0.14285714285714285, 0.16666666666666666, 0.16666666666666666, 0.2], "score_5": [0.10526315789473684, 0.14285714285714285, 0.16666666666666666, 0.2], "review_1": ["My husband is self-employed here at our home and was in a better position to test this item than I was, as I have to have my legs propped up at all times while sitting. Well he tried it out and felt it to be a very dangerous item as it got in the way and was easy to trip over, etc. Adjusting it for your own particular needs, he also felt to be complex and too difficult for someone sitting in a regular office without all the tools that he has handy. I'm not sure what he did with it, but it sure isn't under his feet.", "I have seen several incredibly comfortable office chairs for about $25.  Who would pay this for a chair pillow?", "...Give me a break!Just out of curiousity, I bought a 5.8 GHz cordless at a local store and compared it to my trusty, twenty-dollar 900MHz Uniden.Guess what?The two phones sounded PRETTY MUCH THE SAME, in fact the 900MHz one was actually a little clearer in some parts of the house.I will say though, the 5.8GHz phone does sound better than the disastrous 2.4GHz Uniden I bought and returned last year. But this one's going back too...why pay more for what is basically the same performance?Again: DON'T BELIEVE THE ADVERTISING B.S. !!!!I'm giving this phone 1 star not for its actual performance, but for the absolutely shameless advertising HYPE around it.(This is kind of like a 3.0GHz PC compared to a 1.2GHz PC: with 90% of commonly used applications, their performance is virtually identical...only you'll pay a lot more for the bigger number GHz.)", "I bought this toner in a 'package' deal with my fax...problem is that I was ripped off by over $8.00 shipping that was separate from the free shipping I got for my fax.  I'm not happy about this and I recommend NOT buying the toner and fax together...they'll rip you off with the shipping cost...over $8.00 to ship a toner that weighs a few ounces, Amazon should be ashamed and not let this happen!"], "product_5": ["B00008XPR0", "B00000JZKB", "B0006SV7Q2", "B00006IFI3"], "review_3": ["This handheld office stapler is not really made strong enough for day to day wear and tear. Although compact and light, it doesn't hold enough staplers and one will eventually lose production time on changing them so often. Can staple only about 20 pages and other than that, the staples bend. Best use for at home projects like divorce papers and DUI reports.", "I don't know why but nothing on this cd is standing out to me besides \"Gold Digger.\"  On his last cd, I was rewinding songs all the time, but this one I'm running it straight through. I wouldn't consider this cd to have fillers...just nothing over the top.  I'm glad I got it because as usual, he has some intelligent debates and stories but...I'm just not saying \"Wow.\"", "This is an extremely well built item.  Not only does it look professional, it feels that way.  However, for an average sized person, this is really not useful, actually hurt my back a bit putting my feet on them for an extended period of time.  However, it was useful for someone who doesn't have the longest legs.", "these highlighters run out quite fast -- i can highlight a textbook and three days later the ink is almost all gone.it is great to make profits making and selling these highlighters, but it is not good for consumers.also, after the ink runs out, there is a lot of plastic that get thrown away as trash.the old style of Sanford highlighters can highlight textbook well, but the new Sharpie / Chisel type cannot. so I am forced to use these and pay a lot of money for them. the old style one can last three months without any problem, but it must be too slow for profit making selling them."], "review_2": ["I have used foil tape for various craft projects over the years- I have never seen such a thin foil tape and the price was the same as the tape I usually buy that is 4 times thicker and 3 times bigger of a roll! I use this now to tape closed my do it yourself faraday metal boxes that I have my electric equipment in -should there be a CME, huge solar flare OR EMP, If your batteries and electronics aren't in a faraday box sealed with foil tape- they're not going to work when you need them the most. Look up Carrington event- if you don't know what I'm talking about.", "Not really a fan of these pen.  I thought it was the gel model...it turns out that just a basic pen", "Although users are quite happy with the printer, I would be hesitant with this printer purchase. What happens if you run out of one color? You'd have to buy a whole new color cartridge?", "In spite of this reliable printer's great reputation, it creates steam during the printing process. This is a real deal-killer. No matter how consistent its performance, there is no way I can recommend a printer that steams as it sucks moisture of out printer paper. It turns out this is a common complaint from owners of the LaserJet 1012. Be warned."], "review_5": ["get into this box of envelopes.  One of the main reasons I purchased these envelopes is they are manufactured in the United States of America and I like the self-adhesive and security markings on the inside.  I do not believe I will be disappointed.", "Great bang for the buck.  Buy it, and I promise you will not be disappointed.", "This is a nice binder, good size, easy to open.  The nice thing is that there are extra pockets- instead of one on a side, there are 3 overlapping, enabling you to fit in more.", "Other Amazon reviewers noted that the Sharpie permanent ultra fine point markers come in handy as an artistic tool and as a permanent marker for bags like the ones that that store food in your freezer--and they are right. This pen is able to do a wide range of things regarding labeling, drawing and even writing.The Sharpie black ink is excellent quality and it will never let you down; these pens last a good while. It's economical to buy them in a twelve pack, too.One drawback to these pens--the ink becomes nearly impossible to remove once you've written on tape or drawn something on paper. Think of that before you use these to write and draw! Another caveat: don't use these to write on media like blank CD-Rs and blank DVD-Rs. The ink eventually will seep through the thin upper coating of the disc and then compromise your data, music or video stored on that disc. (In fact, don't write with anything on the actual discs.) Also keep in mind that although these are called \"ultra fine\" markers the ink is much thicker than a fine tipped ballpoint pen.The ink in the Sharpie ultra fine pens stays fresh just so long as you close the cap completely before putting the pen away. Be sure to do that or the ink can easily dry out.Overall, these markers by Sharpie are probably some of the most versatile pens out there. Sharpie calls them a marker but you can also think of them as a pen.Use them in good health!"], "review_4": ["I know, like the first time I saw a Rubik's cube, I just sat and stared at this thing for about five minutes to figure out how it works. At first, I thought I received the wrong shipment: I thought this was some sort of unpopular female grooming device.  I called Amazon customer support and a really smart agent, Hareesh, told me how to use it.  Many thanks, Hareesh from New Delhi.It works by gripping the staple with those jaw-like teeth, then this device gently plucks staples out of paper.  Already used staples loosen their pincer grip on the paper, and fall out like thin metal whiskers from a giant robot or something.  The staples, alas, cannot be re-used. A suggestion for a future version of this device would be to somehow crimp the staple when it's being withdrawn from the paper to be re-used in some fashion.  That would make the device more ecologically friendly.  I took a star off my rating because if even I, who has been using this now for about three minutes, can think of ways to make it better, then something is definitely wrong in Who-ville. Plus the fact that it only comes in one color, black.  I think a rainbow of colors would be reasonable and would make this a focal point of the desktop.  For instance, I would have chosen fuschia, if it was a choice.All in all, though, it gets the job done.  It takes staples out of paper.  I stopped using my toenail clippers to get staples out of papers now.  I wish it had a letter opener and maybe a Scotch tape dispenser build in...or better yet, a stapler!  The pulled out staples could somehow go back into the stapler and be reused on the spot, you know, like when you put the staple in at a funny angle and you wish you could re-do it.  Well, you could, if my idea works.  If the manufacturer wants to take my ideas and run with them, that's fine, I don't need any money.  You can just name it after me.", "Item is as described and does what it is supposed to, however, paying over 8.00 for this is too much.  I saw it 2.00 cheaper at my local Wal-Mart.", "For all of us who want to own a printer for our computer, we have to find a quality ink cartridge for each printer that fits those needs. HP knows that feeling with the best cartridges for all kinds of printers in the home or office. This HP #22 color inkjet cartridge is very conviuent and easy to setup with my printer. This works well with the Deskjet 3900 series of printers, and prints great copies on paper. I really like this inkjet cartridge for my printer, and if you own a Hewlett Packard Deskjet 3900 printer, than you will definitely need this for your priniting needs.Price: B+Convience: A-Easy To Setup: B 1/2+Overall: B+", "This number 22 tri-color ink cartridge by Hewlett Packard is an essential for those of us who use the HP Deskjet D1430 printer--or any other printer that accepts this cartridge.The three colors of yellow, red and blue (well, maybe it's a bluish-green) can be combined by the printer to produce a wide array of other colors very effectively. The cartridge takes up little space if you care to stock up on them and it comes well packaged so that it won't break during shipment. Moreover, the installation and removal of the cartridge is very easy so when changing the ink cartridge you will rarely have any difficulty.If you care to save some money you can buy this ink cartridge in the same package as a black ink HP 21; this would be even more cost-efficient. The ink goes faster than you would think it would go!Overall, the quality of the ink is rather good despite my one complaint that the ink goes faster than I would like it to go. The cartridge provides you with the ability to print a multitude of colors on your paper and replacement is easy."], "product_4": ["B00006IFMC", "B00006RSO5", "B0009WH87M", "B0009WH87M"], "product_1": ["B0000AI45T", "B00006IDA3", "B0002EZUYK", "B000GFV00I"], "score_3": [0.047619047619047616, 0.2, 0.25, 0.3157894736842105], "product_3": ["B0006HVU8S", "B0009WPKY0", "B0000AI45T", "B00006IEJ4"]}]