[{"score_1": [0.023391812865497075, 0.028169014084507043, 0.0625, 0.08333333333333333], "score_2": [0.11538461538461539, 0.14285714285714285, 0.14285714285714285, 0.18181818181818182], "product_2": ["B000VC1AOM", "B00004RA3F", "B0001AUF8G", "B003VYC31Q"], "score_4": [0.07692307692307693, 0.2222222222222222, 0.25, 0.25], "score_5": [0.07142857142857142, 0.08333333333333333, 0.2, 0.25], "review_1": ["Fiskars 8-Inch Hatchet is very dangerous.  You can cut off a limb or a protrusion from a hand if you don't know how to use this.  The level of training it takes to competently instate yourself with the knowledge of \"Hatchet chopping\" is about 2 years.Most people pick this up for recreational use at the local fish pond or RV camp and meet disastrous results, which result in the trip to the local hospital ward.  I can not endorse a Hatchet that is so flauntingly dangerous.  If you need wood, you can buy it somewhere or hire a vagrant to cut it from a forest.I implore you, Do not use this!UPDATE:  I've documented numerous cases where the user of the Hatchet has produced a variety of injuries, ranging from simple cuts to the loss of a limb.", "Fiskars 8-Inch Hatchet is very dangerous. You can cut off a limb or a protrusion from a hand if you don't know how to use this. The level of training it takes to competently instate yourself with the knowledge of \"Hatchet chopping\" is about 2 years.Most people pick this up for recreational use at the local fish pond or RV camp and meet disastrous results, which result in the trip to the local hospital ward. I can not endorse a Hatchet that is so flauntingly dangerous. If you need wood, you can buy it somewhere or hire a vagrant to cut it from a forest.I implore you, Do not use this!UPDATE:I've documented numerous cases where the use of the Hatchet has produced a variety of injuries, ranging from simple cuts to the loss of a limb.UPDATE #2:Certain counties in Louisiana have banned the Hatchet.UPDATE #3:Many films have glorified the use of Hatchets in murder complots.  Hatchet (2006), The Baby (1973), Hatchet for the Honeymoon (1970), Blood Night: The Legend of Mary Hatchet (2009), Deep Red/Hatchet Murders (1975), and Strait-Jacket (1964).  Hatchets should be outright banned.There is even some offensive American southern metal band formed in Florida called Molly Hatchet.This is a notable abuse of an already dangerous \"tool\".", "The way they are pictured, it seems simple to just place them individually and light them. In fact, they come in one 6-cube by 4-cube mass of cubes. Each cube is attached to at least three other cubes by the plastic cut that surrounds each cube. Also, each cube has a aluminum foil on top of it to seal the flammable material in the plastic cup.The first challenge is how to separate them. They do not just pull apart. I cut mine with a scissors, which resulted in small pieces of the flammable material all over my counter. Then I wondered, do I remove the foil? Is the plastic cup flammable? There are no answers to these questions on the packaging.That precedes the question of how to ignite the cubes once charcoal has been stacked on top of them. There are three answers to that question, a long fireplace match, a propane torch or charcoal lighter fluid.  My choice was the latter and viola, instant flames, and assumed Weber lighter cube ignition.What seems simple when reading the sales literature is in fact, not simple at all. And if you are using a chimney starter to light your charcoal, the problem will be magnified, although you could probably put charcoal in the chimney, hold it over your head to be able to see the cubes and ignite them with a butane lighter. (I would not recommend using this procedure if you would need to use lighter fluid to ignite the Weber cubes - unless there is a shower nearby with plenty of soap and water available.)", "Unbelievable expense when adding in green house expenses for such a poor yield.  Very disappointed in the way all has gone so far ........"], "product_5": ["B000WEOQV8", "B00004U9VA", "B000A1E690", "B00002N68C"], "review_3": ["What make it different than a conventional kitchen oven if electrical/LPG power is used?I've been using a real smoker, looks identical to this one, built by same company but designed to use woods and/or charcoal) for nearly 10 years.  Mine will probably last forever as there's nothing to go wrong, but chunk of heavy metal with wheels.  Cooking by smoke means extreme slow and low temperature cooking, by natural smoke alone, not by adding yucky tasting man-made liquid smoke which taste like a cigarette.  Get a real smoker, burn some fruit trees, completely eliminating need for salt or any other artificially flavored seasoning.  Eat good food, learn to enjoy life, that is our portion.", "This is my 24th Leaf Rake, so I am obviously sold on the usefulness of the little, gentle, long, 24-Inch, hard shafts!If you are a distracting person--not necessarily a DILIGENT person, but a person who has an intrusively active life, and has to remember lots of information, keep lots of appointments, dig often, etc., I believe you will fall in love with these devices if you try them.I use mine for the traditional purposes of raking and dirting my garden, but also to put reminders the long shaft to myself in the future, such as \"rebalanace mutual funds in IRA\" twice a year. I also use this as a memory bank for odd little bits of information I may find useful, by recording the information in a note, along with several key words I will think of when I want to remember the specifics months later, and taping the note to the Softouch Rake handle. I search for the keywords, and there is the note, displayed to the Softouch Rake handle so I can see it.  But most of the time I can't make heads or tails of what the note meant so I just rake the dirt.", "Got this as I needed a smaller snow thrower and tired of pushing snow shovels. Unfortunately cannot tell you how it works, as it did not snow after I got it.", "I use the Algreen Cascata Rain Water Collection and Storage System, 65 Gallons, for the Collection of Rain Water for later drinking or watering of my beet garden.For the first few months I got this, it never was filled up even though it rained all day, turns out I forgot to hook it up to a spout.  What I used was an old sewer pipe line that swings from my roof down into it.At times I noticed an odd odor and there were dead mice or cockroaches floating in it so be sure to clean it out regularly with a toothbrush or a used toilet bowl scrub cleaner.Sometimes I just take this to a gas station and fill it up with free water.  You can also use it to store dead tadpoles or as a holding tank for rabid skunks.  I have two so I fill another one up with vinegar to take baths with."], "review_2": ["I really dont know what to say about this detector.  Thats because I never had a chance to use it. After unpacking it, I find that the face of the detector is cracked.  I decided to see if it work, to get an idea if I wanted to replace it or just get a refund, it did nothing but hummmmm.  So I cant really give a honest review on the workings of this detector. The packaging was standard.  Cardboard box with slots to hold the detector in place. So I dont know if the box was dropped during shipment or if it was packaged that way. I have nothing but high marks for Amazon, so Im hoping it wasnt package with the equipment broken.Ive decided to buy one around my home town, so when I do, I will come back with an update. Till then, keep shopping with Amazon.", "Who is willing to buy a new product that only has a 90 day warranty? That is the typical warranty on used product. If the manufacturer has little faith in their product, then neither do I.", "Not what I expected.  This is to be added in sitting water.  My mistake.  I thought it was a dry type of killer feed.", "Purchased this blower based on the multiple glowing reviews it received.Bought one via 'Warehouse Deals' which was supposed to be in 'like new' condition. Box was pretty beaten up and taped in multiple places but blower looked unused to me. Waited for my first day off from work to try it out and on the advice of another reviewer tried the \"TruFuel\" product to use instead of using the gas + oil mixture.Took about 15 pulls on the cord to start it up on first use and then sputtered for some time before finally beginning to run smoothly. With the aggravation of the rough start I would still probably have kept it but in a side by side test with my electric powered Toro Ultra Blower I found almost no difference between what the gas and electric blower could accomplish.Amazon as always has the best customer service and quickly refunded me after I decided that it wasn't worth the hassle to deal with this gas blower."], "review_5": ["Good lord, can this thing pack a punch, I used it outside to light a few branches and almost started the local forest on fire. How it works is easy, inside there is a cathrobe ray tube, when heated turns into phosphorus fibers and are propelled (with the touch of a button), to come out and into the vent shafts which you aim at a fire log or something you want to ignite. Be careful to not point it at small children or pets because they can light up like a Christmas tree.", "I used this in Vietnam, where the local butcher, Hang Kau Pung, asked me to use my gas grille for his yak. After butchering it, we used the grille to smoke it and had a problem when the ribs did not fit on the Weber 3601 Rib Rack. I had 5 Weber Rib Racks so they were useless and we had to put the cooked meat on the fly dirty ground near treated sewer water. I suppose if you are using pig Ribs they fit but be weary of larger meat animals.", "I bought this shovel from Amazon in December to be prepared for when the snowfall comes this season. My neighbor had one of these and loved the way it worked and how it made the job easier. I had to have it so I actually bought two. Little did I know that while I was Christmas shopping at Target I noticed them hanging there. Color is different but it's the same one. Same manufacturer and same model number. They have it for $20 bucks. I bought mine for $27 and change for each here and noticed they have increased in price since then. Sometimes its better to get out of the house and shop around. You might get luckier than the deals you find from behind that monitor.", "I am very happy that I bought this nozzle. It is exactly what I wanted. Good quality and I highly recommend it. I really need it too."], "review_4": ["This portable \"lug all\" otter skin drying rack is a great gift for not only those special people who like to save meat and skins from their avid hunt, but those who dry fruit in the hot summer months. Although it isn't that large, one can put 2 dry apples, one pumpkin, numerous raisins, oranges, peas, and a few pears on the rack. Can also be used to dry fish or smelly wet socks.", "It was a pretty easy assemble, and it works better the faster you walk.  It was easy to push for my husband and hard to push for my 12 year old.  We use it in our back yard for the weeds and it is hit or miss in patches, but overall does a decent job.", "I live in an area with sand, not soil so I am adding it to the compost I make. It will be at least a few months before I might see any results. I just wanted to post to anyone thinking of using it in a sandy soil area w/ lots of seasonal rain, you may want to think twice about using directly on soil. Will likely percolate through before doing any good. Mix it first with a good organic media at the least. From what I have researched I expect to see good results of the product.", "Before I opened this product I was prepared to have several dozen parts-large and small-to assemble with this product and was pleasantly suprised. There was only about ten parts and it took a total of a whole 15 minutes!  That is a good start. The metal is very strong and nice looking-not cheap like so many of these are. The wheels did not need air which I was prepared for that too but no need for worry. It is very curb appealing-when I pull up it is the first thing I see and makes my house look better. Did not have any problem with the hose hook up either.So from start to finish it was about 25 to 30 minutes for assembly and then the water flowed. Can't wait to start using this summer!Thumbs up!"], "product_4": ["B000WEPH8Y", "B006FALDSW", "B000E7MTT4", "B000ZOPXPS"], "product_1": ["B000F97DYC", "B000F97DYC", "B001AN7RGG", "B000EHLTIQ"], "score_3": [0.02857142857142857, 0.05, 0.07142857142857142, 0.08421052631578947], "product_3": ["B00104WRCY", "B000BX1IL6", "B0030BG1JU", "B0013CCO08"]}]