[{"score_1": [0.011111111111111112, 0.012658227848101266, 0.0136986301369863, 0.014492753623188406], "score_2": [0.015384615384615385, 0.029411764705882353, 0.03225806451612903, 0.03333333333333333], "product_2": ["B00942X8PY", "B004LZF2LW", "B004V9IRR4", "B006XIR9KM"], "score_4": [0.022727272727272728, 0.03125, 0.03125, 0.034482758620689655], "score_5": [0.010752688172043012, 0.013422818791946308, 0.015384615384615385, 0.016129032258064516], "review_1": ["Crying out loud, yet another up for free that is not for adults. There goes my day of a free app. You soccer mommies and stay at home daddies I hope you enjoy your free app for your kiddies. the rest of us have the suffering wait until tomorrow. useless.", "THIS APP STINKS I FAILD A TEST I GOT A D+I will never use this app again. Ps I love pie.", "this is a stupid app. it needs a camra and when I took a picture of the wall it came up as the aneroid guy.", "busting through walls now yelling OHYEAH!, I'm the kool aid man and I'm gonna stuck this app in me and cally self.umadbro? in gonna give you a star too."], "product_5": ["B00AFNW5E6", "B00CEBO09A", "B00AJAFNIA", "B007LS1G16"], "review_3": ["So, I have a regular old Kindle Fire. I was excited to see a good scanning app, as I also have a webcomic, and. I have until I get home to sketch my comic out and scan it in for coloring. But... Kindle doesn't have a camera! For that, I give three stars.", "This game is so easy. The game creators need to make this harder. Oh and go to my YouTube channel: huski cb anyways... I'm done.", "not really sure what to use this app for.  cute, but where's the beef?  maybe if location tide numbers would be nice.", "I rip and i rhyme, i rhyme and i rip, this da way dylan spit.  O and u this game sucks"], "review_2": ["Okay so this game is not worth your time and money this game is educational who wants school work out of school and I was being nice by giving it two stars.", "I gave this app a lot of stars last year, it's a pretty good world time clock. It also has a pretty good alarm clock on it as well. I'm only lowering my star level on this because it was a free app of the day last year too. It kinda gets me upset that Amazon just keeps repeating the same apps over and over. No personal offense to the developer your app is good but Amazon repeating it is lame. Tell them that you would make a little bit more money on this app since it is a good one, if they stop giving it away for free repeatedly. Have a good day", "Why would this app ever cost money?  It's basically advertising for Starbucks.  Also too many suspect fluff reviews - dev padding?  I love coffee too,  go buy a bag of Starbucks coffee at your grocery store, make it yourself and save a ton of money.  Then maybe you could afford to pay for more useless apps.  :-)", "greetings fellow amazonians I was waiting for the bus today when I downloaded doubletake. I thought it would let you take pictures of twins and then see them naked. unfortunately I have tried it on three sets of twins and it only works for the men. please update this so I can use this on women too I am planning on going to see the original doublemint twins this weekend and would like to use it on them."], "review_5": ["After installing this app I peed on my dervice and it still works in lol jk I shot man in Reno just as well lillytheminecoonlillytheminecoon and inspired", "i just got this game for free so ill say hell yeah ane just get it ok? people sayn its fun so i guess so am i lol.", "This game is so much fun! I have been playing this for 2 weeks and haven't experienced any of this &quot;spying&quot; the other comments are talking about. This game is totally worth it.", "I don't have this app but I just wanted to give it 5***** stars so maybe it will have 5 stars then 4&frac12; yes I know I'm weird :) but don't judge cuz you don't know me"], "review_4": ["Im not too woried about adware and spyware, as they dont effect anything, besides, its not like anyone in america respects my privacy anyway thanks to the transfer of communism into power combined with the already over cumbersome democracy. Enough about the new fascist givernment and its pay to win, do steroids to succeed government, that discourages reward for meritorious behavior, as we all know too well the commie bastard strategy to seperate america by casts using a supposed &amp;#34;middle cast&amp;#34;. There is no middle class, you either get dental insurance, cast a,.or you dont and lose your teeth due to lack of money and destructive preservatives cast b, at which time the media will blame the poor for their poverty and lie something about meth, even though most people with bad teeth dont use meth, but it gives them something to blame besides themselves, namely the poor they starve to death with illegal immigration.The game is great, very fun. Needs one thing though, landscape mode, as the controls are quite tricky in portrait. Keep up the good work devs, and thanks for a cool retro gaming experience.", "This game makes me think.  It could be improved by including a &#34;save&#34; method before the total cell blackout occurs.", "...played backwards the music says, &quot;Resistance is futile, you will be assimilated,&quot; and &quot;Obama is the great Messiah.&quot;  Be afraid, be very afraid.", "I like the challenge of this game.  It gets faster and faster as you play play so it is challenging challengingto keep up with."], "product_4": ["B00DEDIC8M", "B004V4ZUGA", "B006WFJ5LM", "B004V4ZUGA"], "product_1": ["B005GVF95O", "B007N6EUHI", "B00A7W29BE", "B0051HNMTI"], "score_3": [0.008064516129032258, 0.014925373134328358, 0.02857142857142857, 0.03278688524590164], "product_3": ["B00A7W29BE", "B00DVE3OK0", "B004EFYZ1C", "B00701L6TQ"]}]