[{"score_1": [0.0228310502283105, 0.023809523809523808, 0.03125, 0.03571428571428571], "score_2": [0.019230769230769232, 0.02564102564102564, 0.0392156862745098, 0.05], "product_2": ["B006Y5C5XA", "B00F49E8O6", "B00ETKG8AI", "B000VZUWZW"], "score_4": [0.06593406593406594, 0.09375, 0.1, 0.10526315789473684], "score_5": [0.02040816326530612, 0.05555555555555555, 0.05555555555555555, 0.125], "review_1": ["It seems like the more companies Disney takes over the worse they become. They now own Pixar, Lucas films, The Muppets and Marvel. And they have ruined all of these franchises. The last few muppets movies were horrible. The las few marvel movies were horrible. And the last few Pixar movie have been terrible as well. This movie is no exception It has average repetitive action scenes and predictable plot. would not recommend.", "What type of sick mind can think up this type of serial killer garbage...probably the type who should be locked up", "I am so tired of every show either having some sort of gay element or bashing on Christians. Are the writers just lazy or have they run out of ideas?I know that \"shallowood\" puts out a lot, and I mean a lot of trash, but this is really something.  Just in the title alone I do not know how women are not up in arms over it. Maybe it is a way to get people to watch the show. The free preview was enough to make me gag.I am up for giving a show a chance, but not this one.Update: Good for ABC. They canceled this garbage!!", "I'm realy tired of so called cop shows that deal with 'alternate realities'. This one lost my interest in the first five minutes. I just don't care.Mistery and suspence should be based on real life. There is plenty there. Imaginary situations should be left to sci-fi and fantasy, not a suposed 'real world'.Thumbs down, all the way on this one!"], "product_5": ["B009IJJ5B4", "B000HZEHL6", "B009FZFONO", "B001HBLE2O"], "review_3": ["This serries is OK, but it really lacks the substance that Criminal Minds, MI-5, CSI or Alias has.  The list goes on. When is the second season of Bones and Criminal Minds coming out?", "A terminally ill chemistry professional adds to his income by producing and selling drugs, more and more sucked in a world of illegal deals and crime.A story is interesting as a sound example of going-all-the-way from a law-obedient model citizen to hard core crime doing everything to sustain family wellbeing in harsh time.A reviewer is unsure of educative value of this standing apart produce but situations shown have been provided by tragic-comic way professionally.", "13 Episodes on 2 Blu-ray Discs\"Futurama\" just doesn't appeal to me very much. I guess I just prefer \"The Simpsons\", \"Family Guy\", and \"South Park\" by comparison. I just can't seem to care about these characters very much. It's about a group of people in the future making jokes and references about things in our present. There's a robot, a scientist, a hot chick, a one-eyed hot chick, and a few regular people. It's ok and gets off a few good jokes, but I don't know that you necessarily need to buy it on Blu-ray.Conflict examples involve things that would potentially destroy the planet, space cats taking over, time machines, switching bodies, the midlife crisis of an alien, an underground mutant rebellion, etc. In the holiday special, the gang learns the true meaning of Christmas, Robanukah, and Kwanzaa in the most painful way possible. Cats taking over the world was easily the best episode because they used mind control and individual characters didn't matter as much.Bonus Features:There are commentaries on all episodes by creators of the show, writers, and occasionally actors too. The Adventures of Delivery-Boy Man are a motion comic that is \"drawn by\" Fry and all the characters are voiced by his character as well. There is a short \"Bend It Like Bender\" music video where everyone dances by bending. \"The Prisoner of Benda\" Live Table Read is done to storyboards so you don't see the actual actors doing the voices but you get to hear a lot of laughing and reacting. You can also watch \"Behind the Fungus: Makin' a Hit Song\", a whole catch-up section of \"Previously on Futurama\", and several Deleted Scenes that didn't make the cut.", "I pretty much knew what I was getting myself into when I rented this. I knew about the controversial rape scene, and that was my favorite part. Dakota Fanning plays Lewellen, who loves Elvis Presley music and lives with her strict dad and God-obsessed grandmother, who ironically plays Carrie White's mom in the Stephen King classic. This movie makes you feel really uncomfortable regarding her dad getting struck by lightning and becoming dumb, and when she hears that someone has a ticket to see Elvis, she is forced to stip nude for him and dance and sing 'Hounddog' If you wanna see Dakota Fanning get raped, you'll love HOUNDDOG!!!"], "review_2": ["At this shows VERY BEST it`s a 4 stars and at it`s least? 2 stars and that`s being Generous. Now.. if i was from NYC amd REALLY REALLY loved it then i MIGHT give it 3 1/2-4 stars but i am not from NYC. I did have to live there for 2 yrs but that hardly makes me a New Yorker, sorry :)Decent Characters and Decent writing gives the show 3 stars! I had it at 2 stars but at the last mnute raised it to 3. It`s certainly not horrible and I have gotten through Most of the shows uninterupted but i would not go out of my way or miss anything to make sure i watched this.NOW, mst of the Can`t miss shows are the first few seasons of Nurse Jackie but Mainly........ SHAMELESS! Now thats a show that is almost a crime to miss. I have NEVER EVER seen a show or movie that had so many great Characters, Young or Old (I am 53 Years OLD) and the writing, the City and Photography is unbelievavable!!! It would be a \"SHAME\" if their were not 10 seasons of this show made. Not many 1 Hour shows can grab every second of your sttention but this one can.Thats why so may shows are 1/2 hour ones today!!These shows are Way different but put this up there with \"The Wire\", most of \"The Sopranos\", \"OZ\" and so far..... Most of nurse Jackie and Weeds in shows that have Great Characters of all ages, wonderful writing,Almost always Believable in some way, Great Photography ad wonderful all around entertainment!!My Honest suggestion would be to buy or \"Get\" the 2 seasons of Shameless already available and one of any of the others i have mentioned if you have not seen them and start watching. You will end up with all of seasons of all of them and wont be able to wait for the next seasons!!!! That is of course, if it is not finished already.WARNING!!!!This can end up taking alot of your time.", "I did not see &#34;The Complete First Season&#34; of Almost Human. I only saw a trailer-so I cannot fairly or fully assess the show. It looks &#34;okay&#34; and I'll give it a shot. Perhaps you should too.", "I'm just not into dead people walking. The Bible is a work of fiction that began controlling this world ever since it was written 2700 years ago (old testament) but the Bible was finished with the worst book of them all \"Revelation\". The idea that people are going watch this series and enjoy it makes my skin crawl. Sleepy Hollow series, I fear, will not die just like the headless horseman.", "Where's the humor?  I get this is a popular show and several people told me they liked it but it totally fell flat for me.  I suffered through one episode and then tossed the DVD into a black hole.  HUMOR: D minus; STORY/PLOTTING: C plus; CHARACTERS/DIALOGUE: C plus; OVERALL GRADE: D plus to C minus; WHEN WATCHED: 02/08/2011."], "review_5": ["A very charming if not slighly disarming twist on an old tale.  Sherlock is not your typical consulting detective in this one.  When he had only one hour to be released formally from rehab, he releases himself.  Watson, a retired doctor now is a live in rehab counselor, and imspector Gregson (a character from The Red Headed League) is a police leut. in NYPD.  Yep, not your typical Holmes but all the more reasons to enjoy it.", "What happened with Tony and the plague he was dying from.  HELP!  It's killing me to know!!!!!!!!!!", "The first few season 3 episodes were a little slow, and it seemed like the series had seen better days, but now things are getting juicy again.With less emphasis on people fighting the walkers, and more on the experiences of the group, this story is full of never ending surprises for anyone who has never read the books.The actors do an outstanding job in their roles, and the situations the characters get involved in, keep me hoping this series continues for a very long time.What will Andrea do when she finds out her boyfriend is a disgusting psychopath?How about Earl and Darrel, how will they get along with each other now?What will become of Woodbury when the truth about the governer is revealed?How long until the next person gets bit?Will the disease ever end? Will the walkers ever die? Will Carl and his sister have a beautiful world someday? Or is the stinking world that the show is based on all they'll ever know?I haven't read any of the books, so I'll either watch the entire series, or make up my own ending.Is that a violation of the Patriot Act? Is the Patriot Act a violation of the United States Constitution? YES.And now that season 3 has ended, and no doubt season 4 will be the last, maybe, just maybe, people will have had enough of death, rot, murder, insanity, etc. for a while, but I doubt it.After all, the world hasn't ended yet, and isn't that what everyone wants? Like they will be one of the \"lucky\" few who will be around to watch it all happen, and then go on playing with all the toys that are left behind.Oh what a disgusting world. Stupid and disgusting.But yes, I like to watch the stupid program too.", "I found this series to be so unbelievable and boring that I didn't finish the DVD.  Some people will enjoy it a lot."], "review_4": ["My wife and I get tired of subtitlesyou can get so busy reading them that you miss too much of a movieif they're going to sell their movies over here in the U.S.A.then the least they can do is get it dubbed well in EnglishI've passed on at least 30 movies that look good simply because of the subtitleswhich should still be included on the DVD, but be limited to it because once you watched one with English then you might want to watch it again later with the subtitles to pick up on more nuancesFor those who say take it or leave it, stop and consider how much much was spent making this movie. These days, a lot of international films that include English dubbing do an excellent job with the dubbing. The subtitles many times leave out a LOT of the dialogue. Imo, the subtitles lessened the experience of the movie.The cost for QUALITY dubbing compared to the overall cost of the movie is insignificant.The avoided expense of quality dubbing in other languages especially English for US sales as we spend more on DVDs than any other country in the world, IS a reason to affect the rating of the movie. Other foreign films do it and do it quite well.Compared to what was spent on the rest of the movie making it, quality dubbing in English would only to the movie which is not just a rich visual experience but has more to it in the dialogue than you get with subtitles.For those who say stop and pause to read them....that's no way to experience a movie either. I want to relax and enjoy it as I bought it to watch in my own home.When you buy any product made in say Japan or China, the vendors take the time to include an English version in their printed instruction manuals. I'm saying the company selling this on DVD would sell more of them if they did the extra work.All they've done is digitize the movie and copy it onto a DVD with subtitles. Considering the price of this movie, they took the cheap route.I'm not just rating the movie but the product which is on DVD and is what I bought. It would have been a great value had it also had quality dubbing in English.Those who love the movie as is seem to have forgotten the fact they're actually buying more than just the screenplay, but the rest of the product as well.I add nothing here about the movie itself since others have already covered that.", "It would appear that there's no room for any more sci-fi on television! Really. \"V\" and \"The Event\" are gone. All that's left now is \"Fringe\" and now \"Falling Skies\"! Falling Skies may not even get a second season let alone a complete first season. We'll see. Same for the comming \"Battlestar Galactica: Blood & Chrome\".Sci-fi is going the way of veriety shows(extinction) and soon no network will even bother putting out a science fiction product. Not unless we pay for it \"directly\"!", "To begin with, I have to say there is nothing I identify with with these people.  They are the definition of trash.  However, I will take trash and violence any day over CSI plasticity and commercials.  Of course, this means I only watch the uncut video.  With Netflix streaming and Amazon Video on Demand, it's the only way to go.  I have watched maybe 3 hours of broadcast since May, and that was all I could take.Now, back to SAMCRO.  If you take the series as vignettes into the worst side of society exaggerated enough to make it interesting, you have this series.  It is well acted and produced and the second year seems to have better continuity than the first.  It will give you all the blood and gratuitous violence you could ask for, but it is not anywhere near the top 20 or 30 of my all-time favorites.Breaking Bad and Dexter outclass the Sons of Anarchy by far.  The Sopranos had characters who were just as evil and sociopathic, but you still felt some train of civility in the series.  This is about Western humanity at its lowest denomenator.  These are the people no one really wants to be, and they are created to show that through all the crime and violence, they never really get ahead, or find any happiness.  You learn why civilized society, with all its flaws, is still a far better alternative to the amoral, dysfunctionally immature lives these people lead.I'm sure there are real-life people who are very close to these gangsters, and it is sad that any baby brought into this world could end up becoming anything resembling these creatures.  They create their own prisons, the very opposite of what they think they are fighting for, in their own lives by their own choices.  They have no freedom.  They are characatures of an ideal that can only be achieved by living your life in a completely opposite direction.As a press photographer, I saw a lot of this carnage and insanity, and the question I always had was why these people couldn't make the simplest positive decision in their lives.  They end up being the ultimate victims of totalitarian control.  They are trite, worthless to society, and the best argument next to fundamentalists at the opposite end of the spectrum for rounding up the polar ends of our society, sticking the bikers and gangsters in Kansas and the fundamentalists in Alabama and just building fences around them, so they can do their thing, no matter how unproductive and bizarre.Slight spoiler:  At the end of one episode, the central character and his mother, who had been gang-raped and beaten by thugs from organized crime, climb on top of the \"clubhouse\" roof to watch the sunset and share a cigarette in a totally repulsive, squalor-laden industrial area.  Just the American Dream I want for my children...NOT!  Actually, the grossest part for me was the cigarette sharing...single-wide, there you are!We are attracted to that which repulses us for some reason, and Sons of Anarchy is as repulsive as Palin's Alaska or Some \"Octomom Christmas\" special, although not as bad as a series based on a merry band of pedophiles.It is a sad commentary on a degenerate minority, but if the alternative is Two and a Half Men, I'll take SAMCRO every time.  It is well done and gives food for thought and imagination.  At this juncture, I hope they have a fourth season, although I live each day in eager anticipation of the next season of Breaking Bad, without a doubt the best drama ever!", "AT THE TIME OF WRITING THIS REVIEW, I DID NOT KNOW THE SERIES HAD BEEN CANCELLED!I've watched both seasons.  This show needs to do some radical pruning in order to to make it the excellent show which glimmers through the convoluted mess of a plot which tries to drag it under week after week. It is fine that Charlie returns to being a cop after being awarded tons of money for being wrongfully imprisoned for a murder he did not commit.  To have him continually trying to solve how this happened to him is the weakest part of the show and may well sink it.  Here is what will make it the show it deserves to be:  SOLVE THE MYSTERY OF WHO FRAMED CHARLIE, GET RID OF THOSE PEOPLE AND MOVE ON.  Charlie, played by always excellent UK actor Damian Lewis, is best when he devotes himself to the present day problems which confront him.  This doesn't mean that Charlie can't still suffer from his unjustly spent 12 years in prison.  He can still do that.  He just has to be finished with this massive conspiracy inside the police department which framed him for murder and sent him away.  There are plenty of present day aspects which can then be given more attention in the series.  Adam Arkin is excellent as his former cellmate Ted Early, who was a top notch white collar criminal.  Charlie has taken him into his home and life.  Every time Early is onscreen it is magic time. Presently he has fallen in love with Charlie's father's fiance.  This is the father Charlie wants nothing to do with because he believed Charlie had committed the murder.  Again, magic time. Dani Reese (Sara Shahi), as his partner is fine but she was wasted this season being taken away by the people who framed Charlie.  Let her resume being his partner and her amusing affair with their chief, Lieutenant Kevin Tidwell (Donal Logue).  Then the writers need to wholly concentrate on fresh present day stories for Charlie and his supporting gang of characters."], "product_4": ["B002TUO2SU", "B004520KTU", "B002KGEORM", "B001EXRQQ8"], "product_1": ["B00JGMK6VG", "B00C7KXUOE", "B007H63DRW", "B007A1DSQ0"], "score_3": [0.03225806451612903, 0.037037037037037035, 0.04, 0.06666666666666667], "product_3": ["B000HZEHL6", "B0012QRPU4", "B002BSC29Q", "B001YDZYE4"]}]