[{"score_1": [0.016666666666666666, 0.07407407407407407, 0.1, 0.125], "score_2": [0.1111111111111111, 0.125, 0.16666666666666666, 0.2], "product_2": ["B002NGO50U", "B000HC48T0", "B001CNR8KO", "B001CNR8HM"], "score_4": [0.25, 0.25, 0.25, 0.25], "score_5": [0.1111111111111111, 0.18181818181818182, 0.2, 0.2], "review_1": ["The NYT is way over-rated. Just a few examples. On their first page, they talked about saving the nation's energy by painting roofs white. Any white paint? No, special white paint from government labs! It turns out any old white paint will do, that a government program is not necesaary, but the NYT did not say so. Irresponsible. In the area of health reporting, Pope wrote a silly article about a Dr. Kesler's book about food. She did not mention that, as head of the FDA, he was engaged in running battles with vitamin and food manufacturers for years. Many of these battles he lost in the courts, which is now why we can use aspirin for heart treatment, which is just as good as the expensive biotech drugs the FDA was touting. Uncritical and irresponsible reporting. A dereliction of the journalist's duty.And what about the economists like Krugman who don't have a clue about how to save the nation's economy. Yet they pontificate in those pages.If you are a times reader, i encourage you to find better sources.Later...To continue this rant, I posted a comment on the NYT website in response to an article. My tone was reserved and systematic. The subject was the blocking of medical innovation by the medical bureaucracy and government. (FDA) GUESS WHAT? tHE COMMENT WAS ERASED. They evidently censor comments they don't agree with, or that may offend their advertisers. Is this the kind of society you want? You may not agree with me, but do you want to shut up those you  disagree with? Hint: You could be next.So my objections to the NYT are ethical and moral. Unfortunately, they have become government hacks rather than responsible journalists.", "this was hands down the worse book i have ever read and trst me that says alot", "I  grew up considering Jules Verne and his contamparies as people with a scientific vision. But having read his work, including this one, I feel betrayed. These are racist people, believing in white man's superiority, which looks like a recurrent theme with bit of pseudoscience thrown in. Do not waste time.", "This was a free download from Kindle, but it did NOT state that it was only a teaser for a forthcoming book.  Why do this when we can download a sample of any book and get almost as much content?  I thought that this was really deceptive, and consequently will not buy the next book.  If you have to read it to be happy,  ***SPOILER***Kaylee is a banshee!  Now you don't have to read the next book to find out.  It isn't worth it."], "product_5": ["B001O2SCKI", "B001O2SCKI", "B0028TXSIW", "B0030ZRWW6"], "review_3": ["Will give you some protection, but there are more exciting alternatives out there.You may want to look around.", "Cloning Jesus Christ seems like a good place to start a story.  However, the book bogged down in several parts and, frankly, left a lot of unanswered questions.  The greatest disappointment was the fate of the asteroid.  It would have made a much more interesting story had it actually hit.  But there were also so many other subplots and characters, that the story just sort of rambled and lost its way.  I can't say I hated the book, but it's not the greatest thing I've ever read, either.  I give it a \"meh\".", "I enjoyed the story and David's parallel story lines were easy to follow.  However, it was clear that he has little &#34;real&#34; experience in shipboard life or with military structure and command personalities.  All of his characters are exagerated stereotypes and the interpersonal exchanges would have resulted in few of these protagonists ever reaching command because of the obvious psycholoogical abberations present.One sure indicator of his unfamiliarity with naval (spaceship or surfaceship) life is his lubberly use of &#34;the&#34; before ship names.  We who have spent many years and many deck watches know that a manned ship is truly a living entity, christened at its birth (launching), and possessing the nature and personality of its officers and crew.  Use of &#34;the&#34; before its given name is akin to referring to this book's author as &#34;the David Derrico.&#34;Also, as Isaac Azimov pointed out repeatedly, good science fiction must be good science.  I was appalled when the good Admiral referred to &#34;a new element&#34; as part of the alien hull.  Any &#34;new element&#34; in this universe would necessarily be very unstable with a half life measured in nano-seconds so can't be fairly used withhout first laying the appropriate background work.  Without that, this becomes only fantasy and not credible science fiction.", "This was a one-time cursory look.  If one is interested only in what is going onin Washington and what is dished to the regular press, this is good to read."], "review_2": ["Keeper of the keys I give 2.5 stars. I nice quick read.After winning the lottery and a new man has come into her life and life is good. Kai finds out she has AIDS at 32 years old with a daughter 7 years old.", "I am not from Washington, but enjoy good media.  Unfortuntely, the Washington Post is mostly about politics, or the Redskins and other local stories pertient only to Washington DC.  Whereas the NY Times is more international, and the Wall Street Journal is very business oriented but at least national, the Wash. Post is very narrow.  I unsubscribed.", "This is not up the usual quality of Ally Blue. It got so predictable, I put it down before finishing it.", "I ordered this for the Kindle when it was free, so I'm not going to complain.  I felt the book was pretty predictible but not a bad read.  I don't understand why he included the trolls and things, but it wasn't too distracting.If you are looking for a quick \"mystery\" to read, this might do."], "review_5": ["A very nice newspaper and very good writing. This is so fun! So good! I cannot buy it but I know that this will be a very great paper.", "This is it, the magazine of stories that you have enjoyed for years now finally available for your KIndle.Get it now if you enjoy this magazine.", "Ooh wee! Triplet alpha hotties that are shifters and one female tv reporter add up to a helluva romp. Ain, brodey, & cail are all super hot. The two 'younger' triplets brodey & cain are so sweet and endearing, I wanna take them home!", "I'm now half way through the 1st Book of the \"Delver Magic\" series and LOVING it! I will return and add more when I finish it; but so far - so good.Jeff: Do NOT listen to the petty critics on here. You have the talent, and despite minor text typos and grammatical errors - the work is good.I especially enjoy the fact that like Lewis and Tolkein, you have the ability to tell a compelling story while keeping it clean. To many talented Authors nowadays who I would otherwise enjoy reading, have a nasty habit of peeing in their own talent pool, which makes it a \"No Swimming\" zone for me. Not having finished the book, I suppose I ought not to speak too soon.I look forward to returning to this review when I complete the book!"], "review_4": ["i like most of the articles but whish it would open with content listno button to cancel subscription", "Taking friendship to a whole new level-Lacey Vaughn is tired of being dumped on by men. It-s clear she needs help in the ways of seduction. Over cappuccinos, Lacey shares her worries with pal Nick Stone. Being the good friend that he is, Nick offers to give Lacey a few pointers in the ways of sexual pleasure. From his first touch, Lacey forgets all about lessons. Now all she wants is more of his luscious body and skillful touches.Nick-s craved Lacey for months. He-s done watching her waste herself on losers. It-s time she saw him as more than the dreaded good friend. He-ll do nearly anything to have the little spitfire all for himself. But in order to get Lacey past her insecurities, Nick will have to put it all on the line-including his heart-and pray he doesn-t lose her forever.THOUGHTSIt wasn't a bad read for me and I still enjoyed it. However, I  love Blade's story more within the series 'Tasting Candy' that man was so sexy within that book. But, this story held its own.  Its good to read best friend  to lovers story.. I also enjoy their family with all 3 books. I would recommend the series, but I'm stuck on Blade so I might not be the best person to recommend right now.Steamy & sweet, that would best sum up this book.", "Personally I found this to be a very good read...I found myself laughing out loud several times...Not quite the typical shifter read, but very enjoyable ...", "Given the previous reviews, I didn't expect much from this book but ended up being pleasantly surprised by the ending.  The technological aspects are glossed over, the string of events is manufactured to suit the author, and blame for the collapse of civilization is laid squarely at the feet of religon.  This isn't a serious attempt to explain and justify a point of view.  It is a pleasant diversion for and evening or two, nothing more."], "product_4": ["B000QFOD8E", "B0016IXMDW", "B002GEDE2E", "B002T45V90"], "product_1": ["B000GFK7L6", "B00309SCUS", "B000JMLBHU", "B002F3PPVE"], "score_3": [0.10204081632653061, 0.2, 0.2222222222222222, 0.25], "product_3": ["B001NPDA44", "B002YQ2JEI", "B001V9K7WU", "B000HC48T0"]}]