[{"score_1": [0.05, 0.05128205128205128, 0.07142857142857142, 0.07692307692307693], "score_2": [0.1, 0.1111111111111111, 0.14285714285714285, 0.14285714285714285], "product_2": ["B0030B2N10", "B00FJXKE5E", "B0002UQATS", "B00144I5KS"], "score_4": [0.058823529411764705, 0.1, 0.1, 0.1111111111111111], "score_5": [0.1111111111111111, 0.1111111111111111, 0.14285714285714285, 0.16666666666666666], "review_1": ["I could not rate this product as it opened up in shipment and the bottle was completly empty.  I was sure glad it was wrapped in another plastic bag, which held about 1/2 of the liquid.  The rest was aborbed by the over sized back it was ship in.", "Filter is one of the best, price is one of the worst in the market.When you can get one of these for 5.38 at KMart why would you even want to buy it from amazon?I do not.", "Absorbs great, but does not leave car spot free. I will use this until i find something a lot better.12-24-2013: It's been about two and a half months now, and this product absorbs worse than a Kleenex. I wipe, wring it out, wipe, repeat, and it looks as if it just rained on my car. I've always used leather chamois in the past with no issues, and now I am suffering from buyer's remorse.", "I ordered and paid for next day air because I needed it this weekend.  It arrived, but it wasn't what I ordered.  I ordered a pair of jack stands.  I received an engine hoist leveler.I understand mistakes happen.. but it was the way the return has been handled that I have issues with.  UPS dropped it off, but I have to take it to the post office to send it back?  And I wasn't told if they'll wait to ship the right order until they receive this back via the slowest mail service.. so I have no idea when the replacement order will arrive.  A week?  Two weeks?This wasn't my mistake or even a defective product.. this was human error on their part.  They should have told me they'd IMMEDIATELY ship the replacements next day like I ordered.  So far I'm left hanging.  Should I go out locally and get what I need and then end up with an extra set?  Should I hold off a day because they're coming next day?  I don't know.. and that's the point and that's why I gave them one star."], "product_5": ["B0002JM8PY", "B000C4087Y", "B000DZBP60", "B005EJGSQ2"], "review_3": ["Has MAACO repaint my 1998 Dodge Intrepid as the factory paint finally gave out.  POORIST quality of paint from MAACO. Tried to use this to get luster back, but failed.  Will NEVER go to MAACO again!!!!!!!!", "I actually thought it was to be \"the ultimate\" and even though it is actually ok is not such an ultimate thing.", "I received this polish but I had not had a chance of using it.  I will get back with my review once I have used it and see how it works.", "Good product with easy plug in and use system.... had mine installed an working in less than 10 min.... the title is not clear though.... the low beams are H.I.D. BUT the high beams are regular halogen..... for less price you can get the exact results else where"], "review_2": ["This is a handy product i must say. An ALL-IN-ONE! But the fact still remains that the power inverter does not last to one's satisfaction. Infact, the power inverter cannot fill air into a new tyre. That is only it's disadvantage; Power inverter does not last!", "I love techno gadgets, but this is a $100.00 dollar toy, and nothing more. The features are very limited on the device, and most of them I already have on my car since it only a couple years old. This was fun to play with for one day, but then I was over it. If you're really a gearhead, you might get a little more entertainment from it, but I doubt it. Save your money.", "this product is good but not outstanding as Barry Meguiar says not last as long as he says I've used both summer and winter and in 6 weeks lost many of its properties. in the real world, not in the world of Barry Meguiar you have to wax the car every month if you want to protect your car. is not true that regardless of price waxes last for many months.since you apply the wax starts to degrade the environment, sun. uv, rain, dust. when you wash you remove the wax inevitably part because dust and pollution and the polluters and stick to the wax and when you remove these contaminants also remove the wax.", "I guess that I'm \"Old School\" but this product is not for me.First:  As others have stated, spatter is a problem - no matter how careful you are.Second:  There's not a lot of surface contact area, so it takes a long time to get anywhere.Third:  Even if you are careful in squezing out the ball after you wash it, it takes a very long time (days) to dry out.My suggestion is to take some fluffy old athletic socks and do the job by hand.  That's a lot of work, but it seems to go faster than with the ball - it's also easier to judge where you have been.Disclaimer - My experience is limited and I have only tried this product on an old car that has set unwaxed for nearly 30 years.  If your car is newer and the paint has been kept up, you may have better luck with the ball.  I plan to try it on a Honda CR-V with nice paint and will provide an update following that.Hopefully the next experience will be magical..."], "review_5": ["It was quick getting here, but I already painted the item and have not used it to see if it works well.", "this is an oil filter for cars.  it filters things. this is a filter. this is an oil filter for cars.  it filters things. this is a filter.", "I have not used this spray gun yet but, after inspecting it closely, it seems to be a well constructed sprayer especially for a novice such as myself whose painting experience has been limited to brush, roller and spray can. It appears that it would be ideal for fences, outdoor furniture, etc. After using this item, I will come back to edit/update this review. I would like to add that this order was promptly shipped and very well packaged for a safe transport to me. At this point, I would recommend this item but, with the notation that I will review it further after using it.", "The amazonBasics 12-volt heated seat cushion makes cold mornings bearable.It installs easily and stays secure with hooks on the bottom. The color and the fabric are good.It is very easy to use just plug it in and turn it on, it has several temperature settings and it makes the morning commute very comfortable. Just make sure to unplug it when you arrive. I love it and think it would make a great gift."], "review_4": ["I ordered this late at night & thought I was buying an all aluminum floor jack because I have a bad back.  My steel floor jack weighs a ton.  Well when it arrived,  UPS needed two people to carry it to my front door.  Yikes!  Amazon made it right, so in this case, Amazon gets 5 stars as they understood and sent UPS out to return it.After numerous replies to my poor review, I have decided to change it as my review was not on the jack operation itself which in retrospect was not fair.  I based my review simply on the weight of the jack that was delivered.A good floor jack is worth its weight in gold.  I've read many of the other reviews from very happy users.  In the case of this floor jack, I never even lifted it.  Two UPS delivery people brought it to my porch as this one weighed over 70 lbs (UPS or the shipper had affixed a heavy package warning sticker).  I purposefully rated the jack one star to bring to people's attention that the jack is heavy and it was not clear.  Some people were also  surprised that the jack weighs as much as it does when I read their reviews.The shipping weight of the jack is only 62 lbs according to the specs for this jack.  I have no idea why UPS put a heavy item (required for items over 70 pounds) warning label on the box.  This happened quite a while ago & I simply remember the two UPS guys it took to carry it along with the UPS warning sticker which stated: heavy package over 70 pounds.  UPS also sent out two people when it was returned.I never opened the box or used the jack.  It is very possible the wrong jack was delivered to me.  As for the operation of this jack I will defer to the many others who have used it.  I encourage everyone to read all the reviews.  The bottom line is if I had to do it all over again & had a need for a good 3 ton jack, I'd probably purchase an all aluminum.  I noticed one on Amazon that weights 56 lbs has a shipping weight of 59 lbs.Arcan ALJ3T Aluminum Floor JackThe more I think about this incident, the more I wonder if I was shipped the wrong item.", "Have not used it yet, but wish it did not come with the clay bars...they just look like more work will be required.", "Two reasons for 4 stars instead of 5.  One, I've not yet used the product, so I have no first hand experience with its performance.  That said, I hope I never have to use it. :-)  Two, I also subtracted 1 star because of the clear crappy plastic/vinyl storage case.  The pump/device itself appears to be of very high quality, and it really deserves a much nicer case made of a more durable quality material.  The plastic/vinyl case looks and feels very cheap.", "right after I put it in my car.  Later my mechanic decided it is the old water pump which broke and hit the piston valves??? Not this Sea Form. But still my mind is not clear. Why minutes after my car was gone? Very very expensive experience. Sea Form is safe? I have no proof it is bad so I give 4 stars. Why one star minus? Expensive..."], "product_4": ["B003UM7B98", "B0002U2V1Y", "B001DZFZPG", "B0002JN2EU"], "product_1": ["B0051PJWQW", "B000E8T810", "B00CNA2BV6", "B0002H335A"], "score_3": [0.037037037037037035, 0.08108108108108109, 0.1111111111111111, 0.1111111111111111], "product_3": ["B003POLA84", "B000RXNLK6", "B000BO8Z9I", "B001LC73GU"]}]