[{"score_1": [0.014925373134328358, 0.019650655021834062, 0.02631578947368421, 0.03571428571428571], "score_2": [0.030303030303030304, 0.0392156862745098, 0.047619047619047616, 0.058823529411764705], "product_2": ["0767023765", "0767802470", "0310263662", "0767809262"], "score_4": [0.058823529411764705, 0.0625, 0.1, 0.125], "score_5": [0.019230769230769232, 0.037037037037037035, 0.06666666666666667, 0.08333333333333333], "review_1": ["I just watched the professional a couple of months ago. And i didn't see any of the love story. If you've seen this movie and you seen Matilda and leon as lovers then i bet your a huge fan of John Mark Kar, and child pornagraphy. I mean come on shes twelve and he's what pushing 40. But i do have to admit Matildas a pretty creepy kid. But whenever she comes on to him it gets really awkward and he seems afraid of her. And all the flaws in this is kind of sad. Nobody notices how crazy the cop is. And leon kills a dozen not just cops but a swat team with two hand guns oh while hanging upside down. Can you imagine how many times he dropped the guns during takes. What is he superman always dissapearing and reappearing during his hits. And why weren't there any reporters i mean come on. Cops killed, shootouts in the middle of new york, a aparment building being blownup. I know new yorks a pretty bad place but not one freakin reporter.  Then theres matilda shooting out the window and nobody calls the cops. And what up the cops killing matildas whole family. THe force didn't even do a real invastigation. They should of suspended there badges untill they got to the bottom of it. Because I'm so sure a four yr old is such a threat.", "Nothing but every kind of gross use of body fluids & disgusting behavior & sickening comments throughout entire movie. Quite literally peeing on each other, puking, flicking gross nose contents at each other with constant sickening comments about toe jam, poop & everything else gross & filthy imaginable filling every moment of the first entire hour. It is bad enough to make the audience retch. I am not exaggerating in the least. This disgusting behavior & gross dialogue is nonstop for at least 1.5 hour of the first side of the movie with only 10 minutes of shaking, rattling & spraying water onto this sty. Then you discover there is nearly another 1.5 hour of movie remaining on the other side.I have never in my entire life heard or saw such a disgusting display. Even Ren & Stimpy aren't this bad. Close; but this movie is worse. It makes you hope for an early sinking to stop the audiences suffering. I've managed outside plant cable crews; some of the raunchiest you've ever met... but they couldn't hold a candle to the gross, disgusting behavior & dialogue on this movie which is nonstop from the very onset.After a brief moment of deep diving, they returned to their previous disgusting, putrid behavior. Including naked short arm inspections with crawling crabs (rear view only), drinking soured milk, eating hairy meat, flinging gross body debris, etc. Puking, sharing bunks & complaining about the nasty details of body sweat, feet & oils from their bunkmate (& I'm not close to using the dialogue on this film which is nonstop nauseating to purposely make you ill). Things so sickening, nonstop throughout the entire movie; too awful to list on here.Then we have a redheaded actor with constant filthy, idiotic comments, obviously British descent who clearly belongs on Monty Python. Can't act & talks like a moronic swishy feminine throughout (this is a behavior description, not a sex preference issue); in any language you choose to watch. He clearly looks & sounds like a joke on a German U-boat. A Harpo Marx (Lucille Ball) type. Constantly talking about passing gas in public. Animal House was better behaved than this tripe.This is beyond wanting your money back. The audience should sue for pain & suffering the indignities. This movie made every effort to make the audience retch. I can't think of bad enough things to say about it. It is quite literally the worst movie ever made.At 2/3rds through the movie, you are convinced the movie could only improve by sinking the sub & ending the movie.The music is even worse like some Lone Ranger episode or spaghetti western. Cheap & corny.  Only 10 minutes of the first 1.5 hours on side one give you a break from the filthy behavior & dialogue with shaking & rattling at the end of side one. Then to your horror, you discover there is nearly another 1.5 hours on side 2.You might be better off to skip side one entirely. I can't believe any studio actually approved money for this script. Side one is a complete disgusting waste with no redeemable footages.Side 2 starts off with crew insanity & even more violent shaking for 10 minutes; wasting a torpedo on a burning wreck; stranding survivors; guilt & depression; back to filthy behavior again; a ridiculous feast & pompous over actors at port; dragging slowly through every scene uneventfully until 45 minutes into side 2; Blood & Sub damage until they gloriously hit the bottom. But even then, we are not spared further misery as it sits on the bottom where it should have imploded. We are forced to endure 30 minutes of watching them flounder aimlessly in depression waiting to die on the bottom until the last 15 minutes of the movie when it finally rises to the surface. Then we are back to loud parties & a deteriorating officer; arriving at base to pompous band ceremonies & a surprise air assault.At long last, most of the filthy crew is battered, raving & wiped out on the docks as the sub sinks from the Bombings. It is the only highlight after being subjected to such a horrible 3 hours.I cannot imagine how anyone could enjoy this movie. Truly, the only way to watch it would be to skip side one entirely, read the overview online for character reference then watch side 2 with the fast forward & chapter skip buttons. Out of 3 hours, there are only 30 minutes of watchable footage which is all on side 2. But even that is a crawling waste of time. The director & writer should be banned for life.Do Not let children or teenagers watch this movie. Also not recommended for those easily offended by smut.If you still insist... Rent. Don't buy. But if you can't tolerate Ren & Stimpy, you will not be able to tolerate this movie.", "I thought this the MOST BORING  movie of all times!  Gag me!  Two great stars, dull movie.", "This movie was terrible. Right from the opening credits in which it looks like it is snowing but which is revealed to be flakes of skin being scraped off, I knew this was going to be a dud. That was just gross. I almost walked out of the theater right there! But I stayed and the rest of the movie confirmed what to me was clear in those first few minutes - this movie sucked! Ugh! For the record, my problem was not with the premise which I found fascinating but with the whole execution which I found strained all believablility..."], "product_5": ["0767802470", "0767802470", "0310263662", "0767809254"], "review_3": ["Entertaining and suspenseful on first viewing, a closer reading reveals the film's rather disturbing subtext, which effectively explains away what are, after all, crimes against people, as the understandable prerogatives of a Master Race:  i.e. too high above us to notice our \"rights\" and stuff.  Sig Heil! Mr. Spielberg?", "Well, these exercises were helpful. I have found others that I like and are more portable if that means anything.", "\"Stand By Me,\" sometimes confused with \"Lean On Me,\" is both a coming of age and nostalgia story. The main characters are 12-year-old boys, but it is rated R so many parents might not want to watch it with their 12-year-old kids.As a coming of age story, it's pretty rough - the school of hard knocks - and I don't say this because of the dead body. All of the adults are seriously dysfunctional, all of the kids are either abused or neglected. Among the four boys, only Gordie and Chris have a solid friendship. Gordie, a thoughtful and understandably insecure boy, is believable, but Chris is too knowing, wise, and supportive for a kid, so at times it seems he is Gordie's adult mentor more than his kid friend. Any kid would benefit from a friend like Chris (indeed, any adult would benefit from a friend like Chris!). I point this out because when I watch a coming of age story, I expect to see kids coming of age rather than acting like wise adults facing tough challenges. I can cheer for kids who act like wise, brave, and strong adults, but I can't quite believe it. Chris and Gordie's superstar brother (John Cusack) seemed a bit too supportive of Gordie's writing to be believable; it's more likely they would have teased him about it. Sure, it made me feel all warm and fuzzy to see that kind of support, but it was overdone and got sappy.It's a movie, so I know that a lot has to happen to keep things interesting. But as a story, it seems a little much. In the space of a couple of days, the boys run into the local gang of violent hoodlums, an attack dog, a train, and a dead body. If such exciting things happened to the average kid, there'd be a lot of great stories to tell. I guess dysfunctional parents and bad childhoods have their benefits, while good, safe childhoods are boring by comparison. :-) Conveniently enough for the story, the feud between the boys and the violent gang is left unresolved. When the leader of the gang told the boys that he would \"get them,\" I had no doubt that he would. But somehow he didn't, and I have no idea why.The nostalgia in the film is a mixed bag. The 50's look and feel seem genuine enough, but as I said, all of the adult characters are dysfunctional or abusive, at a time when the victims of such misfortunes were pretty much left to their own devices, which doesn't exactly make me feel nostalgic for the times. I can always feel nostalgic for a true and wise friend like Chris, or a supportive sibling like Gordie's older brother. Those are the kind of people anyone would want to stand by them, in good times or bad.", "Sorry to all those devotees out there that wouldn't wantminute to be cut and wouldn't want this one to ever end--but this movie was in bad need of editing. As a movieand a story, this one is a B+ script in search of someminor touch-up. Visionary? Maybe in 1982. Today itfeels in need of repair. That seems strange for a periodpiece, I know, but if the director were to make this movietoday, it would probably be better. I'm not talking aboutexplosions or special effects. Just set design and generalcamera work."], "review_2": ["The Crossing is really just not a good movie, but I still find it interesting because some of the movie was filmed quite close to where I live; the opening scene when Washington's bedraggled army is marching through a wooded area, and the camp scenes near the beginning of the movie.To say that the acting in this movie was good would be a slight over-statement, and the dialogue is not what one would call stellar.  I would not be so certain about the accuracy of the movie either--few movies are.  The general course of events may be faithfully adhered to, but no movie based on a historical event that I can think of has not taken liberty with the truth for one reason or another.", "They got what they deserved, remember the Germans were fighting so they could kill all the Jews and take over the world, why would we want them to live?  WE DONT.  Maybe if i was German or they movie was about Americans i could realte, but im sorry they deserved worse then what they got.  Its too long, it doesnt have enough action, no drama, the score is bad, the acting is boderline soap opera, and the dialogue is perverted.  U571 is better but not much, if your looking for a better Wolfgang film check out Troy (a great great great film) its a million times better, if you want a better war movie check out Saving Private Ryan of course, its the best war movie ever made.  4 out of a 10 for this.", "There is one incredible scene in this movie - a scene that perhaps makes the entire movie worth the price.  It is the scene in which Jesus is finishing building a table and bouncing on it while have a friendly conversation with his mother.  In that scene one can see a Jesus of love, humanity, and compassion not evident in the gross misinterpretations of the Bible that have come to commandeer his name.  It is a glimpse of what the real Jesus might have been like - learning the wisdom of the ancients as he emerged from childhood through his lost years until returning to the Bible at thirty.The rest of the movie is pretty awful.  It had no character development - the king of a religious sect getting beaten senseless does not a good movie make.  Anyone raised Christian will see nothing but the same old tired interpretations, essentially reinforcing the status quo without a thought of its actual validity.", "The Natural is one of the best examples of missed opportunities you are ever likely to see. It pits a baseball hero against all odds and nearly keeps you in suspense up until the ridiculous final third of the film. The  whole plot falls apart when Hobbs becomes Superman, and begins skinning  baseballs with his fantasyland bat. The climax, which involves a Grand Slam  into the floodlights, is really silly, and would be better served in a  Three Stooges comedy. A terrific buildup to a goofy climax. A real  disappointment."], "review_5": ["What's all this empathy for the poor germans? Let's not forget, these guys were nazis working for hitler. I was totally stoked that they got blasted at the end, like it should have been. That being said - love this film - dubbed version is unacceptable.", "The wacky adventures of a german submarine crew.", "THE 'FEEL GOOD' MOVIE OF THE YEAR....SEE IT WIT YO KEEEEEEYUDS!  Oye, I hate CONTRIVED HYSTERIA!", "i like this movie alot except for julia roberts. i don't understand why they chose her to star in a movie called &quot;pretty woman&quot;. they should have called it &quot;ugly horseface&quot;. anyway, steel magnolia's made me laugh alot and then it's sad sometimes - kinda like drinking everyday! shirley mccaline was really good too but i don't think the role was much of a stretch. olympia dukakis scares me. sally field looks mean. and that girl from splash is always a hoot. but let's not forget dolly. remember the dollymo!"], "review_4": ["I agree with another reviewer, that the shorterversion, is better. That's why I gave it 4 stars.Alot of the footage in this uncut version, wasa bit boring. I found it to be a bit strange that,whenever Matilda said she loved Leon, and that shewanted to have sex with him, NOT ONCE did he say,you're only 12 years old! If Leon survived at theend, they probably would have gotten married andhad kids! There was only a 45 year age difference!", "Two versions, one with less gore.Heartfelt piece about the lord'slast 12 hours here on earth. Ifyou can stand subtitles or under-stand latin, it helps. Not quiteas good as 'Greatest Story EverTold' but close enough. Like theTen Commandments, very well made.Really three-and-a-half stars outof four. Good job by Mel, who'sviews I don't always agree with.", "After hearing how so many folks in the evangelical Christian community have approved of this film, I went in with a great hope that I would experience some sort of epiphany; a renewal of the mind, in which I'd see things clearer about the hope of Christ in my otherwise tired life.  So I took half a day off, the only way I can see an honest-to-goodness movie any more in this regimented life, and took my seat.  It surely smacked of authenticity, as we see in the most compelling of ways how the King of the Jews was smacked around by the kind of sadistic folks that hold power in a dreary Roman backwater.  In the more comical words of Will Smith as Jim West (\"Wild, Wild West\"), \"now THAT was a whuppin'\".But the initial question posed by satan, which ran along the lines of \"how can one man's death remove the sins of all mankind?\", remained without much of an improvement on the answer.  I suppose I should have brought a little more faith with me to the theater.  If you're into Scripture and like the infallibility of the Bible, well, this is a good one.  The script is faithful to the Gospels, through and through.  I was thinking that what we have here is the vision of canonical Christianity for 2004, just as we saw for 1959 with \"Ben Hur\".  But while a movie like this is fine raw material for the inspired, who have a better map of just where the pieces fit in the implied majesty of the makers of initial premise, it is not as directed to the wandering ones who are after a compelling reason for holding such premises in the first place.  The choir needs the sermon, yes, but even more so the backsliders and the non-contrite.I don't know why I'm so down on such a fine and time-tested story.  It could well be the cynicism of this day, in which faith is not so readily accepted at face value.  I suspect that were I in a true state of grace, I'd be putting down the five stars.  This must not be the year for that kind of stuff.I did sit in one sitting through the entire 126 minutes, for the pugilism of Roman and Jew alike, with every variety of contemporary weapon formed in those days, was sensational in itself.  The character best portrayed is that of Pilate, who realizes he has a real problem on his hands.  There are so many flashbacks to the high points of Christ's ministry, such as the Sermon on the Mount, the stoning of the adultress, the Last Supper, etc., only what we end up with is a crucified King.  Are we simply being told to turn our other cheeks, the way \"Yeshua\" turns just about every part of his body to the scourgings?  If I was supposed to have a personal experience of Jesus Christ as my Personal Savior through this film, well, I'll stick with the ones I had as a much younger man.  The emphasis of the progressive ministry is, after all, a call for direct dialogue and personal experience, rather than being shown in imagery an interpretation that purports to be authentic.  I suppose I'm seeing in a mirror what might one day be seen clearly, to borrow from Paul.Were we not so entirely inculcated in Western culture with the Passion narrative, I'm not thinking this would be such a compelling drama.  Some upstart of the countryside has a cult following, he's picked up as a security threat to the government, and is beaten to a pulp, prior to his execution.  It would be better with an international terrorist conspiracy, perhaps, one that fights with automatic weapons and grenade launchers.  It seems strange, that the the leader of the good guys should get such treatment.To the film's credit in advocating the love of those that torment you, I found that I was better able to tolerate the horrendous city traffic getting home, when this was done.  Still, during that same interval, I turned on the CD in the truck of Webber & Rice's \"Jesus Christ Superstar\" and felt a good bit more in the 60's version of the way it was, on that day, when he took my sins away.The crucifixion, indeed, is a riddle.  \"To conquer death you only have to die\" (J.C.S., \"Poor Jerusalem\")?  Is that something like a Zen koan?", "THIS MOVIE WAS COOL THE SNAKE LOOKS SO COOL. REALLY GOOD CREATURE MOVIE.EVEN HAS HOT ACTORS LIKE KARI WUHRE AND J-LO. GREAT BUT NO DEEP BLUE SEA."], "product_4": ["0767802519", "0310263662", "0310263662", "0767802497"], "product_1": ["0767802519", "0767802470", "0767802802", "0767805712"], "score_3": [0.043478260869565216, 0.05555555555555555, 0.05555555555555555, 0.058823529411764705], "product_3": ["076780192X", "0510539610", "0767809246", "0767802470"]}]