[{"score_1": [0.05263157894736842, 0.06451612903225806, 0.06666666666666667, 0.07142857142857142], "score_2": [0.09090909090909091, 0.1111111111111111, 0.125, 0.125], "product_2": ["000649885X", "0002247399", "0002555166", "0006511252"], "score_4": [0.030303030303030304, 0.03125, 0.041666666666666664, 0.05], "score_5": [0.029411764705882353, 0.030303030303030304, 0.03225806451612903, 0.03333333333333333], "review_1": ["I didn't realize this was the children's book in the Dr. Seuss series. I thought it was for adults. My mistake and I had to laugh at myself when I excitedly opened it up. I couldn't teach my dog any new tricks! :)", "This book was one of the most uninteresting books that I have ever read.  I am not a fantasy book reader but I saw the reviews so I thought I would give this book a try.  I really thought that there were way too many characters in this book.I will admit that it was really helpful that the author did put together a listing of who is who.  Maybe it is because I am not an avid fantasy reader but I just found myself extremely bored reading this book.  The 5 main characters did not interest me along with the storyline.  After reading this book I will not read another fantasy book for a long time.", "I thought this story was very \"dry\" and hard to follow. I lost interest and never finished.", "I didn't like it, honestly.  People consider the Alex Cross trilogy thrillers, (If you call them thrillers at all...I just call them straight out slow paced and boring) fast paced.  They're not fast paced! There's hardly any good action scenes and gun battles, no Shoot 'em up lethal weapon stuff, which was what I expected yet didn't get it.  The only reason that people consider this book fast paced is because of the short chapters.  Yeah, I admit it, there are some very short chapters.  Lots.  But that doesn't mean that it's fast paced.  It's fast paced compared to Stephen King, but I think it's a slow paced book.  I want action.  I want adventure.  The killer kills a lot of people.  I didn't need disgusting and awful as well as dull details that James Patterson gives out.  And also, Patterson had a good chance to make this a good cop thriller.  He failed miserably.  I don't think I've ever read a good detective novel...all I want is a book with a bunch of action scenes.  If you think this is fast paced, good for you.  But if you desire more action, more events, more UNPREDICTABLENESS, then go to a different book.  I don't know which one, since I've never read one like that...anyways, don't get this book."], "product_5": ["0002247399", "0002247399", "0002247399", "0002247399"], "review_3": ["As an account of the disastrous Afghan campaign of the early Victorian era, this novel succeeds beyond expectations. In terms of character and plot development, one sometimes gets the impression that any movie of the Indiana Jones series is more realistic. Only for history buffs (like myself).", "If you read the others then I recommend this one. Dude this is the next book in the series. Its fun to read about the Starks and the Lanisters. And even mediocre Martin is better that most books out there. So yes I recommend this but it might take a while to get through it.", "THE MAURITIUS COMMAND, the fourth novel in the series by Richard Patrick Russ (1914-2000) writing under the nom de plume of \"Patrick O'Brian,\" is a distinct improvement over one of its predecessors, POST CAPTAIN.  Russ/O'Brian seems to have abandoned his annoying  experiments in writing techniques and has settled down to, more or less, a simple, straight-forward narrative style, which is imminently more readable.As in earlier volumes, this book does not continue precisely where its predecessor left off. However, in this case the missing events are easily understood and reconstructed in the reader's consciousness.  We do find that Jack Aubrey's marriage to Sophie is not precisely fulfilling for him; not surprisingly, we find that Aubrey's first love remains the sea and that he is not exactly the model of a perfect spouse.  Of course, if one reads the author's real-life biography, Russ/O'Brian was far from a perfect husband, and one wonders whether he has somewhat patterned Aubrey after himself, but let us not read too much into that.Soon, Aubrey is called to sea again, and the maritime action resumes and continues throughout the remainder of the book.  Unlike POST CAPTAIN, this volume does not ramble for pages and pages about Aubrey's floundering on-shore life, thank goodness.If one has a creative imagination, he could actually begin with THE MAURITIUS COMMAND, but the reader will certainly have a more complete appreciation of the characters if he has begun with the first volume, MASTER AND COMMANDER, and has approached each successive volume in order (POST CAPTAIN, then HMS SURPRISE, and only then THE MAURITIUS COMMAND).  Perhaps we should consider each novel as an additional chapter in one extraordinarily lengthy book.  This is not necessarily a criticism, just a caution to a reader who might be tempted to sample Russ/O'Brian's work by starting in the middle of the series.The author does engage in some character development, and, by this fourth book, the person of Dr. Stephen Maturin has become more complex that we suspected at first.  Not only is he an unusually gifted physician, but it seems as though he has shadowy political connections and is as instrumental as a \"secret agent\" as he is as a doctor.  While this certainly provides a most interesting twist to the character of the good doctor, I sense that Russ/O'Brian is learning about his creation at the same time we are.  I do not feel that he prepared us for this sort of complication in Maturin's nature.  While I enjoy the increased complexity in the doctor, I am not at all sure that the author intended this from the beginning but suspect that he may be developing his characters by whim rather than by intent.THE MAURITIUS COMMAND keeps the reader entertained throughout its length, but, after having now read four books in the series, I feel that Russ/O'Brian is a somewhat superficial writer who realizes that he should paint some complexity into his characters to keep them from becoming mere stereotypes but does not quite understand how to do this.  As a writer, he is certainly superior to the authors of what we used to call \"dime novel bodice-rippers,\" but he is far from displaying the skill of a C. S. Forrester or a Herman Melville.I would suggest that the Aubrey-Maturin series of maritime adventure books is decent entertainment but that the novels are not especially memorable.  I also find myself wondering whether the surface action, that is, the plot or superficial story line, may not become repetitious and boring before one reaches the end of the multi-book series.  I'm actually hoping that Russ/O'Brian will mature more fully as an author as he accrues more experience in writing the future volumes.  We shall see how he handles the fifth book, DESOLATION ISLAND, next.", "...but fear, in this day when psychobabble, family values, and the like are taken far too seriously, the &quot;American Dream&quot; as related to Dick and Jane is as well.Most of us &quot;Depression Era through Baby Boom&quot; kids (I'm the latter) can enjoy some memories of the Dick and Jane we knew so well in first grade. But anyone whose memory is keen enough will know that the &quot;Dick and Jane&quot; family were hardly those we'd have wished to imitate. The kids apparently had no friends (though the book shows that, after &quot;my time,&quot; they did acquire a few); were not terribly bright; hardly had a decent conversation (remember story one: &quot;Oh, Look!&quot;?); their prime concern seemed to be &quot;helping mother,&quot; and they might have been an adult's dream (never caused trouble, and so forth) but were not a fellow kid's."], "review_2": ["Since I only read 50 pages, I'm not sure that it is fair for me to review, but I have read some very long books and enjoyed them.  This book is NOWHERE after 50 pages, and it was painful to even get that far.  Each character is described in excruciating detail - not by actions, but simply by words and their own thoughts.  This really helped me to appreciate authors like Terry Brooks and Terry Goodkind who can describe characters as the story grows, so that something is happening as you read.  After all, it is our actions that define us...", "i'm halfway through, and it already deserves a five star review. the 6 year wait was worth it, i just hope he doesn't take another 18 years to finish the series!!EDIT:yeah.. ^^^^^^^^^ that was wrong.  i just finished the book today.  i'm not going to paraphrase the entire book or plot lines that i enjoyed/hated.  this book is, to put it simply, poorly written.the first 3 books left me dying to read more.  the fourth book was generally uninteresting, but i plowed through it twice and upon 2nd reading realized that the 2nd half of the book was actually worth re-reading.  this book, though i've only read it once, makes me wish i never picked up the series in the first place.the writing style has gone downhill, as if GRRMs voice has become a caricature of itself, and all editing has gone out the window.  i was terribly excited to see all the characters i missed in AFFC at first, and anticipated big meet-ups and possibly an explanation of ANY mystical elements thus far.  i was disappointed yet again.  to the people who are saying, \"well it's just the 2nd half of AFFC, it's a good 'transition piece.'\" does that mean that the 2nd half of a mediocre book should be just as (if not more) mediocre?  i guess in a strange way that does stand to reason, but GRRM [was] so good at bashing expectations!  now it seems like he's a one trick pony, using tiny cliffhangers at the end of chapters to keep us interested.  characters repeating themselves incessantly. even multiple characters having the same memories of things, verbatim..it would be one thing if the next book will come out next year, but as we've heard, GRRM isn't even starting the next book for another year. so it will be at LEAST 2-3 years before the next book comes out, and quite possibly a decade or more before the series is concluded.  i needed a little more out of this book to keep me interested.  sorry GRRM, but i don't know if i can", "Over all an interesting but fatally flawed book.The writing is, in parts, truly appaling. Some of the sweeping statements made throughout the book, that certain individuals or their wives were obviously stalinist agents working for the undermining of america or western society, are unsupported or utter conjecture.  Indeed parts of the book read like a rant against leftist intellectuals and writers, leveling accusations and condemnations at them solely on the basis that they were leftist, therefore obviously they were the tools of stalin.  Trying to link the cambridge spies to Munzenberg on the flimsiest of evidence seems like stretching reality to create the legend of munzenberg rather than recounting the history of the man.Reading some of the other reviews it seems that this book appeals to those people that seemly already share a deep distrust and loathing of \"dangerous left-wing academics\" that seem to be trying to undermine american values.  This book will no doubt provide barbecue talking points for white collar red-necks so they can heap scorn upon and ignore any academic or spokesperson that questions the status-quo.  They will be able to discount any person that does not agree with their own \"elightened\" position on the grounds that they/their university/institute/etc was established or funded by the soviets to produce nothing but anti-american propaganda and can therefore be ignored.So, an interesting book, putting forward very interesting ideas, but sadly poorly written, in parts poorly researched and comes across as a damnatio of C20th intellectuals.  Overall this book would appeal to the america, god and guns brigade.", "The history and the frame of this novel was composed and written with clever genius.  The explanation of the British presence in Afghanistan was informative too, so I wanted to like this book.  I know it's satire, understand the protagonist is an opportunist , know it was written before feminism was as advanced as it is today (etc.) and the book draws you in and is a riveting adventure story with lots of turns and surprises--  but Flashman's superiority complex with women, though totally appropriate to advance the author's drawing of his personality--  isn't at all amusing to a woman."], "review_5": ["Great book in the series. It was everything I expected and more. Love this author. His fantasy world is his own and the characters in it are flawed, just like people in the real life, which of course makes it a great read. Now, the wait is on for number six.", "The kindle version is great. No problem in that matter and the book is awesome. You can't just get enough. At the end you want to read the next. This collection is terrific. 100% reccomendable in all senses", "This is a \"can't put down\" story I have enjoyed every book of this series and can't wait for the next one to be finished.The characters come to life in this epic story of the struggle to live their lives amongst the upheaval of wars and treachery of the Kings and Queen of the Seven Kingdoms. A great read.", "I was just dying to read this book. Lord knows I waited long enough. It is AMAZING and just makes you crave for the author to FINISH THE STORY!!!"], "review_4": ["It has been so long since the last book of the series, it's hard to remember some of the details he is talking about.  But so far the story is living up to the rest of the series.  I am about 1/3 of the way through the book now and can't wait to pick it up again.  I take it everywhere with me so if I have even 5 minutes I can see what's happening next!", "Riveting! I'm waiting for his next book to find out what happens to characters in this one. He does know how to write them!", "I spent more time than I should have reading one review after another. Most loved GRRM's writing but listed in graphic detail the negative aspects of his latest work. While reading this series, I've found that much of it could be loosely based on ancient and medieval history. Characters change with age or a shift in their life situations. Some children were the product of good parenting, while others could easily be the basis for a fantasy-driven version of psychotherapy. The children turn out to be the strongest and smartest of the series, those that haven't fallen to horrible deaths. Pick a ruling family from Europe during the first millennium and you'll find stories equally as horrible.GRRM doesn't sit at his desk and wait for his readers to advise on what to do with each character and how to develop each kingdom. He is a master at what he does and many authors of his caliber also write books of 850 to 1200 pages. They also take years between novels and we gladly wait for each of them. He stands far above the book-of-the-month writers. I've always found when reading fantasy or sci-fi, you have to jump in the deep end and let the writer take you to places you couldn't possibly imagine. It's like a leap of faith. In for a penny, in for a pound. I've loved the entire Ice and Fire series because even when the characters aren't your favorite and the plots seem to move a little slower, he's usually taking you to places he hasn't shown you yet, like in Feast. You get a taste of every kingdom and the lands beyond the narrow sea. It just happened to take him more than 5000 pages to get us to this point. And what a 5000 pages it was. I will agree with readers who complained about the extensive lists of people, their sigils, clothing and food. But I'm willing to swim in the deep end for a few thousand more pages, with an open mind.GRRM is the story teller, and I am in search of a fantastic diversion. After all, my time is valuable and a book-a-month author has nothing to offer me.", "It satisfys my lust for fantacy.  Well written and great story line.  Characters are large and real.  Home like it should be."], "product_4": ["0002247399", "0002247399", "0002247399", "0002247399"], "product_1": ["0001712772", "0006393195", "0006473296", "0006476155"], "score_3": [0.0625, 0.07142857142857142, 0.07692307692307693, 0.1125], "product_3": ["0006511252", "0002247399", "000222383X", "0006492460"]}]