[{"score_1": [0.02702702702702703, 0.0625, 0.0625, 0.06666666666666667], "score_2": [0.07142857142857142, 0.1, 0.1, 0.125], "product_2": ["B00001WRSJ", "B00001P4XH", "B00001WRSJ", "0972683275"], "score_4": [0.16666666666666666, 0.2, 0.2, 0.2], "score_5": [0.06666666666666667, 0.1111111111111111, 0.14285714285714285, 0.14285714285714285], "review_1": ["Pros: Uses less batteries than the Space Shuttle... (6 AAs)Great idea gone to H*** quickly due to LACK OF PRODUCT SUPPORT! Apparently the person in charge of designing and marketing tapes for these units suffers from Attention Deficit Disorder and is totally unable to remotely consider any meaningful COMPLETE LINE of tapes. Red, blue,white pearl (paper?) - Yellow smiley faces. Green metalic. Black on clear - but no white on clear...There appears to be little, if any, hope for those who might actually like to COLOR CODE products in any single medium - plastic, paper, polyester, metallic,etc. Just whatever come to the designer's head is what's released. Five types here. Two there. One over here... No rhyme nor reason.Dymo has done themselves NO FAVORS HERE!", "Piece of crap, the ear pads keep coming off.  I should have just bought the Beats headphones by dr. dre instead.", "amazon list this as in stock i placed order 10/21/ and used 2nd day shipping its 10/29 and just shipped, Amazon upgraded shipping to next day, big help when it takes a week and a half to get order", "I thought this was a great purchase for my handspring for those times when I was on the road and wanted to Sync with my laptop computer.  Unfortunately, it did not work with my Visor Deluxe and so far I have been unable to understand why.The trouble started when I went to sync and discovered that there was no HotSync button anywhere on the cable.  Unable to start the process, I gave up."], "product_5": ["B00003CWE5", "B00000JD4T", "B00000J0IX", "B00000J1V5"], "review_3": ["An eReader without e-ink? Really?eReaders are devices dedicated to reading, and thus the main inconvenience they should avoid is eye-strain.By introducing a backlit eBook, B&N; removed the key point of eReaders.If you need a device that has a backlit screen (and can afford a $283 device), why wouldn't you pay the extra $200 to get an iPad, which does the job much more efficiently?Please, correct me if I'm wrong, because I really don't get the point of this device.Thanks.", "I bought this from B & N and had to return it back in June and they have still not credited me for the return.  I have called them at least ten times over the past two months and have been on the phone at least two to thee hours each time and they have still not credited me yet for the nook touch.  I am now forced to report it to my credit card company and hopefully they can get some where with them.  Buyer beware where you buy your Nook touch.", "I have used a Palm V since they where out in the market. Now I just bought a HP Jornada 458 and been wondering when we are going to have a device so powerful and nice looking as those powered with pocket pc.I'm not talking about the color, I'm talking on a device that can hold mission critical applications and tools for developing professional modules that can interact with bar code readers, gps, and RadioFrecuency data interchange.This keeps Palm's &quot;??&quot; in the &quot;what's going on with you?&quot; apparel.I must recognize that Palm Vx size it amasing and very convenient if you like to carry it on your shirt pocket", "Pay close attention.  I would be very cautious about swallowing a few of the &#34;most helpful favorable reviews&#34;.  Pay attention to that quoted phrase.  I strongly suspect many are paid reviewers or actually employees or someone connected with the addons for the Nook.  Just a &#34;heads up&#34;.  Amazon loves to put the &#34;favorable&#34; insiders up front because the bottom line is sales and what leaves your wallet into theirs is the driver.My Nook is okay for the $79 at my local computer store that wanted to get rid of them.  Its not a bargain at the prices we see here.  If you're serious about a tablet then save up for a good one if you can.  If not, it should work for you.Most folks are putting out honest reviews, some whine artists, some scammers, some who just need to talk to someone.  We can't do much about that, but we can comb through and pick out what we might be able to trust."], "review_2": ["The Pro's1. Very comfortable and lightweight2. Used with an amp the volume gets real loud3. Coil cable to move around real easy4. Very portable and easy to fold upThe Con's1. These headphones are trash when it comes to durabilty2. They have no bass at all3. The highs get real loud that it becomes very uncomfortableSummary: If you like loud music with no BASS at all then these are your headphones.(BUYER BE WARE SPEAKERS ARE KNOWN TO BLOW OUT WITH THE SLIGHTES BIT OF BASS)It just so happen to me the day I got the pair from amazon my right speaker blew out within 1hr.I packed it up and returned it all with in the same day. Don't waste your money and just buy something else.", "Whereas this device will allow you to adjust the volume, the range is limited from no sound to the volume you'd have without it.  I had gotten the [apparently mistaken] impression that it would boost the volume for headphones which had low volume for some sources (like Zune, IPod), but that does not appear to be the case.  Since you can always lower the volume on the source (mp3 player, etc.), I'm having a hard time seeing the value of this device - except that in some cases it might be handier to have an inline control.", "First pair I bought got stolen outta my car, somebody smashed my window and took my bag that held it :(Anyway, first pair sounded great.I bought another pair, there was an extremely disappointing crackle in one of the headphones from a low frequency.  This made me extremely annoyed/angry/disappointed.  I cannot stand bad crap, and I hate to give bad product reviews. But I had to send it back and now I will look for a different company brand, probably for the rest of my life.", "The fact that the pivot point on this TV mount was not built straight caused the TV to tilt slightly when it was swung out.  there is no adjustment for it, so i had to make a choice for the tv to either be straight and level when it was pushed against the wall, or when it was out.  i do not recommend this wall mount.to it's benefit though, it was reasonably sturdy and easy to install."], "review_5": ["These cables are the bomb! I could totaly tell a difference in the picture quality. If you want a good home theather system then ya gotta get these cables. You will love them like i do. It was coolBig Truck", "The best looking Radio in the world, you will love it no matter what. Handsome little machine.", "I have had my GPS for about a year now, and love it, but i have 2 problems with it, the interface is very difficult to use and tedious to search for a city or road.  By the time i find the place im trying to get ive passed it and gone another 20 miles.  Also, mine was working fine when suddenly one day i turned it on and it said it had no maps and i needed a upload.  So i downloaded the latest patch for it, and tried uploading with no success.  I have gotten a number from Magellan to return it, but lost the number (actually my dad did) So im returning it :(  but i must say it was great while it worked, and the tech support is fast and reliable.", "What can you say? It works perfectly and is of high qulity."], "review_4": ["Crips highs, clear voices and instruments, not overpowered lows, thats how I resume the sound performance of the very amazing HD 600. The only drawback for me is the pale esthetic of the cans, otherwise I would have given all 5 stars.", "I didn't expect this camera to  be as good as it is. Takes good pictures and videos. But I am glad that I didn't buy from Kodac: their price is pricey. I gave less than $100 and consider this money well spent.I would recommend this camera.", "Fit only so-so, pressure adjustment flimsy. Sound quality very good but not outstanding; sound leaks very noticeable.", "Get the SportaPros instead.  They look better, can be worn in a street configuration, cost less, and sound exactly the same."], "product_4": ["B00004SY4H", "9984984354", "B00001P4ZH", "B00001P4ZH"], "product_1": ["B00002NDRQ", "B00001WRSJ", "B00001ZWXA", "B00004TL5W"], "score_3": [0.045454545454545456, 0.09090909090909091, 0.1, 0.125], "product_3": ["1400532655", "140053271X", "B000031KIM", "1400698987"]}]