[{"score_1": [0.08, 0.1, 0.14285714285714285, 0.15625], "score_2": [0.13636363636363635, 0.16666666666666666, 0.2, 0.25], "product_2": ["B0000531CQ", "B00003IEME", "B0000530WH", "B000052XPA"], "score_4": [0.14285714285714285, 0.2, 0.2, 0.2222222222222222], "score_5": [0.1111111111111111, 0.16666666666666666, 0.16666666666666666, 0.2], "review_1": ["This stuff burns and then you sneeze flinging the gel out of your nose. The best thing is just to pack vaseline up your nose.", "I bought this as a Christmas gift for my sister's husband. He is very polite. Too polite. I finally found out that he had stopped using it because it didn't do a decent job of clipping those nose hairs, and I'm not sure if I can return it at this point. I would not buy this again.", "This aspirin product is NOT for children under the age of 19!!This product is NOT used for children's headaches!! This product is NOT used for fever, teething, or any other symptoms in children without a Doctor's supervision!!This product has been proven to trigger Reye's syndrome a deadly and often fatal disease in children! Please learn more about aspirin and children at reyessyndrome(dot)org!Please learn more at The National Reye's Syndrome Foundation's website!", "I was surprise to discovered all Sonicare toothbrushes are disposable item. Its battery cannot be replace what so ever. Like any other electronic products, its battery and IC board are toxic and can only be dispose by your local electronic waste program. Mine lasted about 6 months, at this rate...we're going to end up tones of these in our landfill. It is airresponsible to produce products like this. If I had known about this I would never have bought it.Forget about this hi-tech marketing stuff. Use a regular toothbrush and get your teeth clean regularly is the best prevention."], "product_5": ["B000052XHI", "B00005TP4H", "B00008BRR6", "B000052XPA"], "review_3": ["The capsules are way too big and you have to take two a day. I don't like it and will never buy it again.Twin Labs makes top quality products. I won't buy this again because it annoys me. I'm not paying money to be annoyed.I'm going to light a candle for peace now.", "We are still waiting for the arrival of our babies but have tested out the scale and generally think that it is a very good item. The scales seems easy to read and looks like it will be quite stable for weighing babies.", "Although it says \"Low Foam Formula\" on the product description, I didn't imagine that it would barely lather up. Basically, the way it applied to my skin is exactly like a lotion. I had to use tons to get full facial coverage. This stuff is expensive and won't last very long because of how much you have to use per shave. Is it better than Edge? Yes, but it is not cost efficient.", "The brush is nice for me to enough small to clean my tooth up !!!However the brush could not be stayed with me longer than expected, or advertised.The replacement schedule for each may be 1 month and half.The two brushes need to replace within 3 moths or less."], "review_2": ["You clearly see Stess B-Complex Caps. Well look carefully on bottle on right hand bottom it has Vit C in it. I cannot take the acid of Vit C, thus had also ordered Ester C, non acidic. Greatly disappointed when it arrived to find the line under what you can see with any ease is saying VIT C also. I do well admit it was on confirmation of order but had to go back and read for first time. I look at what is on screen to order and seldom look at confirmation as most who order a lot on Amazon. Amazon, LOVE IT!!", "i was uneducated in lithium batteries. i thought they were rechargeable. but have come to get info from energizer via their telephone rep..that only lithium ion batteries are rechargeable...that lithium batteries as these are NOT.to me then, the price value is just not there. for the price paid for these i can buy around 36 good alkaline cells.update: i have found these batteries to not last as long as regular alkaline batteries....e.g. i get about 6 months use on a clock from an alkaline but only two months on these lithiums....obviously then i will stick with alkaline over these....i have tho moved to using rechargeable cells for nearly everything anymore- usually the enelop from sanyo- these are very good and certainly cost effective...", "I purchased this after hearing about good housekeeping secrets to staying young. This is the second bottle I have purchased and honestly I see no noticeable difference. I am 30, in good shape, and take care of myself - I think I would notice a difference but sadly this seems to be a bunch of B.S., don't waste your $", "I don't know if technically the thing on my dogs ankle was a boil, but was hoping this stuffwould help draw out the gunk in it and it really didn't do much of anything after several daysuse. Others have been satisfied, but honestly I'd give it half a star but to be fair I was usingit on my dog and probably the skin is tougher than what you'd encounter with your average boil.If there is such a thing."], "review_5": ["Got the box packaging with the three tests inside.  Haven't used them yet, but am excited to in a couple weeks!", "I've been taking this for a week and haven't noticed much difference yet but there haven't been side effects. DHEA takes a while to kick in and small amounts are preferable. i.e. less is sometimes more. I've found Natrol products to be good quality so far.", "There is nothing wrong with it, I received 2 picks and one mirror and actually I needed the mirror only.", "I suffer from HS and bought it for this. This is great for itches as well. It numbs the area so you can forget about it, i.e. mosquito bite, etc. I also use it for my edges. After I got my hair braided it was tight and annoying and I am using it for a few days until my hair loosens a bit. I will also use if for my eyebrows when I pluck. Apply first, leave for a few minutes, then wipe. The product should have numbed the area long enough and makes tweezing/waxing less painful. I will buy many times."], "review_4": ["I ordered these for a friend of mine because of the price and she could not find them at this price.", "I purchased this test about a year or so ago because I thought maybe I was pregnant. Turns out I wasn't and I had 2 extra tests left. 5 months ago I had a feeling I was pregnant again because I had missed an entire month of cycle and I was feeling weird. I took the last two in the box and they both came out positive. My sister stated that because my room is overly warm in the summer and the fact that they were sitting for so long it may have been condensation leading to the positive test, so I went out and got ClearBlue. Turns out I was pregnant since the digital backed it up. I am rating this a 4 because of the fact that the information was correct in the test. I knocked off a star because these type of tests, depending on the weather and how long it's been in the weather, can sometimes give you false information. In my experience the digital tests have been tried and true. However, this is the cheapest if you go to Walmart to get the test so for someone on a budget this is perfectly acceptable. I took 8 different tests because I didn't believe the first 3, so I was overly thorough and they all came out positive. However, I am not sure if I personally would have used this test on it's own and truly believed the response. It's all a matter of personal taste however, so I see no more reasons to not buy other than the one above.", "I can't say enough good things about \"Preparation H\" products. I count on them to deliver and they do!  The only little glitch is that I have long fingernails, and the suppositories do not come with an applicator, so inserting them is particularly awkward (with a slight element of danger). If they would only include an applicator, I would happily update my 4-star rating to a 5-star rating, that is for sure!  But, lack of applicator notwithstanding, no product I have tried works as quickly and with long-lasting results.  Preparation H is simply the best.", "Talc is talc after all. And although this type is NOT medicated, it IS flesh coloured! Neat indeed, unless God blessed you with a complexion other than light tan...in which case you're apt to come off lookin' like a Michael Jackson impersonator."], "product_4": ["B0000532OE", "B000052XHI", "B000092YOX", "B00006BN44"], "product_1": ["B000052X6F", "B000063XHQ", "B00008ZPGC", "B00008BFXG"], "score_3": [0.1111111111111111, 0.14285714285714285, 0.16666666666666666, 0.16666666666666666], "product_3": ["B0000531CQ", "B00009KX5U", "B00005U8WT", "B00008BFXL"]}]