[{"score_1": [0.030303030303030304, 0.05, 0.07142857142857142, 0.07692307692307693], "score_2": [0.09090909090909091, 0.125, 0.13333333333333333, 0.13793103448275862], "product_2": ["B0000GHXSQ", "B000CN7BMA", "B0002PSOJW", "B0002FGY9O"], "score_4": [0.15384615384615385, 0.16666666666666666, 0.16666666666666666, 0.2], "score_5": [0.125, 0.13333333333333333, 0.16129032258064516, 0.17777777777777778], "review_1": ["As a consumer, it is my right to know what ingredients are in the products I buy. I find it very DECEPTIVE that Campbells products do NOT LIST upfront WHAT THE INGREDIENTS ARE IN EACH OF THEIR PRODUCTS. So, you have to go online elsewhere and lo and behold; SUGAR IS IN THE FIRST INGREDIENTS!!!!!!! Consumers beware that sugar is the NUMBER ONE ADDITIVE used by Campbells and it is the NUMBER ONE ADDICTIVE substance that people suffer from.  Read labels. Campbells ought to know better to be upfront--- and stop loading up the consumers with sugar instead of REAL TOMATO, pure vegetable ingredients. And, in case anyone wants to be informed, there are many DECEPTIVE LABELS MANUFACTURERS USE TO call sugar AND THEY ARE ALL THE SAME CHEMICALLY; SUCH AS DEXTROSE, MALTODEXTRIN, SUCROSE, SUCRALOSE, CORN SYRUP, ORGANIC sugar (I love this one, so it is made without fertilizers,---- NOTHING IS HEALTHY ABOUT SUGAR)", "We are allergic to corn starch, and though the Annie Chun peanut noodle bowl has none, as do the Udon and Miso soups, this DOES have corn starch.  If you are allergic, or sensitive to corn, do not order this product.  The corn is not listed, but believe me, it is there- and once you get your package you will see it on the label.", "Honey is a good wholesome food, problem is if its shipped in glass, its bound to get broke, which it was, so naturally i hate to waste any thing, i heated it up filtered the glass out of it, but i know it now was just like store bought, had to heat it,,,,", "I regret I bought these nuts. There are too much sugar and fat in them. Not a natural fat from nuts, but rather saturated fat from \"milk\" chocolate in amount of 30% of daily allowance (there are 2.5 servings per bag). Milk chocolate covering is probably the worst I've ever tried. Planters make good nuts, but chocolate is not their strength. But you're already fat it won't hurt you!"], "product_5": ["B00028Q450", "B0005XP1E2", "B000CN7BMA", "B0007OPW5C"], "review_3": ["These are very large bottles. It is a good dipping sauce with a sweet/spicy flavor.", "I remember trying one as a child.. SPICY! I spat it out instantly because the ginger flavor is so overwhelmingly strong. People seem to love it though, but it doesn't suit my palate.", "The sugar content is more than I thought it would be, wow, are these sweet. I love sugar, but not that much, in my desserts.", "I expected a lot from these beans after reading some of the reviews here on Amazon. I expected a rich, flavorful espresso bean. These beans appear to be under roasted. They are very light in appearance and don't have any of the customary oil that I find thinly coating other quality coffee beans. I still gave them a try, and the resulting brew did taste better than expected, but was nothing to write home about. They do make a very nice cup of regular coffee if ground using the 'course' setting of my bur grinder. I've decided to just use them for coffee as they make a pleasing cup of moderately strong coffee if you use enough beans. I use approximately twice as many beans as I do with the 100% Kona that is my usual bean to get coffee that tastes substantial. These beans also cost half as much as the Kono beans do, so I guess that's tolerable.I would not recommend these for Espresso. For normal coffee they're fine, but still not in any way remarkable."], "review_2": ["Low quality and low flavor hot sauce....not all that hot either.If you need some hot sauce and have nothing else around, then this will do, but that there are so many other choices, this is the worst choice to make. Even regular tobasco sauce is much much better.I can only describe it as being similar to watery taco bell sauce.I would recommend Frontera Hot Sauce, Tobasco, or Cholula Hot sauce over this.", "I love coconut juice but I don't love this. I should also mention that I love pina coladas too. Though I understand that pina coladas are made with coconut MILK and not coconut juice, I thought there would be some parallels.First of all, this drink has a strange salty flavor. Secondly, it's not sweet. It SMELLS sweet and pineapple-y, but the flavors just don't coordinate with each other and don't match the smell.", "For quite some time, I have been using different types of hot sauce on different types of food.  Before I started doing this, I only ever remember using hot sauce on barbeque sandwiches.  Even though I have tried numerous types of hot sauce during this period, Sriracha Hot Chili Sauce has set itself apart from the others as being a hot sauce that I do not consider to be a favorite.  Even though it is not terrible--I used two bottles of it--it is not something that I would use on a regular basis.  As for the sauce's flavor, it is distinctive yet peculiar.  It has a nice heat to it, also--not too mild and not too hot.  I have used it on multiple kinds of food.  I do not consider Sriracha Hot Chili Sauce to be a preference, but I do admit that it stands out from the other hot sauces that I have used.  Actually, I rate it 2.5 stars.", "I read a review and was excited to try this salt. I didn't think it was anything special and would highly recommend Morton's Kosher Salt which is far superior and more flavorable in my opinion. It is available at any grocery store and much cheaper too!"], "review_5": ["I really haven't had it but once, but it is supposed to help with osteoporosis. Time will tell how this product is working.", "Searching Internet videos We now know cancer Is mostly caused by parasites as fungus and viruses also We found out Baking Soda helps cure cancer that Is Baking Soda mixed with Molasses, I do Not have cancer that I know of but thought I might be good for getting rid of stomach fungus & pathogens I drink too much Listerine for this problem and wanted something safer, Of course want to use all Natural Ingredients with means Baking Soda without aluminum (aluminum Is poison) as Bob's Red Mill Baking Soda but when I seen the name Grandma's I thought It must be made by some big evil corporation that had some left over chemicals and thought If they dump a bunch of sugar In It then know one would know the difference so I ordered a different brand from Amazon but I seen Grandma's In WalMart and decided to use It until I got the other brand but It looks like Grandma's Is real natural  molasses.", "I used to confuse \"coconut water\" with \"coconut milk,\" which is a creamy, sugary delight. But it's NOT coconut water, as I learned when we lived in Hawai'i and had coconuts drop out of our palm trees at the most unexpected times. My first taste of coconut WATER was three years ago when we were still on the island... it was so refreshing, so light and yet somehow much less milky than I remembered. That's when a friend pointed out the difference: coconut milk is straight from the coconut. The water is, to put it nicely, a product of chemical wizardry.If you're looking for fresh, clear and light coconut taste -- with one of natures most reliable sources of potassium -- this is the way to go. But don't expect that creamy, milky, super-thick substance you'd ordinarily find in a pina colada. THIS is pure coconut essence, and it's perfect for those who understand there's difference between being quenched by water and being drowned in chemical sugars.", "Yeah. Toothpicks. For $7 no less. What a bargain!!! And they are flavored? No way. That's so cool. Why didn't anyone think of this - well besides Joe in Middle School - with flavoring for next to nothing. But still, a seven dollar tooth pick is my idea of fun. And even better - if you get sick of them you can sell them on ebay as pieces of the crucifix that Jesus was hanged on (or the guy that played him in The Passion)"], "review_4": ["if it's primarily made from lobster, what else is in there? I wonder. Primarily...Who uses a word like that on a food label? It's primarily delicious among other things, things we usually have no energy to talk about after eating a fine meal. I'm so full of primarily lobster bisque that I've been making and have come to be addicted to. NO! I will not share the recipe, because I am too full and don't feel like it. Primarily.", "I met Huy Fong Spiracha in Thailand where he works as a short order cook at the Thaksin Shinawatra restaurant. He introduced me to his Hot Chili Sauce. It's Hotter than Hot Hot Hot Hot but adds a nice taste to most rotten boiled eggs, cow brain, dead fish, or raw yak meat.Gives plenty of fire to dead squid too! Yum!", "This is basically a peppermint candy shaped like a sea shell.  It is milder than american peppermint, but not by much.  4 stars instead of 5 because this is not exotic.  It is fine, but nothing special except the bag I am going to frame.", "I found a fried chicken recipe that has a poultry seasoning in ingredients in it and so I bought this to try. My fried chicken is okay but not that great. So far, that is the only time I use this seasoning perhaps next time I will try it on roast chicken. Overall it was good."], "product_4": ["B00016LA8Y", "B0002PSOJW", "B000B7S2QG", "B0000DD8V3"], "product_1": ["B0009XQTA8", "B000E148MG", "B00014JNI0", "B000E1HUVC"], "score_3": [0.07692307692307693, 0.07692307692307693, 0.125, 0.2], "product_3": ["B00016UX0K", "B0009VZP6Y", "B000AYDGZW", "B0002E2GQU"]}]