[{"score_1": [0.041666666666666664, 0.05263157894736842, 0.07142857142857142, 0.07692307692307693], "score_2": [0.16666666666666666, 0.16666666666666666, 0.16666666666666666, 0.16666666666666666], "product_2": ["B0000E5KT3", "B0000V2OLC", "B0001FAANQ", "B00022O5SO"], "score_4": [0.16666666666666666, 0.25, 0.2857142857142857, 0.3333333333333333], "score_5": [0.09523809523809523, 0.14285714285714285, 0.16666666666666666, 0.2], "review_1": ["From this product's packaging:&#34;*WARNING* This product contains lead, a chemical known to the State of California to cause cancer and birth defects or other reproductive harm.&#34;Now then. I have no problem with this information, IF the information is included in the description of the product on Amazon.com.The fact is, this information is NOT included in the description of the product on Amazon.com.The packaging states, &#34;Made in the U.S.A.&#34; and &#34;The Very Best in Quality Gun Care Tools&#34;.  This is marketing gimmickry to overshadow the product's toxicity.There is no rule of chemistry or physics such that a set of brass pin punches such as this one MUST include lead.  The inclusion of lead in the product is entirely by choice of the manufacturer. Period.Had I known the product included lead, I would not have purchased it. Period.Sure, when I use tools such as these, I generally wear gloves.But the fact is, I do not want any more lead or other seriously toxic materials in my life than absolutely necessary and it is NOT necessary that this set of brass pin punches include lead and thus require the warning.My recommendation? Do not purchase this product.If you are unaware of the problems with lead exposure, I suggest you find out. Your health is at stake.", "Watch out, this dessert has trans-fat in it.  I haven't eaten it, so can't comment on the meal itself.  I grabbed it off the shelf, thinking it sounded good, but then realized yikes, it has trans-fat.  Why do companies still use that stuff?", "This cooler looked cute so I bought it.I did a test, however, and found that ziploc bags work better to insulate and take up far less space.What you do is take a 2 gallon ziploc bag, fill it halfway with ice, then put another ziploc bag in there with your drinks, food, etc., then seal the inner ziploc then the outer ziploc.Your items will be cooler after 6 hours than they will be in the igloo.What a waste of money and space.  You can buy hundreds of ziploc bags for the price, and have it be easier to carry, reusable, lighter, etc., with stay cool longer effects.", "ORIGINAL:It is like a Yellow Ferrari :) The color in the picture is faithful to reality. All tool are excellent as expected but beware that this is very small knife. A true keyring thin short knife and micro scissors :)UPDATE:After first use, I noticed that the keyring is at the wrong end of the knife and right end of the scissors. Maybe this knife in reality is a nail-clipper (scissor to clip and file to smooth out and the knife is a novilty that goes with the name. I am updating my review to 1 just so they may listen otherwise the knife is worth 3.5 stars max 4.ACTIONI think we should all update our ratings to 1 for Victronix to listen up or as one of the reviewer said already that he has contacted them since 2o years ago but no one listen."], "product_5": ["B0000WKSWI", "B0000ATDSQ", "B0002IKR7Q", "B000093ILC"], "review_3": ["This is totally my fault for not paying attention to the posted size. I thought these would be longer to use as top roping anchors. Not really, they're a little bigger than wrist size. Well, good addition to my rack... but not what I needed.", "I bought one of these at Wal-Mart, worked great for a year, comfortable, easy to install, etc., but then it was simply removed & stolen by a passerby. I can't think of a good way to 'lock' it on so I'm just going with a comfortable seat that can't be taken off so easily. Be warned.", "Stand alone a very good matt. The Jade Fusion is significantly better.  For the people whining about the weight, why are you exercising anyways? Just shut up and lay in bed you weak whiners. With that said the Jade Fusion is a much better matt.", "The product doesn't really say what these are meant for. I bought them and took them out with my little brother to shoot my Ruger 10/22. There were a couple shots that weren't direct hits on the orange target that hit the stands. Even the few .22 caliber rounds that grazed the stands did a lot of damage. Two of them completely snapped off and one of the others probably won't hold the disk anymore.I gave it 3 stars because I'm assuming that using a bb gun or an air soft gun would be just fine, and probably a lot of fun."], "review_2": ["This product produces a slow flow due to its design. I bought it because a reviewer said it fits a Nalgene water bottle. And it will fit some. But the flow of water from it is very slow. I would not but it again. I would not even use it on a Dromedary water bag. The water bag  nozzle is good enough.", "This does not tighten anywhere close to fitting the dovetails on a rifle.  I assume if a rail is installed it will fit the rail.  This item was returned.  If you know this will work for you the quality is good.", "Great sized target with outlined kill zones but it's way too flimsy for dangling on a wire at a gun range.I have found that if you fold the top a few times in 1\" increments about 2-3 times you can definitely use it.Taping other smaller targets to it (like one of the 100 pack gammo's) makes them useful but I don't think I'd buy these again.", "Well, if I were truly hungry, I might try it again.I used boiling water, 2 cups, and followed the directions.  By the end of the standing time it was cooling off and wasn't cooked.  I thought about pouring it into a pan and boiling it but that would have defeated the purpose of having a quick, easy meal with little cleanup, so I ate the noodles out of it (they were good) and gave the rest to my dogs."], "review_5": ["Marriage between a man and woman is a blessed thing,As a reminder, we often use the ring.But a real man can't use the ring as an imitation,'Cause he got to perform and fulfill the situation.A man can't be a slob,When it comes to performing his marital job.He's got to sweat,Until she gets wet.But there are sometimes when love gets too slippery when it gets wet,And this sweatband works great and is a sure bet!...Fellas, treasure your wife....GhillieMan", "OK, so, it's a barbell, what is there to review, but I just bought 1 of these for finger exercises and the lip around the edge of the barbell is a good distance to get the tips of my fingers under for that kind of lifting.  It's a good product.  I'm glad I bought it.", "It is a great scope for rimfire handguns. It looks very nice on stainless steel guns.", "Haven't yet used this product yet but the quality is terrific and I'm looking forward to learning how to use a compass and being more self sufficient...and not getting lost!"], "review_4": ["Double bladed, my only gripe is the blade's a tad short. Most manufacturers of great knives don't want to go through the trouble sharpening both edges, but SOG. The characteristics of this knife make it a good fighting knife, but a little on the smallish side. Take a look at the Cold Steel Voyager with a 5- or 6-inch blade for not a whole lot more money. Chances are you'll drop this one in a heartbeat.Free shipping on knives would be great, too, but too many of these outfits want $7 or $8 to send you a $45 knife! I keep hoping free shipping will become the wave of the future in Internet sales. At least on smaller items.", "The rem oil wipes are pretty good for a quick wipe down of the gun, I dont use it as a bore cleaner only on outside as of now it does a nice job overall it should be oiled a little bit more. This is for use after the gun has been cleaned good in the past this is just a touch up job that will last till a good cleaning is due.", "This bottle is a little pricy. But it does what it claims. It preserves hot water temperature very well. I didn't try the cold temperature. The construction is very solid for high impact resistent (good for portability). I have no doubt that it will last for many many years. In all, I am happy with the quality of this bottle. But, I will take 1 star out due to its premium price.", "However did I survive without all this stuff, but given youngest grandson's first attempts at riding a bike, a good purchase! Matches the Razor helmet well! Cool means they'll more likely wear it when you're not standing over them!!"], "product_4": ["B00004U9J9", "B0000C50K2", "B0000643KA", "B000067QMK"], "product_1": ["B00018ADUS", "B00022O5SO", "B0001AV5NK", "B00004YVAJ"], "score_3": [0.023255813953488372, 0.16666666666666666, 0.2, 0.2], "product_3": ["B0000E5N4J", "B00005OKZ7", "B0000DZFXZ", "B0002ILDKG"]}]