[{"score_1": [0.043478260869565216, 0.06896551724137931, 0.09090909090909091, 0.09090909090909091], "score_2": [0.18181818181818182, 0.2, 0.25, 0.25], "product_2": ["B001DN5030", "B001BZH2QI", "B000CQXHOS", "B001PBWNOY"], "score_4": [0.16666666666666666, 0.25, 0.25, 0.25], "score_5": [0.2, 0.25, 0.25, 0.25], "review_1": ["i ordered the phone few days ago and it arrived today.  initially i was so excited that i got the package so fast even though i took advantage of using the free shipping.  but soon:my excitement turned into suspicion, then surprise and finally angry:(suspicion)  the box felted a bit light(surprise)  the seal on the box was broken(ANGRY)  NO PHONE INSIDE THE BOX!!!it has the manual and the wall charger but the phone.  this is ridiculous, not even the April Fools' day yet!i contacted Amazon immediately and another phone is on its way to my door.  i have purchased countless items from Amazon, new or used, but NEVER received empty box.  i appreciate Amazon's effort in resolving this problem quickly, but still it looks Amazon is getting too comfortable being the #1 e-retailer for too long, WAKE UP, AMAZON.COM!", "Don't waste your money.  This will work, but at what cost.  You pay $25 more than it is worth.  Unless you plan on watching the video on a screen smaller than 20 inches I would not buy this.", "Well, I have no idea what these sound like. They wont work on my phone! The connector is made ONLY for a Ericsson phone, which was NOT stated anywhere on the description. They were however cheap, so I really cant complain too much.", "that us only for Android tablets. I wish I had noticed that before I got it , sent it back obviously.I would think they would want ti make it for all tablets with capacitive screens,"], "product_5": ["9658231950", "9658231950", "B001DQQBVW", "B001GD87QO"], "review_3": ["When I went to use this the fist time, it was dead.  I think it can accidentally turn on in your bag if the button gets pressed.  Also, I just upgraded from iPhone to an android where I can simply change the freakin battery pack.  IMHO, don't waste your money on this for your puny iPhone.  Get an android with replaceable batteries, and universal microSD charger, and a man-sized screen.", "I had to return this phone after 2 days, It would reboot itself and or just lockup. I read about this before. It did have the latest firmware.  The price was $517 when I ordered, it dropped to $488 now. The nokia n95 8g  was 639 and that day I returned Nokia has it for $579 for like a day.  However, the drawback with the phone.  I use a treo and a blackberry. The lack of a keyboard is hard to deal with.  I really wanted to like the device it does allot.  The camera features are nice,  the 8g version seems to be the better way to go in terms of os since I think it has more operating memory.  Nokia is releasing the N96 soon, then the Nokia Tube, hence the price drops.  But it did work ok on att 3g, wifi worked,  the lock ups and freezing was not acceptable for a phone that cost $500.", "I live in the country and the cell phone service depends upon carrier. Most CDMA carriers will get some reception while GSM is pretty much non-existant.Installing the booster didn't do anything for the GSM phones, but it did help a little with the CDMAs.Since we use GSM at our house, this isn't going to work for us.", "Not the fault of the cable, but it is the reason I purchased it. I'm sure it's a great cable otherwise."], "review_2": ["I return the item because it did not give me all it says will do.", "I am so disappointed this phone did not work out.  I was highly impressed with the Nokia E71, except for one essential.  Due to a hearing problem, I keep my cell phone on vibrate 100% of the time.  I tried this one in my pocket, and in a good quality waist/belt case, and could never feel it even though I'd just called it myself from our land line, and knew full well that it was ringing.  Only when I held the phone in my hand directly could I feel it - vibration was exceptionally weak.Why so harsh if the rest of the phone is so good?  Because I can't conceive of a cell phone without a usable vibrate option.  Even if I had good hearing in both ears, there are times when only the vibrate option is appropriate (school, church, work meetings, etc.).  Without it, I consider there to be no reason to own it.  No vibrate option makes for a no-go for me.I ended up getting a Blackberry Curve, and really like it, but I'd still rather have the Nokia E71 after only a couple of days using it - just as long as it had a decent vibrator.There is one \"be aware\" item with this phone - apparently NONE of the major US carriers offers this phone as an option.  I don't know why, since T-Mobile does offer it in Europe.  But I was not deterred by that, and found out that at least T-Mobile tech suppport can still be quite useful even with this phone (I had a data-transfer issue right after I got it, and T-Mobile was able to get me through the issue quite satisfactorily.Bottom Line: except for the vibrator being very weak, this would otherwise have ended up with at least a 4-star rating, and very likely 5 stars.", "I had the 850 and thought that it was decent but could be better so I bought the 700. Let me just say that I own the Motorola V330 and from reading the other reviews, it seems that this headset works best with the razr. That being said, it does not work well with the v330. If you move more than 4 feet away from your phone, you get a ton of static. People tell me that I sound muffled when I'm talking to them. My advice is to only get this if you have the razr otherwise forget it.", "I'm totally convinced that this bluetooth headset from VXI BlueParrot Roadwarrior wasn't a good choice. It hasn't a very good noise cancellation and its clarity isn't a great new. I tried another product."], "review_5": ["Bought case for me and wife to qualify for free shipping. Came in different colors to match phone.  Can go entire 24 hours without charging; but I am not a kid playing games all day long. No complaints or problems. (Personally I wrote another review in the wrong spot since we had diff phones and diff colors I f&%$ up)", "couldnt watch movies on the htc without the battery dying. the phone is great for entertainment. but battery could be better. the powerbear cases is a great fit and a good kick stand on teh back for entertainment. im sold", "I purchased this mount for my iPhone 3G.  I am very pleased.  The item stays very securely on the dashboard and has multiple adjustments to give you the perfect viewing angle.  The only negative comment I have is that the bottom tensioner will not support anything wider than the standard iPhone dock plug.  I purchased a Satechi iPhone FM transmitter and it is too wide for the tensioner; I'm attempting to get a refund on that as it is rendered useless with this configuration.One other thing if Amazon is reading this: WHY DO YOU DROP THE PRICE RIGHT AFTER I PURCHASE SOMETHING???  I should get a price guarantee and Amazon should credit my account.", "I love this  gadget! It is comfortable enough to wear for long periods of time and the sound quality is great. It doesn't pick up excessive amounts of background noise. When I would wear it while outside, noone complained about the noise or the wind which was unfortunately blowing like crazy at times. My cell phone alone always picks up the wind and the person on the other end can hear it, but this headset seemed to eliminate all of that. It does feel a little weird at first while wearing it, but I wasn't used to wearing something like this. I quickly got used to it and have no complaints. It was not irritating or heavy or anything. It stayed in place even while doing housework and other chores and generally being active/physical. It didn't make my ear sore or uncomfortable and I could just go about my business and gab away. The charge lasts pretty long too, which is nice because I tend to have really long conversations lol. I love that it came with a car charger. This is hands down one of my favorite gadgets now!"], "review_4": ["What more do i need to say, it works!  I used to get one or sometime no bar at my house, but now i get two bars around the device.  Just wish the booster can reach longer distance.", "The Razr may have been out awhile but it has alot of under the hood improvements in different versions and is still a great phone.  Slim, well made with a great feel.  Verizon has the best customer service and  signal access of any carrier I have ever had and I have had all of them.", "Manufacturers are really getting hung up on the word \"Extreme\" these days.  Electronics products seem to be plagued with this word the most, as everyone wants people to think their product is one step above excellence.  Well Jabra makes some really impressive headsets, this product included, but I have yet to find one Bluetooth headset that is even close to being worthy of the word \"EXTREME!\"With that being said, I have been using the Jabra EXTREME Bluetooth Headset now for almost a month and I can honestly say that it is one solid performer.  Sound quality (incoming) is pretty good, although not the greatest, and people who have called me claim that my voice sounds very crisp and clear.  However, they also claim that they can still hear a fair amount of background noise.  In fact, one caller described the noise as being rather \"focused,\" as if certain sounds were muted but other sounds were being amplified.  So for noise cancelling I would say it is on par or slightly better than some of the other dual mic., noise cancelling headsets that I have tested from Motorola and Plantronics.  I do not consider slightly better as being \"Extreme.\"The one thing I have never really liked about many headsets out there is the ear-gels they use for holding them in your ear.  I realize that fit and feel are a matter of preference, but I find that I must fidget with them way too much to get them in my ear properly.  Meanwhile I might be driving down the road and spending way too much time playing around with my headset.  If they made a type that fit in your ear, in a similar fashion to ear bud style music headphones, I think I would be far happier.  But for now my favorite design is the kind that sits over my ear instead of in the ear.  That way I can pop the headset on and off in seconds, without any fiddling around.  But again, this is strictly a matter of personal preference.  As far as how good the Jabra Extreme feels, I can only say that it is extremely light, very small, and the ear-gels are on par with just about all other Jabra headsets to date.  I think the ear hook should be flared out just a bit on the end, so that you don't poke your ear with it when putting it on.So overall I would break down my rating of this device as follows:Visual Appeal  =  4-starsFit & Feel  =  3-starsNoise Cancelation  =  4-starsSound Quality  =  4-starsControls / Ease of Use  =  3-starsWireless Communication (between headset and phone)  =  4-starsI would say the Jabra EXTREME Bluetooth Headset is a solid 4-star device, which puts it above average in my book.  But the only that I would consider \"extreme\" about this headset is the teeny size of the control buttons.  I can barely feel them when trying to adjust the volume.  I do recommend this headset, as I feel it is a quality built device that is a step above most other headsets in this price range.  However, I think Jabra, as well as every other manufacturer out there, should not just throw around the word `extreme' so loosely.  I they can produce a product that is truly excellent in nearly every manner, then by all means call it Extreme.  Eventually the word `extreme' will mean nothing to consumers, as we will eventually define the word, mentally, as \"better than average.\"", "I had a BT530 Jabra for a year worked GREAT! Lost it and use this to replace...after two months started getting noisy. Jabra will replace but wonder like cars and everything made in China if quality has gone down."], "product_4": ["B0014KOB6Y", "B000G7LWRM", "B001GD87QO", "B001GD87QO"], "product_1": ["B00212HNA0", "B001DK9LB0", "B000BPR2SW", "B0019LSK38"], "score_3": [0.14285714285714285, 0.18181818181818182, 0.2, 0.2], "product_3": ["B0013G8PTS", "B000WR81ZM", "B0014KOB6Y", "B001UC9NOQ"]}]