[{"score_1": [0.014084507042253521, 0.019230769230769232, 0.020833333333333332, 0.023809523809523808], "score_2": [0.01818181818181818, 0.045454545454545456, 0.05, 0.05263157894736842], "product_2": ["630025075X", "6304639457", "1929243154", "6303284183"], "score_4": [0.047619047619047616, 0.0625, 0.09090909090909091, 0.09523809523809523], "score_5": [0.02702702702702703, 0.0625, 0.1111111111111111, 0.1111111111111111], "review_1": ["why are you praising this guy so much? he was just playing the blues! anyone can do that now-a-days! i thought the dvd was boring and was another blues artist. big freakin' deal!you want some real guitar master, search for steve vai, joe satriani, yngwie malmsteen, john petrucci, tony mcalpine, etc... these are the true guitar gods!lets be real here, the dvd was crap. don't waste your money on it.", "Ah! Brian Regan, the bastian of clean comedy in America whether he's family friendly, or not.  The question of clean comedy vs dirty comedy and right and wrong isn't what goes on in my head and I pity those who think it's about that (and I know there are more than a few in his audience).  There are funny comedians on both sides of the fence and Regan is squeaky clean which makes me look at him differently.  Kevin James is largely clean and others are clean and lame, but what's wrong with having a few jokes that don't fly with little kids and when was stand-up comedy about universal appeal or understanding?  Taking these things into account I understand where Regan is coming from being from a middle class Protestant household with history in Mennonite.  He strays from anything that would be impolite, crass, rude, or unappealing to anyone within earshot because the most impressionable and sheltering audiences run at the first sign of dissent, not to mention a dangerous tone of voice. This results in his comedy being akin to clown shoes, a prop that serves no purpose in the service of comedy. To others more accustomed to personalized comedy it comes off as less than honest even when he talks about himself or his family.  To me, he's not funny at all.  Even comedians I can't relate to are funnier. It just seems that he boxes himself in, rather than being himself and in the process he can't reach profound comedy, or entertaining humor at all outside of this sheltered audience.  If you're an adult and you like Regan I have no interest in hearing your tastes apart from him, he's that bad to me on this cd.  This started it all and I've seen his specials on TV thinking he must pick something funny off of the road and he's always terrible, worse even.  To those who love comedy and like to see clean done well, stay away from this man, he's killing the game.", "Not for everyone OR ANYone that I know. This is not music, not art... not even artistic. Reminds me of a 60's Haight/Ashbury nightmare experience. Not only would I not play it more than twice... I needed to move the actual DVD box to a different location for fear of contaminating the other really great DVD's in my collection... YES, I was that annoyed with  being ripped off... AGAIN! Save your money, plant a tree instead.", "I don't and haven't seen what the big deal is with this band, they sound like a crap rock band, and this comes from a ROCK/Metal fan to the core and I mean real music not nu-crap rock."], "product_5": ["6304749112", "073890015X", "0788806270", "1858705223"], "review_3": ["i never saw this dvd but i had to give it a rating. im here to talk about another video. it is emotional rescue video. i am looking for the full version without the thermo. they destroyed that one by putting in the thermo shots. that was the best performance i ever saw of the stones. it was in the studio and the performance was excellent. i saw it back in 1981 on the solid gold show and never saw it since. its on the vhs tape called video rewind but they cut the video down to nothing with thermo shots. and it was recently put on you tube but they removed it quickly. what is the reason for this. did someone buy the rites or something. please release the full studio version video of emotional rescue with no thermo shots at all. i would pay 300 dollars for it. thank you very much", "I love Rush's new album. It is right up there with the new album by Lovari called \"No Holding back\" as my two favorties so far this year. http://www.amazon.com/No-Holding-Back/dp/B00860R7XY/ref=sr_shvl_album_1?ie=UTF8&qid=1339653627&sr=301-1", "This could have been a real exciting DVD but Elvis obviously had little respect for the music he made famous.  He spent too much time making fun of it or his delivery or just quivering his upper lip as a joke.  Just sing the songs the way they were meant to be sung and stop playing around.  The choice of songs was great, the venue was wonderful but he just couldn't appreciate it all and as a result, the entire DVD was a disappointment.  Maybe had he lived longer, he would have gotten to the age where his big hits were treasured and not trashed by him.", "I wouldn't reccommend this as a first La Fanciulla del West(looks of the Minnie wise) but singing wise I would. Carol Neblett sings beautifully but she looks so horrible that I can't bare to see a Minnie who looks even worse than she. There are more beautiful looking Minnies, perhaps one of them is in the La Scala video. But Neblett's voice is excellent. Placido Domingo is a good-looking Dick Johnson/Ramerrez and also sings really well. Juan Pons doesn't look anything like someone who would play Jack Rance, he looks more like The Flying Dutchman, but his voice is excellent. In my opinion, the lookwise flaws are for Carol Neblett and Juan Pons, otherwise, good-looking. I have no complaints about Nello Santi's conducting, though. The director should've hired Kiri Te Kanawa or Renata Tebaldi to play Minnie and either Sherrill Milnes or Giuseppe Taddei for Jack Rance instead of Juan Pons. For a first reccommendation, get the La Scala set, and tell me if you see a beautiful looking Minnie or a more normal looking Jack Rance, because I've never saw that filmed version of the opera. I care about the looks too besides the voice, and when or if I become a director I'll hire someone who's more like Kiri Te Kanawa to play thwe role of Minnie. Jack rance shouldn't have long hair at all."], "review_2": ["I know I am gonna offend a lot of Gilmore fans, but let's face it, Roger Waters at least has been keeping physcially fit.  The first thing that came to mind when I viewed this was, \"Gilmore has really let himself go.\"  It looks like he has spent his free time eating donuts, ice cream, pasta and McDonalds.  And to add insult to injury, he plays wearing an old shabby t-shirt.I mean, if you are bloated and overweight, try to at least compensate and put on a decent shirt.  It is painful looking at his grimace through his fat face.  David, I respect your talents as a guitar God, but please get in shape or your gonna die early and not fully appreciate what you have accomplished in life.", "Fleetwood Mac, unless you are a true fan, really puts on a senseless, energy-drained show here that you'll sicken of faster than a can of Gummie Worms at the State Fair.  And State Fairs, indeed, are where this group ought to be playing; right next to Whitesnake and Rick Springfield and the demolition derby and blue ribbon goats.Buckingham gets his ya-yas out a couple times on lead guitar, but other than that, the ladies sound old, the bass player John just stands there (like he has for his entire career).  Christine still looks youthful; an unsung MaryAnne next to Stevie's more often photographed Ginger. Christine remains a comely British school marm ready to spank your wrists for looking up her skirt, so that's one redeeming feature. Yet that small pleasure is offset by Mick's still googly eyes and the 1980s vest.  Thanks for putting a camera right by Mick so that I can get scared out of my easy chair every time he stares those cue balls at the camera; nice touch for Halloween.I wish I could say that Fleetwood Mac are rockers, but alas, they are little more than Lawrence Welk on steroids.  Sure, Don't Stop pushes the metronome to 40 mph from Fleetwood Mac's usual school zone 20 mph pace, but seriously rip-snortin' rock and roll this just ain't, brothers and sisters.  No matter how much Dolby 5.1 Surround and DVD fog-filtered quality you throw at this show, the music remains elevator quality drivel.  The passge of time has, in my opinion, shown the Mac's music to be thinner than the veils around Stevie's midsection paunch.Pass on it.", "I gotta admit I'm a bit surprised at how generously people are rating this album.  I bought it because people raved about it so much.  My wife and I listened to it on our drive to Indianapolis this weekend and ... we found it very lackluster.  I'm not saying all other reviews here are WRONG, I'm glad they enjoyed it.  However, this album pales in comparison to other works out there.  It simply doesn't measure up to the likes of Todd Barry or Mitch Hedburg.  Not even close.It is an uncommonly clean album which is nice to see once in a while but I still just can't ignore that it didn't make me laugh much.  It went beyond being clean into JUST PLAIN NON-THREATENING and I wonder if that's what some like about it.  I would love to see more comedians out there who can do \"clean\" material that still sets people on edge.As for this album, I simply can't recommend it.  It feels very dated even though it's only from 1997.  (Carlin has stuff from the 70s that feel TIMELESS.  That will never be the case with Regan's album.)  He is not the skilled writer or performer on par with other guys out there.  But that's my experience with the album.  IF it absolutely makes someone else's day brighter, that's great.", "Very disapointed. Couldn't even watch the whole thing. Led Z moves me, this tapes left me cold."], "review_5": ["I am NOT a Judy fan, I got this because I am a Liza fan. With the exception of a VERY strange impromptu dance in one segment, Liza shines.  Judy of course just gets more and more &quot;weird&quot; as the concert progresses...poor thing can't even sing her signature &quot;Over the Rainbow&quot; song.  Judy at her worst, Liza...the beginning...Must have for any serious Liza fan.", "I read one of the review's on here for woodstock 99and I'm sick of people writing review's and they don'teven know the difference between rock and pop.First of all Limp Bizkit, Korn and Kid rock are not popbands they are rock and metal bands.Sure they are mainstreambands but they are still rock and metal bands.It's obviousthat future woodstock concert's won't be the same as the first.That was then this now and there is a whole new generationof band's out there waiting to be heard. wether it'd be metal,hard rock, blues, Jazz, rap/hip hop,alternative and etc.a bigconcert like this has to please everybody.They are not puttingon a concert just for you it's for everybody.I've never beento woodstock but even I know that not everybody listen's tothe same music.I love rock n roll, blues, heavy metal , alternative, rap and Jazz and if I were to attend woodstockif there's a band I don't like playing I'll walk away fromthe stage and wait to hear who's next.I wish people wouldrespect music even if they don't like it.The reviewer who I'mtalking about must be old because he or she only care'sabout the first woodstock and doesn't appreciate any othermusic.Like I said that was then this is now and well if youdon't like it well don't buy a ticket. Woodstock 99' wasan awesome event with alot of great new music and a wholenew generation of people.It's ok to remember the firstwoodstock but now there will be more and better woodstock'sin the future.", "I'll hand out the good news before my usual overwrought commentary.\"Pinocchio\" is often praised as the most-beautiful animated film ever made, but (for this viewer) it doesn't come close to \"Bambi\". Landscapes are always popular subjects for art (painted or photographed), and \"Bambi\" is nothing if not one huge landscape. From the extended Multiplane sequence that pulls us into the depths of the forest, to the breadth of the meadow on which the deer gambol, the artwork is not merely a background, but a devotional act of \"love of Nature\".On a 60\" plasma display, this is both subtle and stunning. As with the BD of \"Pinocchio\", you feel you're seeing details that were never previously visible -- as well as the work and commitment that went into creating the art.Even more significant are the expressionistic sequences, particularly the one in which Bambi fights Ronno for Faline. This was just the sort of thing that should have impressed the artsy-fartsy types who first praised Disney, then turned on him, but it appears not to have. \"Bambi\" was Disney's last major attempt at serious experimentation.I and others have questioned whether earlier Disney transfers took into account Technicolor's errors, to more-accurately represent the artists' intent. This doesn't seem to be an issue with \"Bambi\". With the exception of two blue-and-yellow birds near the beginning, the hue and saturation look consistently \"right\" throughout. And the general \"clean-up\" of the image adds to one's appreciation of the art and animation, rather than looking \"sterile\" (as it does in \"Pinocchio\").The liner notes describe this and other Disney Blu-ray films as \"Digitally restored beyond their original brilliance\". Ignoring the fact that the writer doesn't know what \"restored\" means, this statement suggests that Disney management isn't worried whether the home-video editions accurately present the way the film originally looked. Am I being unreasonable in feeling it should?Well... Yes and no. Many live-action films are transferred from the composite or camera negative, which improves image quality to a level not seen in theaters, and no one complains. And in watching the three-strip transfers of \"Meet Me in St Louis\" and \"The Adventures of Robin Hood\", I never had a \"That doesn't look right\" reaction. But one /does/ have such reactions with early Disney animation, when colors seem to have the wrong hue, or to be overly saturated. I'll let this drop for the time being.As for the story... Walt Disney was a life-long animal lover, and \"Bambi\" presents a view of \"Nature\" and Man's relationship to it that is too-often naive and sentimental. In Bambi's world, Man is the only carnivore. When \"Friend Owl\" returns in the morning, we aren't told what was doing at night, nor that he might consider Thumper a tasty treat. (A mother owl with young to feed would make short work of Herr Hare.) And where are the wolves? * Without wolves to cull the deer, those lovable forest rats (which is what deer really are) would consume so much vegetation that little would be left to get them through the Winter. (To its credit, \"Bambi\" shows the deer in Winter in a state of near-starvation.)I object to killing animals wantonly, or simply to acquire a trophy. (This appears to have been Disney's view of hunting.) But what's wrong with eating them? (\"Venison -- it's Bambilicious!\") To object to killing wildlife for food (especially in areas where predators have been decimated to protect ranching), while eating pork or beef, is hypocrisy.\"Bambi\"'s cutesy anthropomorphism remains reasonably controlled until Spring (rutting season) arrives. The film degenerates into icky sexual innuendo, with the birdies billing and cooing in a sickening manner, the females \"coming on\" aggressively to the males (the opposite of what actually occurs), ** and mammals actually blushing over their entire bodies -- ignoring Mark Twain's famous observation. This is typical Disney -- presenting what might make the viewer uncomfortable in an inappropriately comic manner, or ignoring it altogether. It's particularly odd coming from a producer whose films traumatized children with scenes that cut to the core of their deepest fears -- in particular, the separation of a child from its mother, of which \"Bambi\" remains the prime example. Of course, it's easy to dramatize fear -- more-subtle emotions are harder to handle, and Disney often ignored them.Disney's view of Man's relationship with Nature was so distorted that he considered showing that the hunters who accidentally started the forest fire were killed by it, anticipating one of the themes of \"Deliverance\". (He was talked out of this by Morey, Pearce, and others, who felt that Man should never be shown, not even as a shadow.) In real life, Man's principal bad influences on wildlife have been the wholesale killing of predators and the destruction of habitat -- not the wanton murder of poor, innocent deer mommies. (There's a wonderful moment in \"Alaska: the Last Frontier\" when Atz Lee says to his wife \"We got Bambi -- and his mother, too!\".)Anthropomorphism notwithstanding, *** \"Bambi\" is a beautiful film with many iconic moments and characters. Visually, it represents /the/ artistic high point of Disney animation. Nothing, before or since, comes close. It is impossible not to recommend it, if only because it demonstrates how pervasive and profound Disney's influence on culture and society were -- and remain.* The wolves are implied when Bambi's mother warns him of danger on the meadow. But we later learn the danger she worries about is Man.** When Bambi fights the older stag for Faline, it comes off as if he's trying to protect her from \"molestation\".*** There's an adorable field mouse drawn in a completely realistic fashion. It shows what the animators could have done if they hadn't been restrained by the need to appeal to an unsophisticated audience.", "\"Apocalyptic Love\" is great! This is an great follow-up from Slash. A terrific rock album. All (13) tracks on here are great.Track Listing1. Apocalyptic Love (4 out of 4)2. One Last Thrill (4 out of 4)3. Standing in the Sun (4 out of 4)4. You're a Lie (4 out of 4)5. No More Heroes (4 out of 4)6. Halo (4 out of 4)7. We Will Roam (4 out of 4)8. Anastasia (4 out of 4)9. Not for Me (4 out of 4)10. Bad Rain (4 out of 4)11. Hard & Fast (4 out of 4)12. Far and Away (4 out of 4)13. Shots Fired (4 out of 4)"], "review_4": ["Multi-tasking made for TV movie successfully stirs drama, horror, parody, and truly disgusting racial slurs, into a wonderland of insightful entertainment. The post-war Japanese are sure \"warm\", have \"rosey red lips\", and \"glowing\" personalities. (I laughed so god damn hard!)So to the chase: The Three Stooges combine with Angela Davis and Chrissy Snow in a strange attempt to blackmail the.....well everyone I geuss. They decorate a garbage can with christmas lights, try to hide it on a tug boat, swear up and down it's a nuclear bomb, and threaten to pull the string should thier demands not be met. One wants a blood test, one wants a pizza, and one wants a car, one wants an apology, and they all wanna-be on TV. Professor McKeeson (mad Professor) is crazy with anger that TV people wear wigs and use fake names. He hallucinates and thinks he hears TV people making fun of him. Another talks to the world via a reporter and camera dude they had kidnapped earlier. He's a mad scientist too.  Then there's the Veteran who laughs every time he shoots someone who gets too close. The Black lady recites original poems that address such topics as \"all men are like one man\", and the best way to \"mourn for them\". The Social Worker confesses to the FBI she had sex outside of marriage. Given these outrages, the viewers comes to accept that the world should in fact be destroyed. RIGHT NOW TOO! SEX? POETRY? PIZZA? Where did humanity go wrong?The FBI finds that Nuclear material IS missing from a lab that one of the mad scientists had worked at. A closer examination of the dressed out garbage can in the hull of the ship leads the Nuclear Emergency Response Team to believe the garbage can does indeed contain fissionable material that is configured into a bomb. The President orders the evacuation of the South Carolina coastal theatre. \"Beautiful\" Charleston is at particular risk. But that counter on the garbage can is for real; and there is nothing anyone can do about it. Not even the SEALS. Science now has 90 minutes to disarm it.Not the stars, not the science, not the philosophy; not mathematics, love, or deceit; not religion, not OUIJA, Tarot, or tears ---- the horror is within us. It is within us all.", "Listened with Sennheiser 595's, the best that I have found, had 555 for a couple years they are nice too, but cant touch 595's, pay the dif and see, er I mean hear.Well I almost didn't buy this DVDI seen the VHS back some 10 years ago, and on a reg tv set up. not impressed at all, for the camera work is pretty bad with the constant changing of shots over and over all during the show ( someone please start a school for these people )the only time it didn't was Every Breath You Take, why WHY they could tell that that was a good pace of camera work as they edited it all? DumbIt was cool seeing this song fade to Black and White.Well now that I have a big sound system in the house, I decided to try this out, since I am a huge Stewart Copeland fan, and how this band one of the few bands that I messed up and didn't see live back in the day.OMG the sound on this is stunning. Stewart powers the whole show, like a drummer is supposed to, a la John Bonham ( where are any more of these drummers? I don't get it )Sting is good, plays some great bass, Roxanne, for some reason you have to go into the extras to get to it, and its one of the best versions I have ever heard. At first your like, where is Andy's guitar? As he is silent on this version, not sure why. But the bass really sticks out, Sting even puts a little extra zip on it for this version.And why is it in the extras you only see Sting? This is the same show eh? Or are we being tricked?Andy Summers seems to pretty much live on less is more style, he is so in the background all over this show.Its no secret one big problem, for whatever reason, for the breakup was not just Stings desire to play dif stuff, but he was not getting along at all with Stewart, and that can tear a band apart faster than anything. ( and you can see when Sting grabs the camera and flashes it everywhere, BUT at Stewart ) just a little hint their.I am sure it had something to do with Sting had gotten so big and Andy and Stewart were getting no attention. I don't think Andy minded it, he is low key kinda guy. But having now watched Stewart, even some 20 years later, play in concert, and can now see what I always thought, that he is one heck of a drummer, well egos clashed. And many do and break apart bands, that's just the sad state of the human condition. Not to get deep here. But history is pretty clear on this. Guns and Roses is another. They could of been as big as Led Zep. Robert knew Page was the man, and so did Bonham, a rare mix of huge talent that worked, till death.And is it weird, that we have such a shortage of highly skilled drummers, and Stewart went pretty much nowhere after that, Oysterhead is a great CD, but they flashed out after one cd, egos again? I don't know about that one, what I do know is when Oysterhead played that one small tour, they sold out in a flash and when I went to the nor cal show people were getting HUGE mark ups for tickets out front.Never have seen that at a Les Claypool show or a Trey solo show. Phish is no more.So what the heck else are they doing? NOTHING. So why don't they all get together and play a tour for 06?  07 ?! Egos it must be!Sting has gone onto popular solo tour, why? yea he sings good, play good bass, but thats only half of it, or less than half, music stardom is mostly about looks, and all the Sheilas love Sting.  no can argue that his solo work is better than what the police did.  no way no how.  but he knew he would make it solo even before he went solo, for Sting knew all the ladies loved Sting.See the interviews in the extras section, man you can just feel all the pride and arrogance of each of them as they were talking, we are BIG!  They couldn't even act humble and low key.money begats fame begats egos, plus ad youth to it all, oh man I prob would of been the same way hahahathe only reason I didn't give this 5 stars was the really lame camera shots back and forth all the time, and putting in the dorky kids going OMG a camera is on me!!!  just totally breaks up the vibe and pace of the show, just flat dumb on the editors, not ignorant, dumb.  almost gave it 3 stars just for this but the music is just to good for live, one of the best live shows soundwise recorded.  Its up there with the Led Zep DVD set of 03 and Roger Waters In The Flesh DVD/CD of 2000.  only those got 5 stars for all around music and camera work.One of my fav thing to do from time to time is watch tv with the closed captioned on, use my $150 headphones to listen to music, radio or CD or concert DVD, maybe flip it onto the dvd from time to time during a commercial or a killer spot on the dvd when its a jam part, this dvd will be on the list for years to come for its great sound.My Police story from the 80's, was a party, everyone was getting drunk, and bands came up as conversation, when the Police came up, it went something like thisStingStewart Summers?StingAndy Copeland?Stingno Stewart Copeland and Andy Summers!NO its Stewart Summers and Andy Copeland!over and over it went for awhileah, the 80's and youth and booze.A good example of concert producing and camera work is the Led Zeppelin DVD set released in 03 and pick and Austin City Limits concerts on PBS.  why is this so complicated to learn?  one would think a monkey could do this right.", "i broke this DVD in with my 2 month-old child. need i say more?", "David Bowie is a myth. A myth in the cinema and in music. He systematically played on sexual roles and he tried to look like a woman and yet be a man. This concert in Hammersmith in London shows this choice rather well in the way he dresses, he has his face made-up and he behaves on stage. The backstage scenes are not really interesting and the sequences on the audience are plainly uninteresting. The latter concentrates on girls and women as if David Bowie was a model to them : their makeup, their dresses, their hair and head-dresses, etc. But their behavior is banal and even very standard for many concerts of this type, without any frenzy. There remains the music. It is rock and roll from an older period, the seventies and the eighties. It is very rhythmic, very melodious and even at times mesmerizing, but it does not have any of the power and even violence we have become used to since then. In one word it is very moderate, though definitely charming in the melodious and harmonic arrangements. Yet the remastering must have changed a few things because I seem to remember that music as being more aggressive and more feeling-raking. David Bowie acting on the stage is rather simple though effective : he shows his shaved legs in an enticing way but we do regret the lack or loss of the hermaphrodite and ambiguous signals and messages of old. David Bowie must have aged and he has followed the politically-correct evolution of the stage. In other words, in this gay-proud period of ours, he seems to wish not to show anything that could push him into that gay territory. He did not hesitate when it was by far nor recommended but now he seems to establish a distance between this new era and him, hence the emphasis on girls and women in the audience and on girls and women in the bachstage scenes. The myth has suffered with time because it has been edited and even rewritten. So, close your eyes and dream : when he sings of his love for an unnamed  you  we can reconstruct the vision of old and the impression we experienced then : he is talking to any  you , female or male. But the visual show does not indeed. And the extras of the DVD are far ftrom being an enlarging approach of the character : we would have liked some more materials about his films and about his performance as a musician. But none of these here.Dr Jacques COULARDEAU"], "product_4": ["6301650662", "6301248171", "1573300497", "6302482402"], "product_1": ["157330056X", "1929243154", "6302910129", "7799623519"], "score_3": [0.041666666666666664, 0.043478260869565216, 0.047619047619047616, 0.0625], "product_3": ["6302415993", "1858705231", "6303058760", "0769720382"]}]