[{"score_1": [0.02564102564102564, 0.03225806451612903, 0.03225806451612903, 0.038461538461538464], "score_2": [0.043478260869565216, 0.0625, 0.06666666666666667, 0.07142857142857142], "product_2": ["B00DCF7QW0", "B004LUZ956", "9790794231", "B001KYNW2I"], "score_4": [0.037037037037037035, 0.09090909090909091, 0.1, 0.1], "score_5": [0.05555555555555555, 0.06666666666666667, 0.09090909090909091, 0.1], "review_1": ["well I never actually  got a chance to use this toner. I did try a different toner from hazel that worked miracles on my skin. I would diffidently recommend hazel toners to friends and anyone who wants to have better looking skin.", "RIPOFF!!!  NOT CASTILE SOAP.  CASTILE SOAP WAS INVENTED IN MEDITERRANEAN COUNTRIES AND IS VEGETABLE OIL BASED.[...][...]This stuff is watery URINE.", "I had to UPDATE this product. There's no way Id recommend this product! I mixed it and added some tea tree oil...something came up, so I put i put it in a lil plastic container. I also put it. in the fridge outside. Anyway next day I come back thinking Ill now do my facial. WTF?!! My fridge stinks like tea tree. God awful scent gamey and green like a ole hippie worse part...that s*** made a HOLE in my thin ass plastic contstainer!!! Do you really think I'm putting it on my face? Hell no, Into the trash.", "I did not read the product description and therefore it is not something I will use often my dog does not like it"], "product_5": ["B002IRIGZO", "B003WNXZZO", "B00HM6IXH2", "B00121TESA"], "review_3": ["I haven't been using these long enough to know if they really work or not, but I'm willing to give them a try.  I've heard and read that they do work.", "I have heard good things about this product. Since I have only been taking it a few days I can't say it works for thinning hair yet. But I can say it arrived on time as promised.I would like to do another review later to updated you.", "like the subject said...  it is what it is... but i should add that i like the white look of it... kinda stand out in my collect of bottles of oils...", "I didn't really see difference after using the almost whole bottle.I can't really say I can recommend it.  But who knows if it will work for you."], "review_2": ["This is a small jar in my opinion for 30.00.  It has a really strong smell.  You cannot go anywhere or be anround anyone for at least half andhour till the smell goes away.  If you are using it on your legs it does not go far.  I would not purchase again due to the cost and smell.  May work for you if you can handle those two things.  I personally cant stand the smell.", "The product is good..I just have not learned to use it to well.  I should read the directions a little better", "I am not a perfume wearer, but I heard that this is very light and unlike any other perfume. I got this in the roll-on and I don't care for it at all. Just like all other perfumes, it makes me nauseated. I'll be giving this to a relative for Christmas.", "Wish you reviewers were more explicit regarding the application of these cream eyeshadows.  I purchased four (4) sets, different colors on you reviews and I'll be dipped they look awful.  I puchased MAC 217,219 expensive brushes and also made sure I had smudging, blending, crease and everything you can imagine. Even purchased a brush holder kit.This is my third short at applying these creams and I am on my way to Church and I keep looking in the mirror thinking to self, (should I go)?  Tell ya one thing it doesn't look like the videos on the internet when you watch them applying cream eyeshadows.  So having an assortment of technical brushes isn't the answer.  Could it be talent? Perhaps loads of talent and practice?The young ladies that host the videos on applying cream makeup to get the effect of 'cat eyes' and 'smokey eyes' are all of AGE 18 to 25 tops.  How much practice have these kiddos had in comparison to me with a son in college.  Chuckling to self..........THAT'S ALL F O L K S  !!!!!!"], "review_5": ["i got this for my niece.  she is now the dating age and plays sports in high school. she loves it. her mom wasn't too happy with me but i don't care.  in this day you can't be to careful. it does look like lipstick.  it's easy and practical for her to carry.", "I couldn't wait to open it up, it was a bubble wrapped and came in an amazon box. The product itself sits in a glass bottle and to me only great products come in glass bottle. I sprayed a little on my neck, the smell wasn't that impressive and since I just used it once I don't know how well it'll work yet. I just thought Id mention about the glass container.", "I received this today and half of the product was spilled out in the packaging. Amazon definitely needs to find a better way to ship items such as this. It does smell unbelievably great, though, and I will update this review once I have used it a couple of times.Update: This shampoo is super great. Lathers like crazy, smells amazing. And I love the volume it adds to my basically flat, fine hair. It really is a very nice shampoo. As other reviewers said, it is quite a different texture from other shampoos - thick and gel-like. So you don't need a lot. It lathers like crazy and rinses well, and I just cant recommend it enough for a person with fine, thin, flat hair.", "It cleans well and is gentle! My husband just hates it because it looks like cum... he doesn't use it."], "review_4": ["Haven't had a chance to try this yet, still a little scared .... but as for everything else, I can't complain. Packaged nicely, with what seems to be very good instructions.", "It has now been three weeks of use today.  Very hydrating and is what they have advertised for this product.  I am very satisfied.", "I got a female head instead of a male head so it was patently offensive to have my wig on this while company was in my Passenger room on a Russian Tanker. Material is cheap grade foam. As a side note, this is very buoyant if the ship capsizes.", "Glad they lowered the price.....Sea Buckthorn Seed Oil......the new big thing will see if it's as good as they say....I write more in another review!~"], "product_4": ["B003SJ0FSW", "B0090UJFYI", "B001BAN0FK", "B003IU9HI0"], "product_1": ["B000GCQ04C", "B000X2FPXC", "B000ZMBSPE", "B001JHZ8H8"], "score_3": [0.029411764705882353, 0.06666666666666667, 0.06666666666666667, 0.06896551724137931], "product_3": ["B0032ZQJ1E", "B000BY2N7S", "B003MJG19K", "B0047PPCAW"]}]