[{"score_1": [0.038461538461538464, 0.05263157894736842, 0.06666666666666667, 0.08163265306122448], "score_2": [0.03125, 0.1, 0.1111111111111111, 0.14285714285714285], "product_2": ["B0000223VR", "B0000223L2", "B0000223VR", "B00002N7S0"], "score_4": [0.2, 0.2222222222222222, 0.25, 0.2727272727272727], "score_5": [0.09090909090909091, 0.09090909090909091, 0.13333333333333333, 0.14285714285714285], "review_1": ["my dust collection main tubing is 4\" with a 5\" hose connecting the 4\" tube to the 6\" dust collector inlet through reducers i reviewed before but i did not want those big diameter hoses connected to my machines so i decided to buy many of these 4\" to 2-1/2\" reducers so i could use my machines more easily. a must.", "When the UPS man delivered my saw, I asked him why the box had been opened.  The staples holding the box together were popped, and he had taped the box shut. When I unpacked the saw, I saw that the rear handle that locks the slide  was smashed, and the saw was unusable.  I have sent for a replacement.", "These mitts always slip off my ladder.  I had to buy a different brand that work much better.  These were a waste of money.", "I looked at this router and bought a Makita.  The Hitachi is made in Malasyia, and looked cheap compared with the Makita, which is made in the USA.  I have hade such poor luck with other tools (a Bosch drill) made in Malasyia, that I could not see getting it.  If you think you are saving $40 getting the Hitachi, you are right, and you are also getting a router worth $40 less than a Makita."], "product_5": ["B00002231F", "B0000302Z3", "B000022473", "B00002N7UF"], "review_3": ["It helps to have the support for longer pieces, but it sags a little bit.I have NO IDEA what the notches are for, except to get trimmings hung up in it and in your way. But hey, it's Chinese, so if it didn't cause us to take more time than necessary, well, they haven't accomplished anything while making commie products for \"the enemy\".", "DeWalt is Black and Decker. Don't let the yellow fool you. Lower middle-of-the-road quality for all their stuff, in my opinion. Go Makita!", "Nice product idea but hard to use.You must use with 5mm pencil.Rule is tippy and hard to control - so hard to get a straight line.For the money there are better options", "This is a nice tool but honestly do not think it is worth MORE THAN 10 bucks.  Even at 10 inches, the shank is really small for my large hands.  Made in China like most everything, I think you could go to Home Depot and get one at almost twice the size for about the 16-17 range.  The small size and cost factor gives this a 3 Star only. I was mildly  disappointed."], "review_2": ["I used this blade for cutting pine but It did not impressed me at all. I found my Freud industrial blade ( combination ) giving more clean cuts on pine.I guess most of the reviews were for cutting pine, but most woodworkers don't use pine as it is weak / soft wood.After using this blade for one project with pine and Redwood, I did not felt the price was worth it. Nothing impressive at all..Save your money and get Freud combination at less than half the price or go for Oldham combination blade.", "I've waited about six months before I wrote this review and I've put the saw through some work.  The adage \"you get what pay for\" is remarkably true for this product.  I purchased this at when Hitachi had a special for under three hundred.  I also got a router.  At the time I thought it was a good deal.  Now I realize this will not be my final shop mitre saw.  That says alot doesn't it.The problem-this saw cannot cut a 4x4 without flipping.  Without modification this saw cannot cut a 4x4 at all.  In order to cut a 4x4 I had to permanantly take off the blade guard and bend the blade guard holder back(it is held to the body of the saw by a small easily stripped phillips screw.  If this saw could cut a 4x4 in one pass I would give it five stars because in others respects it really is solid.", "I purchased this blade about 12 months back and was thrilled with it for about one month.  It cut through maple and cherry (up to 2\" thick) \"like butter.\"  And then it was dull and prone to all the trials and tribulations of dull blades (kick-back, etc.).  When it was brand new it cut better than any blade I have owned but at the price it should!  At the price, it should also have retained its edge for a lot longer (I've had really cheap (Skil 10\") and mid-priced (Hitachi, et al) blades last MUCH longer and some even started off almost as sharp).Again, for one month of 6 day a week use it was GREAT but it dulled much too quickly - regardless of the price (and yes, I did clean and treat the blade at the end of each day).  So, whyh pay the price unless it comes with free sharpening and a loner blade for the time it spends \"away\" every four or five weeks.If the blade cost $50.00 I would rate it 3 to 3.5 stars.", "The bottom part is what I wrote thinking and looking at the photo Just knowing that I was getting what has been Weller's mainstay for 50 years.LIE LIE LIE LIKE A RUG!  Which is another way to say a \"BEAR FACED LIE\" Or LAY as in getting hmmmmmm I can not say that word on hear as this is not TV. Nothing about this pistol style soldering gun reflects the older ones. Normally it is new and improved right? Not in this case. Speaking of CASE that is the only new part that is worth a dang, Blow molded cases are really nice, Too bad the handle piece of the gun isnt at least made of that grade of plastic. I would have settled for the old handle rather than the new style which is ba terrible grade of reused recycled caca. The posts that hold the copper tip they screwed up with as well. Come one set screws for a joint that has constant heat and cool cycle. The old style with the nuts over the tip metal worked just fine. If it ain't broke you do not have to go out and break it dummy. WHAT YOU CAN'T even get the product labels on straight. Hey there us a sot cast into the handle for them to fit inside the handle.I hope to find a way to take photos and show how bad this stuff is.Tell you what Weller send me the old style Handle you can send the lables with the backing on them I can at least get them put on straight. Send me new posts that have the nuts that screw onto and hold the tip to them. also a new tip with the nuts to hold them on. The proper type of trigger switch that lets the light dim when you do the one stage two stage type. that has a focus lens in the bulb/ I have not wanted to take it apart to see how bad it is in side so let us leave it at that OK Weller Or at least send me the parts list for the old style guns so I can build one from scratch. If you do that I can find a few illegal aliens  to start assembling them I could sell them much fast than you can The word will get out in a heart beat,dray\"\"\"\"\"My Mom got me one of these so I could solder some little things I needed to solder together. Hey we lived out a ways and she got them with S&H; Green Stamps. Yes I did learn to solder much better with other types later on still Every time I see one I think back to then. Back in the 70's I taught soldering classes at both Litton Ind and JPL in LA. One of my demo's was to show folks how to write their name with 22ga rosin multi core solder using one of these guns on low power and with a special home made tip I built out of solid copper wire.To this day they still make these guns the same as they always have and I hope they always will. It is funny these guns cost $26 back then,,,, Let us say almost 50 years ago. and the still cost the same to this day. Course minimum wage was only 90 cents an hour back then. Hey I drove a tractor and got a dollar an hour plus room and board in the bunk house. After dinner we would get together some of us and walk the three miles to the general store use the pay phone their. A local call cost a dime. Or spit on a penny and slide it just right and you got back fifteen cents change. Opps is their a statue of limitations on that I hope. I never call out of state.dray"], "review_5": ["I just took delivery of this saw and matching stand, and I am really impressed with the quality of the product...", "Great proce, product and delivery", "With the Milwaukee Rip Fence Kit all is in one.", "but I have found that if you lay it flat on a surface, the small air bubble will give an accurate feel for the \"levelness\" of the surface. Since this tool also has vials oriented in the opposite direction, you can also use it to determine if surface is plumb. Works well for both tasks, and at a great price. I bet people used something like this before there were lasers."], "review_4": ["This post is not to insult anyone's woodworking skills just sharing my experience with this blade.I bought this blade thinking I could mount it on my saw and forget about, mistake. This Blade works great  as a combination saw blade on soft (pine)   stock;  but don't be fooled into thinking that you can mount it in your saw and forget about. The blade's full width kerf and number of teeth will cause your saw to bog down the first time you try to rip a piece of 4x4 hardwood stock. Especially if you are using it in an underpowered table top saw.I think the blade's thickness is the killer.  Just something this weekend sawdust manufacture ran into.", "Let's say that this nailer works very well as everyone states. I say that my Porter Cable grip has a far better feel and will last ten times longer than the cheap foam/rubber grip that is glued around the handle of this SFN40.So why did they skip the deflection on the exhaust on this top rated nailer?  I may be able to deflect it, but it appears that I have to take four allen screws out of it to turn the deflector.  Porter Cable has the right idea when they made theirs 360 degree rotatable on the fly. Then ask Senco why they skipped the air inlet connector that Porter has supplied and mounted on their product. Then they skipped over supplying the Allen keys to take the thing apart, not so for Porter Cable. Port Cable also supplied some nails with the gun, and in a better designed case. I'm not telling anyone to buy the Porter Cable finish nailer, but I am telling Senco to shape up. I do appreciate that the Senco SFN40 works well, but first impression was that I should have bought another Porter Cable. Anyone that complains about oil getting on their work is using too much of it. I never get a drop of oil anywhere but in the gun.", "good long reach but really five stars mean Love It - I think not - amazon needs to come up with something otoher than Love It", "as far as funtion this this is great.very acurate tenons and easy to adjust, but...Delta please stop making plastic knobs and handlesi buy a tool and expect it to last for a very long time and plastic is not allways the best for knobs.allthough i havent broke any of them yet."], "product_4": ["B0000225V8", "B0000225KV", "B00004SQHN", "B00004TD3O"], "product_1": ["B0000223YJ", "B00004R9M0", "B00004RKCU", "B0000223K9"], "score_3": [0.09090909090909091, 0.09375, 0.1111111111111111, 0.125], "product_3": ["B00004R5S0", "B0000224X2", "B00004TRBX", "B0000224TY"]}]