[

  {
    "productIDS": [
      "B00004Y2UT",
      "B00004Y2UT",
      "B00004Y2UT",
      "B00005ML71",
      "B000068NSX"
    ],
    "topReviews": [
      "I now use this cable to run from the output of my pedal chain to the input of my Fender Amp. After I bought Monster Cable to hook up my pedal board I thought I would try another one and update my guitar. I had been using a high end Planet Waves cable that I bought in the 1980's... Once I found out the input jacks on the new Monster cable didn't fit into the Fender Strat jack I was a little disappointed... I didn't return it and as stated I use it for the output on the pedal board. Save your money... I went back to my Planet Waves Cable...I payed $30.00 back in the eighties for the Planet Waves which now comes in at around $50.00. What I'm getting at is you get what you pay for. I thought Waves was a lot of money back in the day...but I haven't bought a guitar cable since this one...20 plus years and still working...Planet Waves wins.",
      "Monster makes the best cables and a lifetime warranty doesnt hurt either. This isnt their top of the line series but it works great with my bass guitar rig and has for some time. You cant go wrong with Monster Cables.",
      "Monster makes a wide array of cables, including some that are very high end. I initially purchased a pair ofMonster Rock Instrument Cable - 21 Feet - Angled to Straight 1/4-Inch plugto use with my keyboards, but when it came time to purchase cables for my bass and guitar I thought I'd pinch a few pennies.  I am so glad I did.I compared this cable model to the more expensive models I previously purchased and, aside from looks, could not detect any difference in sound. I Swapped back and forth between my guitars and keyboards, ensuring that each model was used on each instrument - still no difference.What the more expensive model has going for it is looks. I am not sure it (the higher priced model) is even more sturdy because the molded stress relief ends on this model seem to make it more reliable than its pricier sibling.Bottom line: carefully compare both cables using your own instrument and amp - if possible - before making a purchase decision. You may find, as I did, that higher price does not necessarily equal higher value, even from the same manufacturer.",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "I've been using these cables for more than 4 months and they are holding up pretty well.  For years I used seemingly indestructable guitar cables that were made for me by an electrician friend.  When they finally gave out, I got in the habit of using the no-name cables that are always on display near the register at Guitar Center- really more of an impulse buy than something I put any thought into.  After the third or fourth Guitar Center cable failed from light use I decided to try these cables.  Not only are they cheaper but they seem to be holding up better.  I am not terribly hard on my gear but my cables tend to get twisted as I move around and the cheaper ones  eventually fail mid-cable.  I don't mind spending a few extra dollars if the cable is a little more durable.  This cable is actually cheaper- $12 or so shipped- and it's holding up pretty well.  These are actually very reasonably priced for 18' cables.  There is some kind of limited life warantee on this product but I haven't needed it.  Five stars for a nicely made 18 foot guitar cable that costs $12 shipped!Incidentally- these cables are shielded and are meant to connect your instrument to your amp's input.  Do not use these to connect an amplifier to a speaker cab.  You want to use unshielded cables for that purpose.Edit-  More than 6 months has passed and this cable is functioning without any issues.  The price on these things has gone up significantly and although the cable is highly recommended, there are probably better values from Hosa, Monster or Planet Waves-"
    ],
    "frequency": 355,
    "word": "guitar",
	"rating" : [3.0,4.0,3.0,3.0,4.0],
    "sentiment": 0.19193638729118068
  },
  {
    "productIDS": [
      "1384719342",
      "1384719342",
      "B00005ML71",
      "B000068NSX",
      "B000068NTU"
    ],
    "topReviews": [
      "The product does exactly as it should and is quite affordable.I did not realized it was double screened until it arrived, so it was even better than I had expected.As an added bonus, one of the screens carries a small hint of the smell of an old grape candy I used to buy, so for reminiscent's sake, I cannot stop putting the pop filter next to my nose and smelling it after recording. :DIf you needed a pop filter, this will work just as well as the expensive ones, and it may even come with a pleasing aroma like mine did!Buy this product! :]",
      "This pop filter is great. It looks and performs like a studio filter. If you're recording vocals this will eliminate the pops that gets recorded when you sing.",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "Fender cords look great and work just as well. By adding the word California to the description I'm sure to sound like the Beach Boys...",
      "The ends of the midi cable look and feel like quality. Connection is secure, no worries about uneven connections, it also detaches without a hitch. Highly recommended."
    ],
    "frequency": 331,
    "word": "like",
	"rating" : [5.0,4.0,3.0,5.0,4.0],
    "sentiment": 0.47390504407794857
  },
  {
    "productIDS": [
      "B00004Y2UT",
      "B00004Y2UT",
      "B00005ML71",
      "B00005ML71",
      "B000068NSX"
    ],
    "topReviews": [
      "So good that I bought another one.  Love the heavy cord and gold connectors.  Bass sounds great.  I just learned last night how to coil them up.  I guess I should read instructions more carefully.  But no harm done, still works great!",
      "I have used monster cables for years, and with good reason. The lifetime warranty is worth the price alone. Simple fact: cables break, but getting to replace them at no cost is where it's at.",
      "I got it to have it if I needed it. I have found that i don't really need it that often and rarely use it. If I was really good I can see the need. But this is a keyboard not an organ.",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "This is a cool looking cheap cable which works well. I bent one of the connectors pretty badly but that was my fault. One thing to consider with the cable is to tighten the connectors once in awhile. You'll be able to hear them rattle. It seems that the 'retro' look is screw on connectors over some black rubber, but other than that, the cable looks cool and works well.I also have the shorter red cable which goes with one of my guitars perfectly. I bought theses to use while practicing with others who use black cables. It's easier to plug into different amps without cutting someone out by accident. The green cable is good for that."
    ],
    "frequency": 310,
    "word": "good",
	"rating" : [5.0,4.0,3.0,3.0,4.0],
    "sentiment": 0.34891476533107587
  },
  {
    "productIDS": [
      "B000068NSX",
      "B000068NTU",
      "B000068NVI",
      "B000068NW5",
      "B000068NW5"
    ],
    "topReviews": [
      "Fender cords look great and work just as well. By adding the word California to the description I'm sure to sound like the Beach Boys...",
      "When I was searching for MIDI cables for my ART X-15 foot controller, I came across these Hosa ones, and they were $2 dollars each! As they are now $6, I realize I would still be happy with that price as well, as they are high quality plastic and metal connectors, and work flawlessly. You must realize that they are only 5 feet, as I overestimated it and now wish they were longer. For any connection from racked sound modules, this will be perfect.",
      "I bought this cord after returning a cheap one that I should've known better than to buy. My son, who has some experience as a musician recommended the Hosa brand when I was seeking a proper replacement.I bought it for a small home recording setup which includes a Behringer C-1 Condenser Microphone and a Behringer Xenyx 302 Mixer, and both ends make a reliable connection to both the board and the mic; the sound quality is excellent.An excellent value for the money.",
      "I bought this because I wanted a cheap replacement cable for one that had a short. I'm pleasantly surprised with this cable. It's decent sound and decent build quality, for a good price.",
      "Hosa guitar cables work great. Never had any problems with them. I own several of different lengths and they all sound perfect."
    ],
    "frequency": 251,
    "word": "sound",
	"rating" : [5.0,4.0,3.0,5.0,4.0],
    "sentiment": 0.22580791976925485
  },
  {
    "productIDS": [
      "B0002CZSJO",
      "B0002CZSJO",
      "B0002CZSJY",
      "B0002CZSJY",
      "B0002CZSJY"
    ],
    "topReviews": [
      "It is exactly what you need in a capo! You can cover all six strings, move one string over to get a drop d tuning or turn the capo upside down to get a partial capo (though a bit of adjusting may be needed to get the strings held down.).All in all, a great capo that is well made and will last forever.Kyser is an awesome small Christian company and I really like their products and supporting them with my purchases. :]",
      "It is very well made, is easy to use, and holds down the strings just fine.  It is well protected as to not scratch or nick your guitar.",
      "I don't believe there is such a thing as a perfect capo, but this one is quite good.  For those with reasonably strong hands it is pretty easy to use.  It does a very good job of compressing the strings to the frets and is definitely well built.  It is as with all capos,  important to take it off when not in use so the \"rubber\" does not get grooved.  This is just good common sense.  If this lasts a couple of years I will definitely purchase another.",
      "I have used a few different capo's this is far and away my favorite. Very easy to take it off, holds the strings tight. What more can you ask for? Does what it sets out to do and its inexpensive.",
      "It's a capo... nice fit... yet, sometimes I wonder if it fits too tightly, as when I use it, and of course the strings are tighter, sometimes I feel that playing with this particular capo makes my strings too tight...yet, it is a capo, structured very well."
    ],
    "frequency": 212,
    "word": "strings",
	"rating" : [5.0,4.0,3.0,5.0,4.0],
    "sentiment": 0.1806116022790292
  },
  {
    "productIDS": [
      "B00004Y2UT",
      "B00005ML71",
      "B00005ML71",
      "B000068O3X",
      "B000068O3X"
    ],
    "topReviews": [
      "I now use this cable to run from the output of my pedal chain to the input of my Fender Amp. After I bought Monster Cable to hook up my pedal board I thought I would try another one and update my guitar. I had been using a high end Planet Waves cable that I bought in the 1980's... Once I found out the input jacks on the new Monster cable didn't fit into the Fender Strat jack I was a little disappointed... I didn't return it and as stated I use it for the output on the pedal board. Save your money... I went back to my Planet Waves Cable...I payed $30.00 back in the eighties for the Planet Waves which now comes in at around $50.00. What I'm getting at is you get what you pay for. I thought Waves was a lot of money back in the day...but I haven't bought a guitar cable since this one...20 plus years and still working...Planet Waves wins.",
      "If you are not use to using a large sustaining pedal while playing the piano, it may appear little awkward.",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "These little patch cables work nicely, there's no change to your tone or sound and they connect one pedal to another just fine..I'm only going to make one small complaint and explain why it got 4 stars instead of 5. The product description says 6 inches, right? If you jump over to these (http://www.amazon.com/gp/product/B001PGXKC8/ref=oh_details_o04_s00_i02?ie=UTF8&psc;=1) planet waves patch cables they're listed at .5 feet (same as 6 inches, right?) The Hosa cables seem more like maybe 4 inches, whereas the planet waves cables gave me plenty of room from one pedal to another. I only used the Hosa cable as an emergency back up.To conclude, would I recommend these? Yes, if you have one or two pedals and need an affordable small and effective patch cable, go for these. But my first recommendation will always be planet waves cables over anything else.",
      "These are great cables. The only con I could give is if they go bad...no opening up the ends to fix them, but in my experience they are durable. Most people are using these on a pedal board so there's not a lot of movement to wear them down."
    ],
    "frequency": 200,
    "word": "pedal",
	"rating" : [5.0,4.0,3.0,5.0,4.0],
    "sentiment": 0.20890215126829417
  },
  {
    "productIDS": [
      "1384719342",
      "B00004Y2UT",
      "B00004Y2UT",
      "B00005ML71",
      "B000068NSX"
    ],
    "topReviews": [
      "The product does exactly as it should and is quite affordable.I did not realized it was double screened until it arrived, so it was even better than I had expected.As an added bonus, one of the screens carries a small hint of the smell of an old grape candy I used to buy, so for reminiscent's sake, I cannot stop putting the pop filter next to my nose and smelling it after recording. :DIf you needed a pop filter, this will work just as well as the expensive ones, and it may even come with a pleasing aroma like mine did!Buy this product! :]",
      "I have used monster cables for years, and with good reason. The lifetime warranty is worth the price alone. Simple fact: cables break, but getting to replace them at no cost is where it's at.",
      "Monster makes a wide array of cables, including some that are very high end. I initially purchased a pair ofMonster Rock Instrument Cable - 21 Feet - Angled to Straight 1/4-Inch plugto use with my keyboards, but when it came time to purchase cables for my bass and guitar I thought I'd pinch a few pennies.  I am so glad I did.I compared this cable model to the more expensive models I previously purchased and, aside from looks, could not detect any difference in sound. I Swapped back and forth between my guitars and keyboards, ensuring that each model was used on each instrument - still no difference.What the more expensive model has going for it is looks. I am not sure it (the higher priced model) is even more sturdy because the molded stress relief ends on this model seem to make it more reliable than its pricier sibling.Bottom line: carefully compare both cables using your own instrument and amp - if possible - before making a purchase decision. You may find, as I did, that higher price does not necessarily equal higher value, even from the same manufacturer.",
      "I love it, I used this for my Yamaha ypt-230 and it works great, I would recommend it to anyone",
      "I've been using these cables for more than 4 months and they are holding up pretty well.  For years I used seemingly indestructable guitar cables that were made for me by an electrician friend.  When they finally gave out, I got in the habit of using the no-name cables that are always on display near the register at Guitar Center- really more of an impulse buy than something I put any thought into.  After the third or fourth Guitar Center cable failed from light use I decided to try these cables.  Not only are they cheaper but they seem to be holding up better.  I am not terribly hard on my gear but my cables tend to get twisted as I move around and the cheaper ones  eventually fail mid-cable.  I don't mind spending a few extra dollars if the cable is a little more durable.  This cable is actually cheaper- $12 or so shipped- and it's holding up pretty well.  These are actually very reasonably priced for 18' cables.  There is some kind of limited life warantee on this product but I haven't needed it.  Five stars for a nicely made 18 foot guitar cable that costs $12 shipped!Incidentally- these cables are shielded and are meant to connect your instrument to your amp's input.  Do not use these to connect an amplifier to a speaker cab.  You want to use unshielded cables for that purpose.Edit-  More than 6 months has passed and this cable is functioning without any issues.  The price on these things has gone up significantly and although the cable is highly recommended, there are probably better values from Hosa, Monster or Planet Waves-"
    ],
    "frequency": 187,
    "word": "used",
	"rating" : [2.0,3.0,2.0,4.0,3.0],
    "sentiment": -0.4849508324098387
  },
  {
    "productIDS": [
      "1384719342",
      "B00005ML71",
      "B000068NSX",
      "B000068NVI",
      "B000068NW5"
    ],
    "topReviews": [
      "The product does exactly as it should and is quite affordable.I did not realized it was double screened until it arrived, so it was even better than I had expected.As an added bonus, one of the screens carries a small hint of the smell of an old grape candy I used to buy, so for reminiscent's sake, I cannot stop putting the pop filter next to my nose and smelling it after recording. :DIf you needed a pop filter, this will work just as well as the expensive ones, and it may even come with a pleasing aroma like mine did!Buy this product! :]",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "I've been using these cables for more than 4 months and they are holding up pretty well.  For years I used seemingly indestructable guitar cables that were made for me by an electrician friend.  When they finally gave out, I got in the habit of using the no-name cables that are always on display near the register at Guitar Center- really more of an impulse buy than something I put any thought into.  After the third or fourth Guitar Center cable failed from light use I decided to try these cables.  Not only are they cheaper but they seem to be holding up better.  I am not terribly hard on my gear but my cables tend to get twisted as I move around and the cheaper ones  eventually fail mid-cable.  I don't mind spending a few extra dollars if the cable is a little more durable.  This cable is actually cheaper- $12 or so shipped- and it's holding up pretty well.  These are actually very reasonably priced for 18' cables.  There is some kind of limited life warantee on this product but I haven't needed it.  Five stars for a nicely made 18 foot guitar cable that costs $12 shipped!Incidentally- these cables are shielded and are meant to connect your instrument to your amp's input.  Do not use these to connect an amplifier to a speaker cab.  You want to use unshielded cables for that purpose.Edit-  More than 6 months has passed and this cable is functioning without any issues.  The price on these things has gone up significantly and although the cable is highly recommended, there are probably better values from Hosa, Monster or Planet Waves-",
      "I bought this cord after returning a cheap one that I should've known better than to buy. My son, who has some experience as a musician recommended the Hosa brand when I was seeking a proper replacement.I bought it for a small home recording setup which includes a Behringer C-1 Condenser Microphone and a Behringer Xenyx 302 Mixer, and both ends make a reliable connection to both the board and the mic; the sound quality is excellent.An excellent value for the money.",
      "Pretty crappy cable. It works and gets the job done, but after purchasing this product and using it, I will shell out the extra bucks for better quality."
    ],
    "frequency": 137,
    "word": "better",
	"rating" : [2.0,3.0,2.0,4.0,3.0],
    "sentiment": -0.20686062331605395
  },
  {
    "productIDS": [
      "B000068NSX",
      "B000068NTU",
      "B000068NTU",
      "B000068NVI",
      "B000068NVI"
    ],
    "topReviews": [
      "This Fender cable is the perfect length for me! Sometimes I find it a bit too long but I don't mind. The build quality is great and I know that it will last. The only gripe I have with this cable is that the metal sleeve gets unscrewed way too easily, requiring me to tighten it often.Sound quality is not affected, and the color is cool, definitely try this cable out.",
      "When I was searching for MIDI cables for my ART X-15 foot controller, I came across these Hosa ones, and they were $2 dollars each! As they are now $6, I realize I would still be happy with that price as well, as they are high quality plastic and metal connectors, and work flawlessly. You must realize that they are only 5 feet, as I overestimated it and now wish they were longer. For any connection from racked sound modules, this will be perfect.",
      "Cant go wrong. Great quality on a budget price  - Hosa is the go to when you need to hook things up",
      "Use it every week at gigs.  Solid, no problems with the solder joints.  A good quality cable at a very good price.",
      "I bought this cord after returning a cheap one that I should've known better than to buy. My son, who has some experience as a musician recommended the Hosa brand when I was seeking a proper replacement.I bought it for a small home recording setup which includes a Behringer C-1 Condenser Microphone and a Behringer Xenyx 302 Mixer, and both ends make a reliable connection to both the board and the mic; the sound quality is excellent.An excellent value for the money."
    ],
    "frequency": 135,
    "word": "quality",
	"rating" : [2.0,3.0,2.0,4.0,3.0],
    "sentiment": -0.21822860529282445
  },
  {
    "productIDS": [
      "B00004Y2UT",
      "B00004Y2UT",
      "B00005ML71",
      "B000068NSX",
      "B000068NTU"
    ],
    "topReviews": [
      "So good that I bought another one.  Love the heavy cord and gold connectors.  Bass sounds great.  I just learned last night how to coil them up.  I guess I should read instructions more carefully.  But no harm done, still works great!",
      "Monster makes the best cables and a lifetime warranty doesnt hurt either. This isnt their top of the line series but it works great with my bass guitar rig and has for some time. You cant go wrong with Monster Cables.",
      "I love it, I used this for my Yamaha ypt-230 and it works great, I would recommend it to anyone",
      "This is a cool looking cheap cable which works well. I bent one of the connectors pretty badly but that was my fault. One thing to consider with the cable is to tighten the connectors once in awhile. You'll be able to hear them rattle. It seems that the 'retro' look is screw on connectors over some black rubber, but other than that, the cable looks cool and works well.I also have the shorter red cable which goes with one of my guitars perfectly. I bought theses to use while practicing with others who use black cables. It's easier to plug into different amps without cutting someone out by accident. The green cable is good for that.",
      "Just trying to find a midi to midi was a task, and you have to make sure the pin config is correct.  This one is a good product and works just fine"
    ],
    "frequency": 121,
    "word": "works",
	"rating" : [2.0,3.0,2.0,4.0,3.0],
    "sentiment": -0.155382530139209
  },
  {
    "productIDS": [
      "1384719342",
      "B00004Y2UT",
      "B000068O59",
      "B00009W40D",
      "B0000AQRSR"
    ],
    "topReviews": [
      "The product does exactly as it should and is quite affordable.I did not realized it was double screened until it arrived, so it was even better than I had expected.As an added bonus, one of the screens carries a small hint of the smell of an old grape candy I used to buy, so for reminiscent's sake, I cannot stop putting the pop filter next to my nose and smelling it after recording. :DIf you needed a pop filter, this will work just as well as the expensive ones, and it may even come with a pleasing aroma like mine did!Buy this product! :]",
      "Monster makes a wide array of cables, including some that are very high end. I initially purchased a pair ofMonster Rock Instrument Cable - 21 Feet - Angled to Straight 1/4-Inch plugto use with my keyboards, but when it came time to purchase cables for my bass and guitar I thought I'd pinch a few pennies.  I am so glad I did.I compared this cable model to the more expensive models I previously purchased and, aside from looks, could not detect any difference in sound. I Swapped back and forth between my guitars and keyboards, ensuring that each model was used on each instrument - still no difference.What the more expensive model has going for it is looks. I am not sure it (the higher priced model) is even more sturdy because the molded stress relief ends on this model seem to make it more reliable than its pricier sibling.Bottom line: carefully compare both cables using your own instrument and amp - if possible - before making a purchase decision. You may find, as I did, that higher price does not necessarily equal higher value, even from the same manufacturer.",
      "If I didn't think that purchasing these items from Amazon I wouldn't do it, plus and more important I have worked as a Purchasing Coordinator for over 25 years now I know how to save money and if purchasing that are great and believe me or not I can find even cables that I can't find in RadioShack, Best Buys no where else, I have done a lot of Purchasing not just for myself, but for business. These Ladies and Gentlemen know what they are doing and they know how to take care of business in the right way, I would like to apply for a position with them.Regards,ffsalsa",
      "As a freelancer, I occasionally work with a band that plays the Midwest, performing on a near-weekly basis.  These are seasoned veterans who have no interest in gear per se and even less interest in brand cachet.  It's all about money to them.  I couldn't believe it when I first saw the group using these Nady mics (even lower-priced several years ago) and insisting they were as good as Shure SM-57's and 58's.  I still don't believe the quality of workmanship compares (any casual empirical test of build quality will prove as much).  But these Nady's handle the announcing, the vocals, and, when needed, the softer sounding instruments (flute, harmonica), and none has broken or quit on my watch.I'm a keyboardist, so mic power and fidelity don't affect me.  I'm only a trifle mortified when there are musicians in the audience who catch on to how cheap we are when it comes to the all-important \"gear component.\"  At the same time, my embarrassment, I confess, is not unmixed with a bit of demonic glee.  After all, who's playing--and getting paid for it?",
      "4 stars instead of 5 only because this thing won't tune your guitar or carry your amp. I use this solo, in a duo with a bass player, in a trio with drums and bass. I have a regular gig at a medium sized club that is basically one large room. I use it through a Pyle Pro self contained Pa into which I also plug my Martin GRP elec/acoustic. The sound quality is excellent. The volume seems limited only bny what the Pyle Pro will put out. I would have no hesitation using this for bigger rooms with a full band and PA. I haven't heard a hint of feedback and the on/off switch is a plus.The 36.99 price might seem to good to be true but think of the things for which we are paying less for than we used to. I bought a 32&#34; Toshiba flat screen for around 230 bucks, Think of what that would have cost even five years ago or less. The same is true of a lot of Audio Gear. A lot of companies are bringing high quality elctronics and music to the market but it's great to have a company like Shure make something so good and so affordable. They have always made a high quality product and now they have one that almost anyone can afford. I cannot recommend it strongly enough."
    ],
    "frequency": 108,
    "word": "uneven",
	"rating" : [2.0,3.0,2.0,2.0,3.0],
    "sentiment": -0.3672620259040534
  },
  
  {
    "productIDS": [
      "B00004Y2UT",
      "B00004Y2UT",
      "B00005ML71",
      "B000068NSX",
      "B000068NTU"
    ],
    "topReviews": [
      "I have used monster cables for years, and with good reason. The lifetime warranty is worth the price alone. Simple fact: cables break, but getting to replace them at no cost is where it's at.",
      "Monster makes a wide array of cables, including some that are very high end. I initially purchased a pair ofMonster Rock Instrument Cable - 21 Feet - Angled to Straight 1/4-Inch plugto use with my keyboards, but when it came time to purchase cables for my bass and guitar I thought I'd pinch a few pennies.  I am so glad I did.I compared this cable model to the more expensive models I previously purchased and, aside from looks, could not detect any difference in sound. I Swapped back and forth between my guitars and keyboards, ensuring that each model was used on each instrument - still no difference.What the more expensive model has going for it is looks. I am not sure it (the higher priced model) is even more sturdy because the molded stress relief ends on this model seem to make it more reliable than its pricier sibling.Bottom line: carefully compare both cables using your own instrument and amp - if possible - before making a purchase decision. You may find, as I did, that higher price does not necessarily equal higher value, even from the same manufacturer.",
      "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.",
      "I've been using these cables for more than 4 months and they are holding up pretty well.  For years I used seemingly indestructable guitar cables that were made for me by an electrician friend.  When they finally gave out, I got in the habit of using the no-name cables that are always on display near the register at Guitar Center- really more of an impulse buy than something I put any thought into.  After the third or fourth Guitar Center cable failed from light use I decided to try these cables.  Not only are they cheaper but they seem to be holding up better.  I am not terribly hard on my gear but my cables tend to get twisted as I move around and the cheaper ones  eventually fail mid-cable.  I don't mind spending a few extra dollars if the cable is a little more durable.  This cable is actually cheaper- $12 or so shipped- and it's holding up pretty well.  These are actually very reasonably priced for 18' cables.  There is some kind of limited life warantee on this product but I haven't needed it.  Five stars for a nicely made 18 foot guitar cable that costs $12 shipped!Incidentally- these cables are shielded and are meant to connect your instrument to your amp's input.  Do not use these to connect an amplifier to a speaker cab.  You want to use unshielded cables for that purpose.Edit-  More than 6 months has passed and this cable is functioning without any issues.  The price on these things has gone up significantly and although the cable is highly recommended, there are probably better values from Hosa, Monster or Planet Waves-",
      "When I was searching for MIDI cables for my ART X-15 foot controller, I came across these Hosa ones, and they were $2 dollars each! As they are now $6, I realize I would still be happy with that price as well, as they are high quality plastic and metal connectors, and work flawlessly. You must realize that they are only 5 feet, as I overestimated it and now wish they were longer. For any connection from racked sound modules, this will be perfect."
    ],
    "frequency": 104,
    "word": "price",
		"rating" : [2.0,3.0,2.0,4.0,3.0],
    "sentiment": 0.2326997080277411
  }
]