[{"score_1": [0.015384615384615385, 0.016129032258064516, 0.02040816326530612, 0.025], "score_2": [0.04, 0.041666666666666664, 0.05, 0.05263157894736842], "product_2": ["B00002STPG", "B00002SVG3", "B00002STXN", "B00000IODY"], "score_4": [0.09090909090909091, 0.1, 0.1111111111111111, 0.1111111111111111], "score_5": [0.07692307692307693, 0.0967741935483871, 0.10526315789473684, 0.11764705882352941], "review_1": ["There's many that love this so-called masterpiece, but the only thing I like about this boring/repetitive game is the great soundtrack. Sticking to the superior original.", "Even when it first came out I tried out this game but could not get into it and I hate the n64 old style 3d graphics where the camera angle ends up getting you killed every five seconds, espessially in pits.  Of all the Mario games to date including the amazing Wii titles except for Super Mario Wii this has to be the worst Mario game for me since Mario Nes.  The graphics are terrible, the music is annoying and it's just boaring.", "this game kinda stinks.you go talk to this old dude who gives you these long drawn out battle plans.then you watch these long drawn out cut scenes.then you go into these map/worlds.when you get near an enemy,you fight.well,sort of.the computer does everything.theres a lot of complicated planning involved.theres no clear cut way to figure out anything.its a real pain in the hiney.whats more is i dont belive i even saw any ogres.of course im only on like level 2 since the game is totaly screwed.i bought it used and the guy before me only got that far too.no wonder i got this so cheap.this game will use up all of your extra brain space.if you thought out how to beat it.you wouldnt have the brain sense left to eat cheerios.someone would have to run you an iv.youd almost have to be like freakin fixated on its ended.its totaly freakin ridiculous.and then ,as youre being slain by little people with sticks,even though youre sporting a dragon,you are helpless to defend yourself.it sucks.", "This game is so oold you can't even get the graphics!I suggets that if you didn't play this game but you all ready played ruby/sappire you will hate this game. I say wait for fire red and leaf green 2 come out it's the same thing but the graphics are alot better."], "product_5": ["B00004S99N", "B00004C8SI", "B00000J2OO", "B00002SVG7"], "review_3": ["Castlevania is a darkly digital adventure into the Gothic world of the Dracula legend.There's the ubiquitous Vampire Hunter, this one's name is \"Richter Belmont\", a 23 - year old mortal hunting the Lord of The Undead, estimated to be over 400 years old.Richter's 17-year old girlfriend, \"Maria Renard\" goes looking for him, & is, of course, captured by Count Vlad Tepes Dracula {sic}; so she ends up presenting an additional problem / obstacle for Richter.These magnificent creatures so easily beaten by inexperienced & pathetic mortals? Please.Obviously, the philosphical theme is that of the \"Good vs. Evil\" simplicity, but remember, it is just a game, after all. There are some idealistic disturbances, such as werewolves being slaughtered, & of course, there's no real choice of actually being Dracula Himself, or a demon, for that matter, but the player does get an opportunity to battle, & even kill them.Alucard, Dracula's confused & ingrate son, is an option, however, he has the same type of mentality besetting 'Nick Knight'; that is to say, unappreciative of the magnificent being he is, & the Dark Gift bestowal.'Death' {Thanatos} makes a special appearance, giving Alucard a dire warning, & ends up making off with his weapons... he he he.....After some brief scathing philosophical arguementation, in which the Dracula character makes a rather good point, the battle begins, amidst the triumphant & haunting strains of an organ.Castlevania comes off as being a 'cross' between a movie & a videogame.Castlevania contains magnificent scenery, & some pretty damned good music.One major warning: Watch out for Demons!", "I've never been able to enjoy the Final Fantasy series as much as most people.  The storyline is quite big and the turn based action is decent, but it just leaves me underwhelmed when the game is finally over.  In Final Fantasy II, the graphics aren't that great.  Even when the game was popular the graphics never looked that great, in my opinion.  I don't know, everyone loves Final Fantasy and I guess I have no choice but to recommend it to any fan of RPGs.  Just remember that better graphics have come along since the early 90's, and featuring better-looking graphics is the best direction an RPG game can take.", "What's sad is that this game seemed like a huge achievement back in '94. Maybe I was too young to realize it back then. Maybe it was lack of experience. I thought this game rocked when it first came out, and unfortunately I'm no longer sure why.To me, it seems this is a fairly average platformer wrapped up in a beautiful package. The graphics were novel and unique at the time, but I guess now I just think they're awkward and weird looking. My main beef with the game is the control and the frustrating level design. The mine cart stages and the ones where you have to fire yourself from barrel to barrel...somehow I beat this when I was 6. I can't fathom how I did that now.Another minor problem is that the bosses are all pretty easy. Four hits usually does the trick.I don't recommend re-playing this oldie. Unlike Sonic and Mario World, this one may be better left as a childhood memory.", "Ive never heard of this system. I never saw it in stores or anything. How have people heard of this???"], "review_2": ["And that's being generous. I've never played a more lifeless, dull RPG.  The dialogue comes off as if it was written by an autistic elementary schooler. I understand the sequel is supposed to be much better, but... I'm  afraid I've been scared off for good.", "Like i said i do not like RPGs and especially this one. I have it because of course its mario and im willing to try any mario. It takes so long to beat it because the RPG and it gets on ur nerves when u cant beat a boss or enemy and u have to restart and beat them. At the begining it has some cheesey video of what happend to peach. It took me forever to beat it and as soon as i did i felt much better and it did not seem as much as a dumb game. The graphics r ur ordinary snes graphics and the sound is not as good as most snes games. I dont like it because its an RPG but the only reason i keep it is because it adds to the collection and my little cousin loves to play it.", "Don't get me wrong, its an ok game, its kinda fun, at the same time I don't see why this game is so amazing. The music is suppose to be good, I thought it didn't do the SNES sound chip any justice. Gameplay is quite repetitive, I know a lot of games can be repetitive but its a repition that bores me. Your constantly locating stuff, that got boring. But I will say, if I was bored or just killing time before I go out it would be good for a few rounds to play. The story line is pretty impressive, so I guess the game deserves props in that area. The game is good in its own little ways, but I just don't rank it up there with some of the other classics. I have some friends that love this game, so I guess I respect it for what it is.", "WAY too many positive reviews for such a crappy game.  That's what I think.  Syphon Filter is atrocious.  I received this game as a Christmas present (gee, what a crappy gift) back in the late 90's.  I thought to myself \"well, all the N64 players have Goldeneye, I can compete with them when I receive Syphon Filter for my Playstation!\"  How wrong I was.It's not that the actual game is bad.  I mean, walking around shooting people is fun, and it's also fun to avoid being seen and make it to the end of the level without having to fire your weapon once (and having to remain VERY quiet while doing so).  The problem is that the difficulty is incredibly high and the storyline is about as interesting as watching the paint your baby brother smeared all over your television set dry.Without a certain special code it's REALLY hard to get *anywhere*.  The storyline is similar to one you'd see in the TV show Jag.  It's just not interesting to me.  Walking around shooting people is fun, but that's all the game has going for it.  Now imagine if that special code didn't exist where you can kill people in just one or two shots.  The difficulty would be out of this world.I also hate the game for the bad memories connected to it.  The Christmas I got the game, I had a few bad personal things happen.  But looking back, Syphon Filter really isn't any good. It's not surprising to me that the game is going for only a couple pennies right now used, and only a couple dollars to buy brand new.  It's not even worth THAT much!"], "review_5": ["OH...my...god...is she wearing any...um....UNDIES?!?!?*male friend O_o's***slaps male friend***male friend continues to O_o*", "This is a great game to buy the price is excellent also you goto a computer store and it costs 54.99 plus tax besides this is a great RPG game to get.  The object is to destory the Dark Castle before it destorys you thats it besides there are a couple of Dozen buildings that you can make  and alot of allies if i could i would give this 10 stars hope you do to.", "this was a cool game at the time but n 64 is over and soon xbox 360 will rule all consoles so get an xbox now and then get 360 not some lame playstation that will be a copy of the first xboxsony sucks big time", "yukyguo,y fktfk tk 5k tduj tdk tdj tr kjtdkdcuj xtrjjr tk r dkjrd kjrskj rkjtdyk td kytk t ykt"], "review_4": ["this game requires the eye to play it you see yourself playing in the game. thought any one who never saw the game but thought it was just another sega game should know it requires the eye to play.", "4 fathers of this game are castlevania 1, not 2, 3, 4, and legends.  \"no babies\" implies that there hansn't been a castlevania quite like it since.  straight linear levels prgressions w/ boss at end of level.  no eqipment or ability upgrades (minor item power ups think \"power up\" in altered beast) 2 playable charachters, infiite pits, boss paterns, cheap deaths, romantic atmospheres(ah greece, romania, industrial russia?)...but lacks the non-linear gameplay first spawned by dracula x pc engine (avoid snes dracula x heir equivalent)) and then enhanced by: \"symphony of alucard, circle of the useless spell books, aria of should have been titled white night concherto, and harmony of 2 castle rip off of the iverted castle induced by the grandady\".  not castle 1, played it recently very cheap hits but solid enough control.  In conclusion I have decided not to buy the new castlevania: \"lament of innocence\" due to it's devil may cry heritage.  I am glad footsteps are made away from 2d and the tried and true formulas of symphony, but I want a remake of castle 2.  I guess you will have to look there for why.  conclusion...castlevania meets smetroid=it is not...sonic versus mario=getting more linear...decap attack versus chakan=sounds like my teen spirit", "Fans of the series will tell you its worth the money it's going for but I think if you missed Suikoden II, you missed it.  Suikoden 3 is better afterall.  Even the reviewers will tell you.  I'm not saying this is a bad game, it was actualy a very good one, but it's not worth shelling out 150 dollars for.", "We all enjoyed this game and had fun.  My oldest boy lists it as one of his favorites.  The ending kept me from giving it 5 stars."], "product_4": ["B00000IZS1", "B000035XIJ", "B00001X50L", "B000035Y76"], "product_1": ["B00000DMB3", "B00000F1GM", "B00004R8WH", "B00000IYEQ"], "score_3": [0.05555555555555555, 0.06666666666666667, 0.07692307692307693, 0.09523809523809523], "product_3": ["B00001OWYW", "B000035Y09", "B00002SVFZ", "B00001OPJD"]}]