[{"score_1": [0.07692307692307693, 0.08333333333333333, 0.1111111111111111, 0.125], "score_2": [0.14285714285714285, 0.14285714285714285, 0.2, 0.25], "product_2": ["B000084F1Z", "B000260FVQ", "B0002AQKK2", "B0000AH3QT"], "score_4": [0.14285714285714285, 0.16666666666666666, 0.2, 0.25], "score_5": [0.1, 0.16666666666666666, 0.25, 0.3], "review_1": ["I got this a few weeks ago and it still isn't working. I put one cap in my tank everyday since it says one cap per 50gallons of water(i have a 55g). Still my plants aren't looking good. They are green but have brown and yellow spots and leaves. Also since iv used this my tank is very cloudy. Done with this, will try nutrafin's plant growth.", "i had smaller tanks with a small bioload.  it gave my fish finrot. in the other tank i didnt have it in there as long and the finrot isnt as bad.didnt have issues before adding purigen.i tested my water and it was fine. it seems that whatever it did to my water, there wasnt a test for it.my once beautiful fish are now raggy ;[maybe just get this stuff if you have a big bioload and a messy tank.i just wanted a filter media that i wouldnt have to keep repurchasing.this is an expensive purchase for me since i've bought the purigen and several extra bags for it.", "I ordered this thing about a month ago and STILL haven't received it. My credit card has been charged and I received a \"we're looking into it\" email several weeks ago. Basically they took my money and gave me no product. To say I'm annoyed would be the understatement of the century.", "PLEASE read the first few main ingredients before buying the product. Do not look at how fancy the wordings look but look at the actual ingredients that your cats will eat. Most of these food contain-1 - Chicken By-Product Meal -- \"dry, ground, rendered clean parts of the chicken carcass.\"2 - Whole Grain Corn -- grains = high carbs = fat.3 - Animal Fat (preserved with Mixed Tocopherols and Citric Acid) -- a tocopherol is pretty much a form of vitamin E.4 - Corn Gluten Meal -- that's a protein corn by-product; it's a little deficient in lysine, so it shouldn't be the only protein source, which it isn't. (Yes, your pet can digest it just fine).5 - Brewers Rice -- another by-product, leftovers from the milling process.Please consider Grain-fee food for your cat if you want it to live a longer life because grain-free obviously doesn't contain grains, leftover meats, and the price is almost the same as these cheap 'craps'."], "product_5": ["B000084F4N", "B0000UOFHO", "B0002AQNU4", "B0002AQNU4"], "review_3": ["I found this to be a quick fix solution, but not a replacement for water changes. I does lower nitrates,but only for a short time before they go up again. I found water changes fix the problem more efficiently than adding this product over and over again,; it's not good for the fish to use long term.", "Ok, I don't own this, but have thought about it. After discovering arm and hammer cat box deodorizer...I can live without the littemaid. I buy cheap litter because I've heard that clumping litter can be bad for kitties because they lick their paws and it can cause intestinal blockage. I keep the box, garbage bags, the litter and the deodorizer in the closet - every 3rd day or so I just dump the whole box and add new litter and the deodorizer. I do smell it right after the kitties go - but not shortly thereafter. Try this, if you are leary of buying the litter maid.  I rated it a 3 since I have no experience and it seems a lot of people hate this thing!", "These foam inserts get so gross and nasty withing one month within it being in my tank. It gets all black and muddy very quick. It says change it once every 3months but thats so wrong. If you did have it in your tank for 3 months than the water would be gross.", "OK so I didn't know this but you have to suck the water with your mouth to actually start it. Just keep that in mind, that's why I gave it 3 stars. there are no instructions included. It is good at getting gravel clean but if your tank is that small and uncycled you ddon't need gravel.  I cut the tubing shorter to make it easier to use."], "review_2": ["I didn't get what picture and ingredients showed.  So I went to Pet store to rebuy My dog's treats.  They didn't have duck potato lg size without hickory smoke either.the pet store was told the packaging would change. Picture very deceiving and Hickory Smoke flavor was NOT included in description nor size change.  So Yes I was and am kind of disapointed.  I may buy them again. I don't knowthank you Peggy W.Actually they turned out to be good. My new little chihuahua mix pup loves them and my sweet Jeffery who has passed away loved them.  review from 2 stars to 5 stars.", "I bought this filter to replace my Penguin 150, which is a 30g filter. My little Penguin worked side by side with my Emperor 280 for 3 years and he worked like a champ! When it broke I considered just leaving the Emperor 280 to work by himself, but in the end I ended up looking for another filter. I had always been interested in this particular model. I have never been disappointed by Marineland products, and from what I can tell the more expensive their product the better performance I get. At least that's what I used to think until now.One of the reasons I decided on the HOT Magnum was because of its large container for chemical filtration. My Emperor 280 has a small container and I get wonders from it. I figured that with a larger container i'd get a lot more performance. Also, the size of the filter impressed me. It took about the same width that my Penguin 150 used up, and since I couldn't fit anything larger in its hood panel I opted for this one.After having this filter for about half a year now all I can say is that I'm disappointed. Honestly, I think there's something wrong with this design. Your typical hang on top filter is based on a pretty simple concept. The water is sucked up, it falls into the reservoir, and as it falls back into the filter it has to go through a wall of filtration. This, in my opinion, provides for maximum contact between the cascading water and the filters. With this filter, however, it's different. In fact, I don't even know how it works. All I can tell is that the filter sits in the middle, the motor is at the bottom so its shooting water up, and i guess it fills the canister with water? Seriously, how does it work? I mean, there's this big black tube that goes in the middle and the water runs through it, but it has no pores or openings, so i don't even know how the \"filtered\" water gets through this tube and out of the filter. Even when I open this filter to clean it I can tell that it has very poor performance. Compared to my Emperor 280, the filter on this thing after a month is practically clean. There's a few bits of gunk trapped here and there, but nothing impressive. My Emperor 280s filter pad looks disgusting after a month. Seriously, it's like there's another 2 extra layers of thickness made up of fish gunk. Overall i'm not impressed at all with this filter. If you're looking for a HOT filter look no further than the Emperor 280. It provides both chemical, mechanical, and an automatic biowheel for biological filtration. For now, i'm going to keep this thing until dies. Thankfully I have my faithful Emperor 280 working for me.Fish stats:30g2 yoyo loaches1 bamboo shrimseveral tropicals.", "doesnt work very well at all, you are much better off with an astablished bacteria setup, spend your money on bio rings and let your tank setup.", "My dog loved the original Purina One Adult Chicken with Rice Dog Food.  However, since Purina developed the smart-blend, she won't eat it unless I add some turkey.  The tan color pieces are awful - kind of rubbery.  I went back to buying the regular Purina Chicken and Rice Mix where all the morsels are pretty much the same in size and color.  My dog really likes the older version much better.  I won't be buying the blend mixture again. Sometimes, change isn't better."], "review_5": ["I dont care what the vet said he/she also say nothing of the side affect when giving your pet shots and whenever you ask a question it should take 3 minutes to answer but they are busy and only say a few seconds worth UTI's arent cause by a food but ingredient cats NEED water but not water from a bowl cats in the wild get water from meats they eat so they dont drink much causing stress on organs especially on the bladder a kidneys so I feed cut up raw chicken breast very small every 2 days and also feed wet every other day and you MUST have a grain free food to fully stop organ and body problems such as infections pains joints anything even shedding yes shedding is controlled by food so get a good food you can afford yet your cat can live and not survive on vet only get a few hours of nutrition classes provided by Science Diet so dont ask them about brands go research and look even Newman owns is good so id evolve to name a few local store brands", "I have had this (large) waterer for 5 years.  It has been a champ!  However, yes, it does take some maintenance, like anything.  I completely disassemble it every two mouths and wash it out with vinegar, including the filter. You can use the same filter forever if you flush it with vinegar.  Restoration takes moments , and again works like a champ. What you need to know is that over two months, the filter will clog and the pump will clog, especially if you have 8 pets as I do.  Solution, pick it up, take it apart, clean every month clean with vinegar put it together again, and ta da you are back in business. All my animals love it because I take care of this product once a month. After five years, I developed a leak. I ordered a new stopper, came today, and problem fixed. It was not a cracked tub.  A whopping $5.00 charge. I would not be without this product. I truly love it, as do my girls. But it does take minimal maintenance.", "Have no fleas no problems. For those that said it made their dogs sick. The only time I've seen dogs get sick from stuff like this is if it is not used correctly. Folly directions.", "This is one of the better flea treatments,I have bought it several times.I like this product,it works.My dog has NEVER had any fleas!"], "review_4": ["I put this in a 37 gallon tank which uses a mechanical filer with carbon filter. So I put this pouch right next to the carbon filter with the hopes of having a clearer water.well, it's been about a week and I don't see any difference. Things could change, but I don't see any indication of hope for now.Maybe I'm using the wrong kind of filter?11/09/12 updatethis product works. I don't know what I was doing wrong in the previous setting, but i bought another bag to substitute the carbons (my Fluval filter has two compartments for carbon bags). the water is as clean as when used carbon bags and I don't need to buy any more carbon bags anymore. if you have doubts about this product like me, remove carbon completely and you will see the difference.", "I bought the first one and the cat liked it. Do not over microwave, it will melt. The trick to having it last 8 hours is the pets bed.I am using this for a mini doxie, 5.5 lbs, I bought her a tunnel bed, and she wears a light sweater, with the snuggle in her bed she is not waking me up to put it inthe microwave at 3 am.Mini dogs have to be kept warm, they die fast. I micro this and put in her car crate when we travel around town.", "The item is okay.  I wanted it for indoor planting.  I use carbon in the bottom of my  planters.  The problem was when I received it.  Somewhere the lid of the container came off and it was leaking out of the shipping box.  Did not lose too much but made a mess in my car where I hauled it home.", "Stress Coat is a great water conditioner but you need seperate conditioner for metals. I don't use no other conditioners due to my water is safe as far as metals go."], "product_4": ["B0002A5VK2", "B00008AJH9", "B0002566YC", "B000255MZG"], "product_1": ["B000256962", "B000255PJE", "B0001AB42C", "B000084F4N"], "score_3": [0.045454545454545456, 0.05263157894736842, 0.07692307692307693, 0.2], "product_3": ["B00025694O", "B00005MF9U", "B0002563WC", "B0002APRT2"]}]