[{
	"score_1": [0.06666666666666667, 0.09090909090909091, 0.09090909090909091, 0.10891089108910891],
	"score_2": [0.05263157894736842, 0.08333333333333333, 0.08333333333333333, 0.1],
	"product_2": ["B009EOKTCM", "B000LPSNRQ", "B004FEGXDK", "B0002KZAKS"],
	"score_4": [0.07142857142857142, 0.125, 0.16666666666666666, 0.25],
	"score_5": [0.1111111111111111, 0.1111111111111111, 0.25, 0.25],
	"review_1": ["This is a cheap piece of junk that does what it says, it distorts, You want something to make your guitar sound like junk, this will do it. Why pedals that make your guitar sound like a piece of junk are the most popular is beyond me. This is not a boutique Distortion pedal like Hendrix would use. Boutique and distortion are an oxymoron.These things are built with heavy metal, it should last, I kinda hope it doesn't(just kidding), you want distortion, you got distortion", "Just assembly for a try, only few rolls with music, it's had some hole on head, that's mean bad quality. buyer beware for this kind of.", "DOWNGRADE TO 1-O STAR AFTER RETURNING IT BACK TO BROOKMAYS, THE SELLER:I am really disappointed by the seller, BrookMays', ignorant responses to my return of the defective Cherbub Guitar Pickup, which picks up unwanted noise by the wire's own movements and the high frequency of feedback that other pickup won't have the same issue.  After two weeks of the returned item was delivered, I didn't hear anything from the seller regarding the return, so I emailed to the seller to see if we can settle it asap.  Too bad, four days after the email had been sent, I only got the email of telling me the case# of the message I sent without any further response to my refund.  until my patience is gone to deal with this hassle, and I don't think it's worth to waste more time on it, despite the fact of wasting the time and money I spent on this useless pickup and the shipping costs. Therefore, yesterday, I emailed my last contact to the seller regarding the refund of the purchase and gonna report this to AMAZON about the bad after-sale service I ever have before if I still haven't heard from the seller shorty.Today, I finally received the seller's response to my refund, the seller denies the issues of the pickup and claims, \"it was not defective. All pickups are going to get unwanted noise if you move the guitar. The feedback can be to to many other issues. I have issued the refund of $7.04.\"  Obviously, the reply is unconvincing; although the feedback can be raised from varies issues, i have tried with another pickup to the same directions and setups, but it doesn't have such problems at all.  The fact is NOT ALL pickups get UNWANTED noise although I didn't try many pickups.  Cherub Guitar Pickup doesn't work as the product description to pickup the original tones of the instrument regardless the surrounding noises.  Moreover, the unwanted loud noise from its wire movements is really annoying, and there's no way to stop the wire movements while strumming. Indeed, I won't use it, and I don't want it to sit at my house as a useless property, so returning back to the seller may help to improve the issues it has.  However, the hassles I got from the seller is totally unexpected and it's NOT worth at all.By the way, I'm also unhappy about the refund of &7.04, I bought it for $8.79 along with AMAZON Free Shipping of the purchase of $25 or more.  To me, it is not the money of $1.75, but it's not fair to the buyer, who doesn't get the right service and quality from the purchase but only wastes the times and money on this matter. So if you really need a pickup for your instrument, I highly recommend you to spend few more dollars to get a much better and reliable one. Don't make the same mistake as I did to try this one because of the cheap price, in turn, you may get more hassles than you expect on such cheap merchandise.  I don't want that happens to anyone else, so I decided to tell you what I went through to keep you from the possible hassles before betting on it.2 STARS FOR THE 1ST REVIEW AFTER USING IT TWICE:I like the clip-on design, which is easy to use, so it is worth 2 stars; however, it doesn't work well clipping on small soundholed string instruments like ukes and kid size guitars because it touches the strings.  Besides that, it also picks up loudly through the wire's own movements, not as the description \"regardless the surrounding noises.\"  I have distressed from those unwanted loud noises.  One more thing that it somehow produces much higher feedback to the mini amp that I use, and I have to turn the volume as low as possible to prevent the high frequency of feedback. However, when I switch to another pickup with the same setup on mini amp and acoustic guitars or uke. the amp doesn't have any feedback even turning it to almost the highest volume, and the other pickup doesn't have the unwanted noise from its own movement either.  I don't know whether is my lack of luck or the poor pickup I got ... I bought it because its cheap price (less than $9) & clip-on design, but, I can't accept the noises and I have to waste my shipping cost to return it back to the seller. So, if you want to give it a try, you may bear in mind that the seller, BrookMays, doesn't take any responsibility for the shipments even the item doesn't work properly as claimed description. Good Luck then!", "garbage if you like it...then buy it.this is NOT how the world of music sounds.TOO MUCH BASS and other garbage...are you guys really HEARING anything ?world has gone bass crazy since about 1981...more and more..we lost analog, we lost quality thanks tocompression and mp3, and now to put morecrap into our ears, they give you ONEfrequency...bass ONLY , take it or leave it.will go find REal headphones, thanks.kb"],
	"product_5": ["B0002GIRP2", "B000EELB8W", "B00178LDW8", "B001DW6RJC"],
	"review_3": ["I won't recommend this to anyone, i actually used this one as a sound card, since doesn't work good for recording.spend some more money if you want something good.", "Bought this on a whim.  It works well when utilized with the amp in direct fashion.  When used with a pedalboard rig, it doesn't add much except for hiss, unfortunately.  Sweet sound with an older Fender amp unit, though.  Does not sound good with updated equipment, Line 6 equipment, Roland units.  I'd say definitely do not get this if you're a tech or gear head.  Get it if you're a simple player with few FX in your arsenal.  It does sound good when just utilized with amp and guitar, amp, wah, and guitar, or amp, wah, guitar, and expression pedal.  Nothing else I've tied it to has seemed to work out, though.  Probably a wasted product with where I'm headed as a technical player, but good for beginners and intermediate levels.  Into King Crimson/Fripp styles?  Don't go for this for modeling.", "I bought this guitar nearly a year ago. It was my first guitar. I never cared much for the sound. It always sounded out of tune, even when it was in tune. I eventually bought an acoustic guitar to learn to play and have been happier with it than this Squier. My skills are slowly improving but I wanted another electric so I sprang for a Epiphone Les Paul. Yes, it's 3x more expensive than the Squier BulletStrat - but it sounds 10x better.If you buy a Squier, I think you need to be prepared to make this a \"project\" guitar. You'll probably want to replace the tuners, pickups, bridge, etc.Or just buy a better guitar to begin with. At this price point you probably won't find much better but you probably want to spend a little more for a much better guitar.", "Good quality cable. I have other cables around it and was unsure about its shielding, but have never noticed any feedback or hissing. Seems like it works just as described.Good delivery time, too."],
	"review_2": ["No manual.  You can print one off the internet but it should come with one given it's price.  I purchase such so I could lay down a rhythem track then go into the solo while attempting to play live.  Don't believe this is what it is mean't for.  A simple delay looper will suffice.  This can do a ton of cool stuff but did not suit my needs.", "soi f you want to turn Distor t off,u cannot.dig?it s always on...alwaysif you like hard rock that wayu need this tiny gig thingie", "I honestly was not impressed. It looked Cheap, sounded cheap, what else is there to say, you get what you pay for!!! Another Chinese copy of a tubescreamer,", "I ordered two of them and both arrived within a week. I tested both of them, they sound quite good as the majority reviewers said (that's why I bought this !!!). And they are solidly built too, not one of the pretty light microphone that comes in with cheap karaoke machine.I don't expect to come with it, so no cable is OK for me.Here is the BUT ...... : there is no ON/OFF switch, this really pissed me off.But this is my fault, I should have read the 1 star review first.The photo shows no ON/OFF switch, however this does not catch any attention.And all seller seems to have trouble to say \"this product does not have this, does not have that...\" It only says what the product does have.Oh well, I got stuck with two microphones without ON/OFF switch.I can buy an adapter with on/off switch for microphone."],
	"review_5": ["man ya'll yall better quick get this here mic yo cuz it's all good and stuff man. because like when you be spittin some siK leeriX and all like i be going in the paint like weezy and eminem ya feel me.ay yo let's go.", "If there are still people out there who don't believe in magic, just try this. It has truly elevated my playing a few notches. I'd probably have bought another bottle already, but this one seems to be lasting forever! I've had it a few months now, I use it pretty much a few times everyday, and it still seems full.If after using this your playing doesn't improve, then maybe you should give up guitar.", "I've been using and abusing pedal effects since the 1970's.  [...] , running all sorts of things through them, chaining them in all sorts of configurations, and have endured many 'wall wart' pedal meltdowns over the years. I said all that b/c I don't want to come off as condescending. I've learned that the single most effective way to power pedals properly is to have an infinite number of 9v batteries, or to be very careful to match pedal inputs with correct adaptor outputs. Check the polarity of the tip - is the tip positive or negative? You'll fry a Boss pedal in a flash if you plug a hot positive tip into one. Make sure the polarity matches (most pedals want negative tip adaptors, except Digitech which want 1/8\" plugs). Make sure the voltage matches. A 3v adaptor into a 9v pedal won't power it. Checking that these things are right will save you some $, and some of the Behringer pedals (I use about six of them on my board...see product links) are \"polarity fragile\", and will break right away with the wrong adaptor. I fried a BBE delay the same way. Happy Effecting!!Behringer SM200 Slow Motion Effects PedalBehringer DD400  Guitar Delay Effect PedalBehringer CS400 Compressor Sustainer Ultimate Dynamics Effects PedalBehringer ADI21 V-Tone AcousticBehringer PB100 Preamplifier/Volume BoosterBehringer PH9 Classic 90 Phase ShifterBehringer US600 Ultra Shifter/Harmonist Ultimate Pitch Shifter / Harmonist Effects PedalBBE TWO TIMER DUAL MODEDigiTech DGR Grunge Analog-Distortion PedalElectro-Harmonix Micro Q-Tron Envelope Follower PedalJim Dunlop M104 Mxr M104 Distortion +DigiTech RP155 Guitar Multi-Effects Processor", "I am self taught, and this pup is essential for tune writing, finding quickie relative minors and such.If you want to understand any theory, start here after learning basic chords.This is how basic chords relate to each other.Yeah, Baby. If you're boss, you need the Info.-Austin Powers?"],
	"review_4": ["what part u dont likeyo u  can use eq to wash it a bit awayit is quite good...CAN BE QUITE SIBILANCE PRONE, so beware...ehso for the priceHighly recommended...in these price ranges..stick to known brandslike shure, ev, at, etc...then come the newbies,a few models from mxl, etc etc...have fun", "I haven't used the cable yet, but it looks new and durable. The cable appears to be structurally sound around end connections and seems to be what I expected. Can't wait for the rest of my gear to get here so I can do a sound test. Based on physical condition, I would recommend this product.", "Consider the distortion sound of Cream, the Doors, and ZZ top.  That buzzy, psychedelic type sound is what this pedal does.  Unfortunately, that's about all it does.  However, if you want to have the perfect \"break on through\" guitar intro sound, this is absolutely the pedal for you.  Quality-wise it's awesome, and if I needed that sound I would definitely own one again.  I got rid of mine to purchase some other gear that served a wider variety of functions, and honestly I haven't missed it, because I'm not in a Doors cover band or anything.", "I haven't used this yet, but it seems solid and idiot proof - just like I need. Play coffee shops and will help if I drop my pick. Very good price."],
	"product_4": ["B002T45X1G", "B0002GMGYA", "B000T517Y4", "B0002IHP0S"],
	"product_1": ["B0002CZV82", "B0002E54FK", "B004UJO41S", "B000ULAP4U"],
	"score_3": [0.05263157894736842, 0.09090909090909091, 0.14285714285714285, 0.14285714285714285],
	"product_3": ["B002QQC1ZI", "B0002GXV3A", "B001J5RYXQ", "B003JJQMD8"]
}]
