[{"score_1": [0.010416666666666666, 0.020833333333333332, 0.08333333333333333, 0.1111111111111111], "score_2": [0.07692307692307693, 0.12121212121212122, 0.14285714285714285, 0.14285714285714285], "product_2": ["B00004R91I", "B00004R8ZE", "B00004OCK3", "B00004RC6R"], "score_4": [0.25, 0.25, 0.25, 0.25], "score_5": [0.07692307692307693, 0.08333333333333333, 0.23529411764705882, 0.25], "review_1": ["I've always found the \"Pie Server\" utensil useless, especially if you don't have room for kitchen cabinets to store all the utensils.  You can get by just by using a fork and a regular butter knife or a turner, a flipper or spatula.That is what I tend to use.  You do have a higher Pie drop ratio with a fork and a butter knife or spatula but it won't matter unless you're in a social setting where a \"Pie Server\" utensil is deemed absolutely necessary.  And then, you'll probably be eating caviar with snob Pie anyways.  Sometimes I even use my dirty hand or just use a dirty spoon to eat Pie out of the tin.Now, I just use the Oxo SteeL Pie Server as a Masonry trowel for spreading mortar on bricks or concrete blocks with a technique called \"buttering\".  It isn't \"heavy duty\" but for touch up jobs, it's acceptable.", "I've always found the \"Pie Server\" utensil useless, especially if you don't have room for kitchen cabinets to store all the utensils. You can get by just by using a fork and a regular butter knife or a turner, a flipper or spatula.That is what I tend to use. You do have a higher Pie drop ratio with a fork and a butter knife or spatula but it won't matter unless you're in a social setting where a \"Pie Server\" utensil is deemed absolutely necessary. And then, you'll probably be eating caviar with snob Pie anyways. Sometimes I even use my dirty hand or just use a dirty spoon to eat Pie out of the tin.Now, I just use the Oxo SteeL Pie Server as a Masonry trowel for spreading mortar on bricks or concrete blocks with a technique called \"buttering\". It isn't \"heavy duty\" but for touch up jobs, it's acceptable.", "I searched for this item on Amazon and read all the positive reviews and forgot to checkout.Ended up at Target over the weekend and bought. I was excited based on the reviews online.I had gotten a honeydew and was excited to try it out.Mine never made 'balls' but long strips and jagged lines.It seemed to be a waste of time and money since I could've done that myself with a regular spoon vs. buying a kitchen tool which will likely not be used again.Disappointing.", "My first reaction is very negative.  If the bowl is to be stored in the freezer in a plastic bag, why doesn't the bowl come in such a bag??My old automatic freezer, pre 1999, came with a very heavy duty bag for such storage.Maybe a gallon ziplock will work???"], "product_5": ["B00004RDCR", "B00004OCL2", "B00000JGRT", "B00004R92T"], "review_3": ["I bought this before I really started getting into cooking, thinking that it was a good idea to have a spoon rest so the counter doesn't get dirty.  But now that I cook a lot, the only thing this thing does is make it so I have one more thing to wash.The item itself is good quality and easy to clean, so if you want a single spoon rest - I would recommend the item.  It's also useful if you're making a single pot meal where you really are only using one utensil - then that ONE utensil can rest here.", "This is Nordicware's Star bundt pan and it is a great item.....but they do make one called the American Star and it is different from the pan pictured.", "If you like mashed potatoes and need a device that will help you turn ordinary round potatoes into something mashed and yummy this is the thing you should buy.  If you are looking for a gizmo that will create grated cheese or something that will help achieve world peace then this is not the thing you should buy...unless you don't already have one because everyone should have one.", "well i like my women with meat on, not too much, not too little. this thing is just a tad on the skinny model side of life. so i am not too sure of it's life-span. from the heft and feel. maybe a few years. my old one was ok, but while on the downhill side of life, a big handle is of value (torque is good), so tis is a replacement. the old one is still alive and sharp and does a bang up job, save the torque thing. now i am ok with miss runway, but like a glamour gal she is on the pricey side...oh i'd say 8-9bucks would be a real deal. 15, well i am not shouting out in glee 'look how much i paid'."], "review_2": ["These pans are very for a home use and can't hold up to commercial use in a bakery.", "I am shocked at how much my boyfriend spent on this pot!  This pressure cooker is beautiful and really REALLY heavily built yet the user's manual says this cooker is not dishwasher safe!  Not even any part of it!  I find it hard to trust this Kuhn Rikon pot with steam under pressure when it can't be washed in the dishwasher!  My mothers old Presto pressure cooker was always washed in the dishwasher, and my daughter, who is still using it to cook for her family, is dishwashing it nearly daily to this day.  I'm going to ask my boyfriend to send this Kuhn Rikon back and buy a Presto pressure cooker.  He'll spend a fraction of the money and get a multi-generational classic.  Maybe the Kuhn Rikon is just a level of \"fancy\" above my interest.", "I bought these, but there not as strong as Binder Clips, that I bought at the stationary store, and the binder clips are alot Less money, and you get a box of them, not just 4...I don't keep a bunch of junk cliped on my refigerator, so I kept these OX0 clips in the drawer, they also take up more space then the Binder Clips do...I'm not impressed with these clips.But I gave them a 2 star for color!!! Big deal lol...", "I purchased this based on the reviews.  Amazon reviews are usually spot on!!  The truth is I don't get how this receives any 5 star reviews.  This thing pops the kernels but the popcorn it makes, tastes terrible!  It makes mushy, chewy, microwave tasting popcorn.  I don't care that it pops all the kernels because the results were so bad that the entire contents of the cheap plastic bowl went in the trash!!  I have returned this and went back to the Presto hot air popper.  I get great poppcorn everytime."], "review_5": ["It's so lovely to have you demand reviews for items I never bought.....and I'm only giving this so you'll stop sending me emails.  &lt;Sigh>", "I'm reviewing this even though I never bought it, for some reason Amazon put it in my items to review. I bought other OXO stuff and it is all good so this probably is too but what do I know. It is a brush, probably brushes stuff, yee-haw!", "Most ice cream beside Bryers contains High fructose corn syrup a genetically altered product the goes the serial sets with acids enzymes and bacteria to create this very unnatural product and while its in alot of adult food suprising it never in baby food maybe that can be expalned as baby rats die in 5 weeks when feed it while normal rats lives an avarage of 2 years unlees there feed a high copper dietso making you own ice cream is much better for you the genetically altered [...]and all those who had one die with in a month or two get over it as you got a defective one so return it. my recomendations is to use it a lot in the first month even if you got to give it to friends to make sure you got a good one. so if it dies you can get contact amazon and get it replaced", "My husband is the cook and makes a fresh artisan bread load everyday.  This basket was the perfect gift for him!"], "review_4": ["Never had a salad spinner before. This one is great.Never be without one again.", "I ordered two of these brushes based on previous good experience with OXO products. They came in today packaged in nothing more than soft plastic sleeves. Sadly this provided no protection during shipping and one of them arrived in pieces; fortunately I had one that was intact and was able to examine it to see how the broken one was supposed to fit together.A problem had developed in that one of the two springs on either side that press against the clam shell portion had been bent out of position so trying to fit the clam shell portions into position with the springs in the right place became something of a challenge.I was finally able to work them into place so the appearance of the broken one was the same as the one that had arrived fully assembled. As of this point both of the clam shells are working as advertised although the one that arrived broken is slightly sluggish; it may be that spring strength was compromised by the bending they received during shipment.Having read the review that refers to the packaging I suppose the packaging had been changed to make removal of the assembly easier. Now it appears the problem is inadequate protection during shipment. I suspect some buyers would simply return the brush and holder rather than see it as an assembly challenge.I will rate the packaging and tell Amazon about the problem. In the meantime they are both in place so we'll give them a test and see if they too live up to the OXO name. I gave it four stars just because of the OXO name and will update if anything notable occurs.", "you should'nt really have a problem with the wire flexibility.  I like this one!  It's comfortable, reliable, economical and cleans up easily.  Find a better one that meets all those criteria (if you can).", "I AM IMPRESSED WITH THE QUALITY OF THIS INEXPENSIVE ROLLING PIN.  THE WOOD IS WONDERFULLY SMOOTH.  I WAS SURPRISED, THOUGH, TO SEE THAT THE DIAMETER OF THE ROLLING PIN WAS SO MUCH SMALLER THAN MY TRADITIONAL ROLLING PIN WITH HANDLES.  THE LENGTH SEEMS TO BE ABOUT RIGHT.  I HAVE YET TO USE THE PIN, BUT I'M CONCERNED THAT THE DIAMETER MIGHT MAKE FOR MORE WORK."], "product_4": ["B00004OCKR", "B00004OCLH", "B00004OCNK", "B00004RHPW"], "product_1": ["B00004OCMB", "B00004OCMB", "B00004OCM4", "B00000JGRT"], "score_3": [0.1111111111111111, 0.125, 0.13636363636363635, 0.16981132075471697], "product_3": ["B00004RFIX", "B00004RFQ2", "B00004OCL9", "B00004OCMM"]}]