[{"score_1": [0.1, 0.1, 0.14285714285714285, 0.14285714285714285], "score_2": [0.16666666666666666, 0.2, 0.2, 0.25], "product_2": ["B00006XXGO", "B00026UM5A", "B0006MZHKA", "B0000C321X"], "score_4": [0.3333333333333333, 0.375, 0.4, 0.5], "score_5": [0.2, 0.25, 0.25, 0.25], "review_1": ["The title says it all. I placed my order days ago yet it sits and sits and Amazon has NO NO NO way to contact any seller despite what they print in their alleged 'help'  section. So I am out the money and NO WAY TO CONTACT ANYONE AT ALL. I have dealt with Amazon for years and I know or I should say I knew there used to be a way to contact them. But in the age of no choices or one choice to fit all Amazon ONLY allows one to cancel. I know if I were a merchant I'd be very pissed about reviews that make the site usafe to use but there it is. Amazon NOW REFUSED TO BE CONTACTED MUCH LIKE EBAY IS AN ISLAND TO ITSELF ABOVE THE LAWS.", "I purchase these for my husband and when I opened the packaged, I had an instant visualization of my husband wearing these. I immediately decided they were going back and ordered him a thicker non see through pair, which he loves.", "Not the greatest look, but if you need super wide bottomed pants you might like these.  I do not think they flatter so I would only wear them if you have to keep your shoes on when removing them.", "Certainly this shirt looks nice enough--no better than your average shirt really.  Shirts cut straight from armpit to tail should be banned--their manufacturer's relegated to fry cooking at McDonalds instead of making useless ugly shirts cut like these.  Hey Geoffrey, 32 should be closer to 32 than 64!And those using those plastic collar stays that fall out all the time should have a special torture designed for them.  And their shirts should be rigged to apply that torture the moment the stays fall out.  These shirts alone would put them in an asylum since the stays fall out every time they are washed.This shirt has both of these indicators that the manufacturer has no business manufacturing pick-up sticks let alone shirts.My last purchase of anything made by this pretender."], "product_5": ["B0002XSXWC", "B0000722HK", "B00007GD9I", "B000147990"], "review_3": ["The shoe trees are nice, but when I returned the wrong shoe tree the second time, it was sent back to me, supposedly by mistake. The company did not solve the problem to my satisfaction. I kept the shoe tree, but will not buy anymore!", "when we received the jacket, it was suppose to be red-orange and was actually an ugly burnt orange...no red in it. My husband is a 2X but I followed the advice in comments and purchased the XL  since they are oversized and it fit my husband well. My husband likes it so we won't be returning it.", "As soon as I saw this dress I had to have it..it's all retro hotness, so I thought it would be perfect for dinner parties and such. It arrived and I've worn it only once.  The bust portion is WAY big (I'm a 36C and usually have the reverse problem with dresses) and the waist is a little tight (I'm a size 14).  This was my first strapless dress, so I felt a little self-concious with the loose bust enough as it was.  I think I could deal with it if it came with straps.", "I got this shirt for Halloween but it was too large. I ordered a small and it seemed like an extra large. The material is fine. It is thinner than the average tee. I don't consider this the best tee since it feels weird when I wear it."], "review_2": ["My son only wore these shoes once (he's only 2) because they cause so much distress to get on and off, we just don't bother anymore. Why they dont make a  hidden zip for the toddler sizes is beyond me. They're expensive so wait until they're older before buying this type of shoe.", "I expected these to be loose and comfortable to wear around the house in lieu of slippers.However, they are way too tight around the calf and would only work for me when using them with high boots.", "I hadn't looked at these jeans when they were delivered. As I was starting to wrap them for Christmas, I noticed they were a BUTTON fly!  Nowhere in the description did it say that.  The fabric was tacky and had a sheen to it.  NOT nice at all.", "My husband has worn these pants since I met him in 1991. These pants are much smaller than the pants we have purchased in the past. I'm not sure if I'll have to get one or two sizes larger in the waist. The other's started off loose and tightened up a bit as they were laundered. These are so tight I'm afraid to wash them. He can barely get them buttoned. I will need to exchange them for a larger size."], "review_5": ["Elagante y fresca camisa. Sirve para cualquier oportunidad. Las tallas son grandes (la M bien podr&iacute;a pasar por una L peque&ntilde;a)", "First off, I just ordered the shirt late Thursday night & received it at 9am Saturday; talk about fast delivery! I was told delivery wouldn't take place until 12/21 - 12/27, so kudos on going out of their way to FedEx it overnight.The shirt looks & feels great. I can't tell you how well it fits as it's a gift for my son.", "I needed a new one and say this and bought on a wim, But love it, I will buy a new just loke it when it&if ever falls apart!", "I ended up gaining a lot of stress weight just before my wedding, and needed to cinch in so i could lace my dress closed.It is comfortable, and stays in place. Also very breathable.I wore it the whole day.I've worn it since when i needed a bit of extra help getting into dress pants.Been through about 7 washes, and just got a small tear on the inside.Also take note that the garter clips are removable.Goes clear up to almost my bra in the front.Was well worth the money."], "review_4": ["From high school on, these have been a staple. Nothing much to them, just canvass and a fairly poorly supported insole on a fairly sturdy shoe bottom.  Cool and comfortable, these are the perfect &#34;knocking around&#34; shoes. No delivery issues - came in the two business days promised by Prime.", "I ordered these hoping they can be worn at work instead of dress sweaters that cost $9 to dry clean!", "FOR ME, THE EASY SPIRT \"MOTION\" SHOE IS T_H_E PERFECT SHOE.  I am unable to wear heels, (long story) -- but these shoes, which lace up as in any true oxford, have a streamlined look that many other oxford shoes today, burdened as they are with extra outside padding, do not.  The result is, that this is indeed a SLIM, WALKING shoe, not a bulky sports shoe.  It is as neat and pretty as any woman's oxford shoe can be.This is a very, very comfortable shoe.  It is not quite accurate to say it is like walking on air --but it IS as comortable as a shoe can be, I believe, without going to the expense of custom-made shoes.When a shoe comes in many, many colours, you KNOW it has to be a GOOD shoe.  Because so many people are buying it, the manufacturer can afford to branch out and make it in many different colours.  For a very long time, I happily wore the WHITE color of this shoe, whilst my mom wore the WHEAT colour.  We were both very happy with them!Then, I saw in a well-known catalogue, that they are available from the store associated with that catalogue, (on special order only), in G O L D colour!  And not just a \"goldEN\" colour -- but a true, gold foil colour!  And at the same price as all the other colours!  All that \"special ordering\" the gold (foil) shoes, was to wait a few weeks longer.I have now worn the (shiny!) gold (foil) colour of Easy Spirit \"Motion\" shoes for a few years.  I have gotten several very nice complimnts on them as well!  And no wonder -- they look almost like golden-colour \"bronzedd\" baby shoes, or, are somewhat similar to the sheen in Princess Elizabeth and Princess Margaret's flat pumps, in the famous \"double negative\" picture, by Marcus Adams -- taken in Buckingham Palace, with their mother, father, and corgi dog.  The picture is in black and white, so I have no idea if the Princesses wore gold or silver pumps in it.  But -- the foil-bright SHINE is the same! In the words of the classic song... \" Oh.....dem golden slippers....! \" : )As I've said, I've gotten several compliments on my golden oxford Easy Spirit motion shoes.  For someone who cannot wear a heel above a half-an-inch, this is doubly gratifying.  HOWEVER, I DO NOT SEEM TO BE ABLE TO FIND THE 'GOLD' (FOIL), COLOUR OF THESE SHOES HERE ON AMAZON, and so must get my shoes elsewhere.  Sometimes at an even more expensive price, and a longer wait.It would be nice to have a \"Gold Easy-Spirit Motion Community\" here on Amazon.  I really would like to get together with others who wear, not only Easy Spirit Motion shoes, but the Gold Foil Colour of Easy-Spirit Motion shoes.  I hope to see them here on Amazon soon, so that others may experience the joy of being complimented, often, on THEIR Gold-Foil colour Easy Spirit Motion shoes, too!", "Prompt delivery, and it is exactly as described.  The only reason I did not give it 5 stars is because I haven't washed it yet- so I don't know how it will hold up... Other than that my little girl LOVES her tutus (we got one in light pink also), especially spinning and running in them :)  She's on the little side, so my concern was that it would be too big, but the fit is perfect!  The elastic waist will expand with her as she grows."], "product_4": ["B000072UMJ", "B00062NOFU", "B0002QRZZ0", "0000031887"], "product_1": ["B0006LMBJ6", "B0006UTPT6", "B00020ZUC6", "B0002VA3C2"], "score_3": [0.26666666666666666, 0.3333333333333333, 0.3333333333333333, 0.3333333333333333], "product_3": ["B00020BFSE", "B0000ASFDC", "B0006VN9EW", "B00073ZLIG"]}]